tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
/*
 * ESP32-HAM-CLOCK - Odbiornik DX Cluster i stacji APRS-IS z interfejsem WWW i opcjonalnym wyświetlaczem TFT
 * 
 * 
  if (now - lastTelnetAttempt < 20000) {
 * - WiFi Manager (AP mode jeśli brak zapisanych danych)
 * - Połączenie z Telnet DX Cluster (TYLKO ODBIĂ“R - nie wysyła spotów)
 * - Parsowanie i przechowywanie spotów DX
 * - Obliczanie odległości (Haversine)
 * - Interfejs WWW z polling (odświeżanie co 2 sekundy)
 * - Wyświetlacz TFT (ESP32-2432S028) - opcjonalnie ESP32 WROOM + TFT ILI9341 
 * 
 * UWAGA: Urządzenie działa TYLKO w trybie odbioru.
 * Nie wysyła żadnych spotów do DX Cluster - tylko odbiera i wyświetla informacje.
 * Tak samo z APRS.fi  - tylko odczyt.
 */

#include <Arduino.h>

// Wczesne forward-deklaracje, aby auto-prototypowanie Arduino znało typy używane w sygnaturach
enum ScreenType : uint8_t;    // pełna definicja niżej
enum Screen6ViewMode : uint8_t;
struct DXSpot;                // pełna definicja niżej
struct APRSStation;           // pełna definicja niżej
struct AprsWxDecoded;         // pełna definicja niżej
struct PropagationData;       // pełna definicja niżej
struct WeatherAlertInfo;      // pełna definicja niżej

// Forward declarations for UnlisHunter state used before global definitions.
extern bool unlisRunning;
extern bool unlisGameOver;

// Zastępuje polskie znaki w opisach, aby uniknąć problemów z fontem
void normalizePolish(String &text) {
  text.replace("ą", "a");
  text.replace("ć", "c");
  text.replace("ę", "e");
  text.replace("ł", "l");
  text.replace("ń", "n");
  text.replace("ó", "o");
  text.replace("ś", "s");
  text.replace("ź", "z");
  text.replace("ż", "z");
  text.replace("Ą", "A");
  text.replace("Ć", "C");
  text.replace("Ę", "E");
  text.replace("Ł", "L");
  text.replace("Ń", "N");
  text.replace("Ó", "O");
  text.replace("Ś", "S");
  text.replace("Ź", "Z");
  text.replace("Ż", "Z");
}

// ========== KONFIGURACJA WYŚWIETLACZA TFT ==========
// Włącz TFT w platformio.ini (build_flags) lub Arduino IDE; guard to avoid redefinition warnings
#ifndef ENABLE_TFT_DISPLAY
#define ENABLE_TFT_DISPLAY
#endif

#include <WiFi.h>
#include <WiFiClient.h>
#include <WebServer.h>
#include <Preferences.h>
#include <time.h>
#include <sys/time.h>
#include <ArduinoJson.h>
#include "esp_rom_sys.h"
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <FS.h>
#include <LittleFS.h>
#include <math.h>
#include <ctype.h>

// ========== TYPY EKRANÓW (używane w prototypach) ==========
enum ScreenType : uint8_t {
  SCREEN_OFF = 0,
  SCREEN_HAM_CLOCK = 1,
  SCREEN_DX_CLUSTER = 2,
  SCREEN_SUN_SPOTS = 3,
  SCREEN_BAND_INFO = 4,
  SCREEN_WEATHER_DSP = 5,
  SCREEN_APRS_IS = 6,
  SCREEN_POTA_CLUSTER = 7,
  SCREEN_HAMALERT_CLUSTER = 8,
  SCREEN_APRS_RADAR = 9,
  SCREEN_MATRIX_CLOCK = 10,
  SCREEN_UNLIS_HUNTER = 11,
  SCREEN_WEATHER_FORECAST = 12,
  SCREEN_LOKALIZACJA = 13
};

#define LOG_VERBOSE false
#define LOGV_PRINT(x) do { if (LOG_VERBOSE) Serial.print(x); } while (0)
#define LOGV_PRINTLN(x) do { if (LOG_VERBOSE) Serial.println(x); } while (0)
#define LOGV_PRINTF(...) do {} while (0)

// Monitor RAM na Serial (kontrolnie co 1 s).
// Ustaw false, gdy logi nie są potrzebne.
#define RAM_MONITOR_ENABLED false
#define RAM_MONITOR_INTERVAL_MS 1000UL

static void logRamUsage(unsigned long nowMs) {
  if (!RAM_MONITOR_ENABLED) {
    return;
  }

  static unsigned long lastRamLogMs = 0;
  if ((nowMs - lastRamLogMs) < RAM_MONITOR_INTERVAL_MS) {
    return;
  }
  lastRamLogMs = nowMs;

  const uint32_t freeHeap = ESP.getFreeHeap();
  const uint32_t minFreeHeap = ESP.getMinFreeHeap();
  const uint32_t maxAllocHeap = ESP.getMaxAllocHeap();

#if CONFIG_SPIRAM_SUPPORT
  const uint32_t freePsram = ESP.getFreePsram();
  const uint32_t totalPsram = ESP.getPsramSize();
#else
  const uint32_t freePsram = 0;
  const uint32_t totalPsram = 0;
#endif

  Serial.printf("[RAM] free=%u min=%u maxAlloc=%u psram=%u/%u\n",
                freeHeap,
                minFreeHeap,
                maxAllocHeap,
                freePsram,
                totalPsram);
}

// W setup() są długie, blokujące odcinki (splash/delay), więc loop jeszcze nie loguje.
// Ta pomocnicza funkcja utrzymuje periodyczne logi RAM także przed startem loop().
static void delayWithRamLogs(unsigned long delayMs) {
  unsigned long startMs = millis();
  while ((millis() - startMs) < delayMs) {
    logRamUsage(millis());
    delay(50);
    yield();
  }
}

// ========== WYŚWIETLACZ TFT (ESP32-2432S028) ==========
#ifdef ENABLE_TFT_DISPLAY
#include <TFT_eSPI.h>
#include <XPT2046_Touchscreen.h>
TFT_eSPI tft = TFT_eSPI();

// Piny TFT dla ESP32-2432S028 (CYD - Cheap Yellow Display)
// Zgodnie z dokumentację: https://github.com/rzeldent/platformio-espressif32-sunton
// ILI9341 kontroler, SPI interface
// 
// W Arduino IDE: piny są definiowane w User_Setup.h (skopiuj plik do folderu biblioteki TFT_eSPI)
// W PlatformIO: piny są definiowane w platformio.ini przez build_flags
//
// Fallback dla backlight (jeśli nie zdefiniowane w User_Setup.h lub build_flags)
#ifndef TFT_BL
#define TFT_BL 21  // Backlight pin (GPIO21 dla ESP32-2432S028)
#endif

#define TFT_BL_PIN TFT_BL

#define BACKLIGHT_PWM_CHANNEL 0
#define BACKLIGHT_PWM_FREQ 5000
#define BACKLIGHT_PWM_RES_BITS 8
#define MIN_BACKLIGHT_PERCENT 10
#define TFT_BACKLIGHT 100
int backlightPercent = TFT_BACKLIGHT;
int tftNightDimmingPercent = 0;
int currentBacklightAppliedPercent = TFT_BACKLIGHT;
unsigned long lastBacklightDayNightCheckMs = 0;
const unsigned long BACKLIGHT_DAY_NIGHT_CHECK_INTERVAL_MS = 5UL * 60UL * 1000UL; // 5 min

// ========== DOTYK (XPT2046 - ESP32-2432S028R) ==========
#ifndef TOUCH_CS
#define TOUCH_CS 33
#endif
#ifndef TOUCH_IRQ
//#define TOUCH_IRQ 36 // domyślnie 36 a dla zewnętrznego TFT ILI9341 użyć 35
#define TOUCH_IRQ 35 // dla zewnętrznego TFT ILI9341
#endif
#ifndef TOUCH_MOSI
#define TOUCH_MOSI 32
#endif
#ifndef TOUCH_MISO
//#define TOUCH_MISO 39 // domyślnie 39 a dla zewnętrznego TFT ILI9341 użyć 27
#define TOUCH_MISO 27 // dla zewnętrznego TFT ILI9341
#endif
#ifndef TOUCH_CLK
#define TOUCH_CLK 25
#endif

// Kalibracja dotyku (dopasuj jeśli pozycje są przesunięte)
#define TOUCH_X_MIN 200
#define TOUCH_X_MAX 3800
#define TOUCH_Y_MIN 200
#define TOUCH_Y_MAX 3800
#define TOUCH_SWAP_XY false
#define TOUCH_INVERT_X false
#define TOUCH_INVERT_Y false

int touchXMin = TOUCH_X_MIN;
int touchXMax = TOUCH_X_MAX;
int touchYMin = TOUCH_Y_MIN;
int touchYMax = TOUCH_Y_MAX;
bool touchSwapXY = TOUCH_SWAP_XY;
bool touchInvertX = TOUCH_INVERT_X;
bool touchInvertY = TOUCH_INVERT_Y;
uint8_t touchRotation = 1;
uint8_t tftRotation = 1;
#ifdef TFT_INVERSION_ON
bool tftInvertColors = true;
#else
bool tftInvertColors = false;
#endif

bool tftInitialized = false;
SPIClass touchSPI(VSPI);
XPT2046_Touchscreen touch(TOUCH_CS, TOUCH_IRQ);

