tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
int bootLogY = 2;
const int BOOT_LOG_LINE_HEIGHT = 10;
bool bootSequenceActive = true;
bool littleFsReady = false;

// ========== SYSTEM MENU I NAWIGACJI ==========
const int SCREEN_PAGE_COUNT = 12;
const ScreenType DEFAULT_SCREEN_ORDER[SCREEN_PAGE_COUNT] = {
  SCREEN_HAM_CLOCK,
  SCREEN_DX_CLUSTER,
  SCREEN_APRS_IS,
  SCREEN_APRS_RADAR,
  SCREEN_BAND_INFO,
  SCREEN_SUN_SPOTS,
  SCREEN_WEATHER_DSP,
  SCREEN_WEATHER_FORECAST,
  SCREEN_POTA_CLUSTER,
  SCREEN_HAMALERT_CLUSTER,
  SCREEN_MATRIX_CLOCK,
  SCREEN_LOKALIZACJA
};

ScreenType screenOrder[SCREEN_PAGE_COUNT] = {
  SCREEN_HAM_CLOCK,
  SCREEN_DX_CLUSTER,
  SCREEN_APRS_IS,
  SCREEN_APRS_RADAR,
  SCREEN_BAND_INFO,
  SCREEN_SUN_SPOTS,
  SCREEN_WEATHER_DSP,
  SCREEN_WEATHER_FORECAST,
  SCREEN_POTA_CLUSTER,
  SCREEN_HAMALERT_CLUSTER,
  SCREEN_MATRIX_CLOCK,
  SCREEN_LOKALIZACJA
};
ScreenType currentScreen = SCREEN_OFF;  // Ustawiany po wczytaniu preferencji
bool inMenu = false;    // Czy jesteśmy w menu wewnętrznym strony
int menuOption = 0;     // Aktualna opcja w menu (jeśli inMenu == true)
const int DEFAULT_TFT_SWITCH_TIME_SEC = 30;
bool tftAutoSwitchEnabled = false;
int tftAutoSwitchTimeSec = DEFAULT_TFT_SWITCH_TIME_SEC;
unsigned long tftAutoSwitchLastMs = 0;
ScreenType tftAutoSwitchLastScreen = SCREEN_OFF;
unsigned long autoswitchPausedUntilMs = 0; // pauza autoswitch po dotknięciu środka ekranu
unsigned long lastScreenUpdate = 0;
const unsigned long SCREEN_UPDATE_INTERVAL = 100; // Aktualizuj ekran co 100ms
const unsigned long DX_SCREEN_MIN_REDRAW_MS = 5000; // Ogranicz zapis tabeli DX do max 1 raz/5s
unsigned long lastScreen1UpdateMs = 0;
unsigned long lastScreen3UpdateMs = 0;
unsigned long lastScreen4UpdateMs = 0;
unsigned long lastScreen5UpdateMs = 0;
unsigned long lastScreen7UpdateMs = 0;
unsigned long lastScreen8UpdateMs = 0;
unsigned long lastScreenLocationUpdateMs = 0;
bool screen1HeaderNeedsRedraw = true;

const int TFT_TABLE_TOP = 32;
const int TFT_TABLE_BOTTOM = 220;
const int TFT_TABLE_WIDTH = 320;
const int TFT_TABLE_HEIGHT = TFT_TABLE_BOTTOM - TFT_TABLE_TOP;
// UnlisHunter constants must be visible before touch handling code uses them.
const int UNLIS_CENTER_X = 160;
const int UNLIS_CENTER_Y = 120;
const int UNLIS_OUTER_R = 115; // 2m
const int UNLIS_INNER_R = 60;  // 70cm
const int UNLIS_BTN_SIZE = 100;
const int UNLIS_DRAW_BTN_SIZE = UNLIS_BTN_SIZE / 2;
const int UNLIS_START_X = 0;
const int UNLIS_START_Y = 0;
const int UNLIS_PTT_X = 320 - UNLIS_BTN_SIZE;
const int UNLIS_PTT_Y = 240 - UNLIS_BTN_SIZE;
const int UNLIS_EXIT_X = 0;
const int UNLIS_EXIT_Y = 240 - UNLIS_BTN_SIZE;
const unsigned long UNLIS_FRAME_MS = 40UL;
const float UNLIS_BASE_SCAN_DEG_PER_SEC = 46.0f;
const float UNLIS_ACCEL_PER_CATCH_EARLY = 0.05f;
const float UNLIS_ACCEL_PER_CATCH_LATE = 0.03f;
const float UNLIS_TARGET_LIFE_ROTATIONS = 2.5f;
const unsigned long UNLIS_TARGET_RESPAWN_MIN_MS = 450UL;
const unsigned long UNLIS_TARGET_RESPAWN_MAX_MS = 1200UL;
const unsigned long UNLIS_SECOND_TARGET_DELAY_MS = 60000UL;
const unsigned long UNLIS_SECOND_TARGET_RESPAWN_MIN_MS = 3500UL;
const unsigned long UNLIS_SECOND_TARGET_RESPAWN_MAX_MS = 9500UL;
const unsigned long UNLIS_GREEN_STATION_LIFE_MS = 5000UL;
const unsigned long UNLIS_GREEN_STATION_RESPAWN_MIN_MS = 9000UL;
const unsigned long UNLIS_GREEN_STATION_RESPAWN_MAX_MS = 18000UL;
const unsigned long TABLE_NAV_FOOTER_VISIBLE_MS = 5000UL;
unsigned long tableNavFooterVisibleUntilMs = 0;
#ifndef TFT_TABLE_SPRITE_COLOR_DEPTH
#define TFT_TABLE_SPRITE_COLOR_DEPTH 16
#endif
const uint16_t TFT_TABLE_ALT_ROW_COLOR = 0x0841;
TFT_eSprite sharedTableSprite = TFT_eSprite(&tft);
bool sharedTableSpriteReady = false;
bool sharedTableSpriteInitTried = false;

static bool ensureSharedTableSprite() {
  if (sharedTableSpriteReady) {
    return true;
  }
  if (sharedTableSpriteInitTried) {
    return false;
  }

  sharedTableSpriteInitTried = true;
  sharedTableSprite.setColorDepth(TFT_TABLE_SPRITE_COLOR_DEPTH);
  sharedTableSpriteReady = (sharedTableSprite.createSprite(TFT_TABLE_WIDTH, TFT_TABLE_HEIGHT) != nullptr);
  if (!sharedTableSpriteReady) {
    LOGV_PRINTLN("[TFT] Shared table sprite alloc failed, fallback to direct draw");
    return false;
  }
  return true;
}

static bool isTableFooterScreen(ScreenType screenNum) {
  return (screenNum == SCREEN_DX_CLUSTER ||
          screenNum == SCREEN_POTA_CLUSTER ||
          screenNum == SCREEN_HAMALERT_CLUSTER ||
          screenNum == SCREEN_APRS_IS ||
          screenNum == SCREEN_WEATHER_DSP ||
          screenNum == SCREEN_WEATHER_FORECAST);
}

static bool isTableNavFooterVisible(ScreenType screenNum) {
  return isTableFooterScreen(screenNum) && millis() < tableNavFooterVisibleUntilMs;
}

static int getTableMaxRowsForScreen(ScreenType screenNum) {
  return isTableNavFooterVisible(screenNum) ? 10 : 11;
}

static int getTableBottomForScreen(ScreenType screenNum) {
  return isTableNavFooterVisible(screenNum) ? TFT_TABLE_BOTTOM : 240;
}

extern uint16_t menuThemeColor;

static void drawSwitchScreenFooter() {
  tft.fillTriangle(10, 230, 20, 222, 20, 238, menuThemeColor);
  tft.fillTriangle(310, 230, 300, 222, 300, 238, menuThemeColor);
  tft.setTextColor(0x52AA);
  tft.setTextSize(1);
  tft.setCursor(125, 226);
  tft.print("SWITCH SCREEN");
}

// Ustawienie trybu czasu dla ekranu 1
enum Screen1TimeMode {
  SCREEN1_TIME_UTC = 0,
  SCREEN1_TIME_LOCAL = 1
};
uint8_t screen1TimeMode = SCREEN1_TIME_UTC;

enum TftLang : uint8_t {
  TFT_LANG_PL = 0,
  TFT_LANG_EN = 1
};
uint8_t tftLanguage = TFT_LANG_PL;

enum TftStyleMode : uint8_t {
  TFT_STYLE_DARK = 0,
  TFT_STYLE_LIGHT = 1
};
uint8_t tftStyleMode = TFT_STYLE_DARK;

struct TftUiPalette {
  uint16_t bg;
  uint16_t fg;
  uint16_t muted;
  uint16_t accent;
  uint16_t rowAlt;
};

TftUiPalette tftUiPalette = {
  TFT_BLACK,
  TFT_WHITE,
  TFT_LIGHTGREY,
  0xFD20,
  TFT_TABLE_ALT_ROW_COLOR
};

enum DxTableSizeMode : uint8_t {
  DX_TABLE_SIZE_NORMAL = 0,
  DX_TABLE_SIZE_ENLARGED = 1
};
uint8_t dxTableSizeMode = DX_TABLE_SIZE_NORMAL;

// Font z polskimi znakami dla daty/dnia tygodnia
#define ROBOTO_FONT10_NAME "/fonts/Roboto10"
#define ROBOTO_FONT10_FILE "/fonts/Roboto10.vlw"
#define ROBOTO_FONT12_NAME "/fonts/Roboto12"
#define ROBOTO_FONT12_FILE "/fonts/Roboto12.vlw"
#define ROBOTO_FONT20_NAME "/fonts/Roboto20"
#define ROBOTO_FONT20_FILE "/fonts/Roboto20.vlw"

static bool tryLoadSmoothFont(const char *fontName, const char *fontFile) {
  if (!littleFsReady || !LittleFS.exists(fontFile)) {
    return false;
  }
  if (tft.fontLoaded) {
    tft.unloadFont();
  }
  tft.loadFont(fontName, LittleFS);
  return tft.fontLoaded;
}

