tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
// Po aktualizacji frameworku pierwszy loadFont bywa niestabilny.
// Wariant "light" celowo robi tylko pojedynczy warmup fontu startowego,
// aby nie generować burstu otwarć plików LittleFS (FD).
static bool warmupSmoothFonts() {
  if (!littleFsReady) {
    return false;
  }

  if (!LittleFS.exists(ROBOTO_FONT20_FILE)) {
    return false;
  }

  const bool loaded = tryLoadSmoothFont(ROBOTO_FONT20_NAME, ROBOTO_FONT20_FILE);
  if (tft.fontLoaded) {
    tft.unloadFont();
  }
  yield();
  return loaded;
}


enum TrKey : uint8_t {
  TR_TIME_SHORT = 0,
  TR_CALL_SHORT,
  TR_COUNTRY,
  TR_WAITING_SPOTS,
  TR_WEATHER,
  TR_TEMPERATURE,
  TR_HUMIDITY,
  TR_PRESSURE,
  TR_WIND,
  TR_FORECAST_3H,
  TR_FORECAST_TOMORROW,
  TR_NO_DATA,
  TR_ERROR_PREFIX,
  TR_PAGE,
  TR_TFT_CALIBRATION_HINT,
  TR_TFT_CALIBRATE_BTN,
  TR_ROT_90_RIGHT,
  TR_ROT_90_LEFT,
  TR_DISPLAY_SETTINGS,
  TR_BRIGHTNESS,
  TR_THEME_COLOR,
  TR_HOLD_CAL_HINT,
  TR_SAVE,
  TR_DEFAULT,
  TR_CLOSE,
  TR_LANGUAGE,
  TR_KEY_COUNT
};

static const char* TR_PL[TR_KEY_COUNT] = {
  "Czas",
  "Znak",
  "KRAJ",
  "Oczekiwanie na spoty...",
  "POGODA",
  "TEMPERATURA",
  "WILGOTNOŚĆ",
  "CIŚNIENIE",
  "WIATR",
  "Prognoza na 3 godziny:",
  "Prognoza na jutro:",
  "Brak danych",
  "BLAD: ",
  "Strona",
  "Przytrzymaj 5 sek = Kalibracja",
  "TFT Kalibracja",
  "Obrot 90deg w prawo (rot90cw)",
  "Obrot 90deg w lewo (rot90ccw)",
  "USTAWIENIA TFT",
  "JASNOSC:",
  "KOLOR MOTYWU:",
  "Przytrzymaj 3 sek = Kalibracja",
  "ZAPISZ",
  "DOMYSLNE",
  "ZAMKNIJ",
  "JEZYK"
};

static const char* TR_EN[TR_KEY_COUNT] = {
  "Time",
  "Call",
  "COUNTRY",
  "Waiting for spots...",
  "WEATHER",
  "TEMPERATURE",
  "HUMIDITY",
  "PRESSURE",
  "WIND",
  "Forecast (3 hours):",
  "Forecast for tomorrow:",
  "No data",
  "ERROR: ",
  "Page",
  "Hold 5 sec anywhere = Calibration:",
  "TFT Calibrate",
  "Rotate 90 deg right (rot90cw)",
  "Rotate 90 deg left (rot90ccw)",
  "DISPLAY SETTINGS",
  "BRIGHTNESS:",
  "THEME COLOR:",
  "Hold 3 sec anywhere = Calibration",
  "SAVE",
  "DEFAULT",
  "CLOSE",
  "LANGUAGE"
};

static const char* tr(TrKey key) {
  uint8_t idx = static_cast<uint8_t>(key);
  if (idx >= TR_KEY_COUNT) {
    return "";
  }
  return (tftLanguage == TFT_LANG_EN) ? TR_EN[idx] : TR_PL[idx];
}

static const char* tftLangToCode(uint8_t lang) {
  return (lang == TFT_LANG_EN) ? "en" : "pl";
}

static uint8_t tftLangFromCode(const String &code) {
  String up = code;
  up.toLowerCase();
  if (up == "en") {
    return TFT_LANG_EN;
  }
  return TFT_LANG_PL;
}

static const char* tftStyleToCode(uint8_t style) {
  return (style == TFT_STYLE_LIGHT) ? "light" : "dark";
}

static uint8_t tftStyleFromCode(const String &code) {
  String up = code;
  up.toLowerCase();
  if (up == "light" || up == "jasny" || up == "white") {
    return TFT_STYLE_LIGHT;
  }
  return TFT_STYLE_DARK;
}

static const char* dxTableSizeToCode(uint8_t mode) {
  return (mode == DX_TABLE_SIZE_ENLARGED) ? "enlarged" : "normal";
}

static uint8_t dxTableSizeFromCode(const String &code) {
  String up = code;
  up.toLowerCase();
  if (up == "enlarged" || up == "large" || up == "big") {
    return DX_TABLE_SIZE_ENLARGED;
  }
  return DX_TABLE_SIZE_NORMAL;
}

static bool isDxTableEnlarged() {
  return dxTableSizeMode == DX_TABLE_SIZE_ENLARGED;
}

static int getDxTableMaxRows() {
  if (!isDxTableEnlarged()) {
    return getTableMaxRowsForScreen(SCREEN_DX_CLUSTER);
  }
  return isTableNavFooterVisible(SCREEN_DX_CLUSTER) ? 6 : 7;
}

static int getPotaTableMaxRows() {
  if (!isDxTableEnlarged()) {
    return getTableMaxRowsForScreen(SCREEN_POTA_CLUSTER);
  }
  return isTableNavFooterVisible(SCREEN_POTA_CLUSTER) ? 6 : 7;
}

static int getHamalertTableMaxRows() {
  if (!isDxTableEnlarged()) {
    return getTableMaxRowsForScreen(SCREEN_HAMALERT_CLUSTER);
  }
  return isTableNavFooterVisible(SCREEN_HAMALERT_CLUSTER) ? 6 : 7;
}

static int getAprsTableMaxRows() {
  if (!isDxTableEnlarged()) {
    return getTableMaxRowsForScreen(SCREEN_APRS_IS);
  }
  return isTableNavFooterVisible(SCREEN_APRS_IS) ? 6 : 7;
}

static bool isTftStyleLight() {
  return tftStyleMode == TFT_STYLE_LIGHT;
}

static uint16_t tftHeaderBgColor() {
  return tftUiPalette.accent;
}

static uint16_t tftHeaderTextColor() {
  return isTftStyleLight() ? tftUiPalette.fg : TFT_BLACK;
}

static uint16_t tftTableFreqColor() {
  return isTftStyleLight() ? tftUiPalette.fg : TFT_YELLOW;
}

static uint16_t tftTableModeColor() {
  return isTftStyleLight() ? tftUiPalette.fg : TFT_GREEN;
}

static uint16_t tftTableAccentTextColor() {
  return isTftStyleLight() ? tftUiPalette.fg : menuThemeColor;
}

static uint16_t getAprsCallsignColorForEnlarged(const APRSStation &station) {
  if (isTftStyleLight()) {
    return tftUiPalette.fg;
  }
  String symbolShort = getAPRSSymbolShort(station);
  if (symbolShort == "HOUSE") return TFT_YELLOW;
  if (symbolShort == "HUMAN") return 0x3C1F;
  if (symbolShort == "CAR") return TFT_RED;
  if (symbolShort == "HAMCLOCK") return TFT_ORANGE;
  return TFT_WHITE;
}
#endif

// Kolorystyka motywu menu
#define DEFAULT_MENU_THEME_COLOR 0xFD20
#define DEFAULT_MENU_THEME_HUE 20
uint8_t menuThemeHue = DEFAULT_MENU_THEME_HUE;
uint16_t menuThemeColor = DEFAULT_MENU_THEME_COLOR;

static void applyTftUiPalette() {
  tftUiPalette.accent = menuThemeColor;
  if (isTftStyleLight()) {
    tftUiPalette.bg = TFT_WHITE;
    tftUiPalette.fg = TFT_BLACK;
    tftUiPalette.muted = TFT_DARKGREY;
    tftUiPalette.rowAlt = 0xDEFB;  // Jasnoszary dla parzystych wierszy tabel.
  } else {
    tftUiPalette.bg = TFT_BLACK;
    tftUiPalette.fg = TFT_WHITE;
    tftUiPalette.muted = TFT_LIGHTGREY;
    tftUiPalette.rowAlt = TFT_TABLE_ALT_ROW_COLOR;
  }
}

// Filtry ekranu 2 (TFT)
enum Screen2FilterMode {
  FILTER_MODE_ALL = 0,
  FILTER_MODE_CW = 1,
  FILTER_MODE_SSB = 2,
  FILTER_MODE_DIGI = 3
};
const uint8_t FILTER_MODE_BIT_CW = 1 << 0;
const uint8_t FILTER_MODE_BIT_SSB = 1 << 1;
const uint8_t FILTER_MODE_BIT_DIGI = 1 << 2;
uint8_t screen2FilterModeMask = 0;
uint16_t screen2FilterBandMask = 0; // 0 = ALL
const char *SCREEN2_FILTER_BANDS[] = {"ALL", "160m", "80m", "40m", "20m", "17m", "15m", "12m", "10m"};
const int SCREEN2_FILTER_BANDS_COUNT = sizeof(SCREEN2_FILTER_BANDS) / sizeof(SCREEN2_FILTER_BANDS[0]);
const size_t COUNTRY_COL_MAX_LEN = 19;

// Filtry ekranu 7 (POTA)
uint8_t screen7FilterModeMask = 0;
uint16_t screen7FilterBandMask = 0; // 0 = ALL

// Filtry ekranu 8 (HAMALERT)
uint8_t screen8FilterModeMask = 0;
uint16_t screen8FilterBandMask = 0; // 0 = ALL
const char *SCREEN8_FILTER_BANDS[] = {"ALL", "160m", "80m", "40m", "20m", "17m", "15m", "12m", "10m", "VHF", "UHF", "SHF"};
const int SCREEN8_FILTER_BANDS_COUNT = sizeof(SCREEN8_FILTER_BANDS) / sizeof(SCREEN8_FILTER_BANDS[0]);

