tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
// Sortowanie ekranu 6 (APRS)
enum Screen6SortMode {
  APRS_SORT_TIME = 0,
  APRS_SORT_CALLSIGN = 1,
  APRS_SORT_DISTANCE = 2
};

enum Screen6ViewMode : uint8_t {
  APRS_VIEW_LIST = 0,
  APRS_VIEW_RADAR = 1
};

Screen6SortMode screen6SortMode = APRS_SORT_TIME;
Screen6ViewMode screen6ViewMode = APRS_VIEW_LIST;
bool screen6MenuBeaconingTemp = true;
bool screen6MenuAprsAlertTemp = true;
bool screen6MenuRangeAlertTemp = true;
bool screen6MenuLedAlertTemp = true;

const int SCREEN6_VIEW_BTN_ICON_X = 294;
const int SCREEN6_VIEW_BTN_ICON_Y = 7;
const int SCREEN6_VIEW_BTN_HIT_X = 276;
const int SCREEN6_VIEW_BTN_HIT_Y = 0;
const int SCREEN6_VIEW_BTN_HIT_W = 44;
const int SCREEN6_VIEW_BTN_HIT_H = 50;
const float SCREEN6_RADAR_ZOOM_MIN = 1.00f;
const float SCREEN6_RADAR_ZOOM_MAX = 3.00f;
const float SCREEN6_RADAR_ZOOM_STEP = 0.25f;
const unsigned long SCREEN6_RADAR_ZOOM_TAP_COOLDOWN_MS = 220UL;
float screen6RadarZoom = 1.00f;
unsigned long screen6RadarLastZoomTapMs = 0;
const unsigned long SCREEN6_RADAR_HINT_DURATION_MS = 3000UL;
unsigned long screen6RadarHintUntilMs = 0;

// Menu jasnosci (wywolywane dlugim przytrzymaniem)
bool brightnessMenuActive = false;
int brightnessMenuValue = 100;
ScreenType brightnessMenuPrevScreen = SCREEN_HAM_CLOCK;
bool brightnessMenuPrevInMenu = false;
uint8_t brightnessMenuPrevThemeHue = DEFAULT_MENU_THEME_HUE;
uint8_t brightnessMenuPrevStyleMode = TFT_STYLE_DARK;
int brightnessMenuPrevBacklight = TFT_BACKLIGHT;
unsigned long brightnessMenuOpenedMs = 0;
unsigned long brightnessMenuTouchStartMs = 0;
bool brightnessMenuLongPressHandled = false;

bool touchCalActive = false;
uint8_t touchCalStep = 0;
int16_t touchCalRawX1 = 0;
int16_t touchCalRawY1 = 0;
int16_t touchCalRawX2 = 0;
int16_t touchCalRawY2 = 0;
int16_t touchCalRawX3 = 0;
int16_t touchCalRawY3 = 0;
int16_t touchCalRawX4 = 0;
int16_t touchCalRawY4 = 0;
int touchCalNewXMin = TOUCH_X_MIN;
int touchCalNewXMax = TOUCH_X_MAX;
int touchCalNewYMin = TOUCH_Y_MIN;
int touchCalNewYMax = TOUCH_Y_MAX;

// ========== KONFIGURACJA ==========
#define AP_SSID "ESP32-HAM-CLOCK"
#define AP_PASSWORD "1234567890"
#define DEFAULT_CLUSTER_HOST "dxspots.com"
#define DEFAULT_CLUSTER_PORT 7300
#define DEFAULT_POTA_CLUSTER_HOST ""
#define DEFAULT_POTA_CLUSTER_PORT 7300
#define DEFAULT_POTA_FILTER_COMMAND "accept/spot comment POTA"
#define DEFAULT_POTA_API_URL "https://api.pota.app/v1/spots"
#define DEFAULT_HAMALERT_HOST "hamalert.org"
#define DEFAULT_HAMALERT_PORT 7300
#define NTP_SERVER "pool.ntp.org"
#define MAX_SPOTS 50  // Bufor 50 ostatnich spotów
#define MAX_POTA_SPOTS 30  // Bufor 30 ostatnich spotów (TFT pokaże max 10)
#define GMT_OFFSET_SEC 0  // UTC
#define DEFAULT_TIMEZONE_HOURS 0.0f
#define DEFAULT_CALLSIGN "SWL"
#define DEFAULT_OPENWEBRX_URL "http://okno.ddns.net:8078"
#define PROPAGATION_URL "https://www.hamqsl.com/solarxml.php"
const unsigned long PROPAGATION_FETCH_INTERVAL_MS = 60UL * 60UL * 1000UL; // 60 min
const unsigned long PROPAGATION_FETCH_RETRY_MS = 5UL * 60UL * 1000UL;      // 5 min retry on error
const unsigned long WEATHER_FETCH_INTERVAL_MS = 10UL * 60UL * 1000UL;      // 10 min
const unsigned long WEATHER_FETCH_RETRY_MS = 2UL * 60UL * 1000UL;          // 2 min retry on error
const unsigned long NETWORK_SERVICES_START_DELAY_MS = 5000UL;               // 5s opóźnienia po WiFi dla stabilizacji LWIP
const unsigned long QRZ_LOOKUP_INTERVAL_DEFAULT_MS = 3000;                 // 3s bazowy interwał lookupów
const unsigned long QRZ_LOOKUP_INTERVAL_DX_MS = 2000;                      // 2s na ekranie DX (tak samo jak POTA)
const unsigned long QRZ_LOOKUP_INTERVAL_POTA_MS = 2000;                    // 2s na ekranie POTA
const unsigned long QRZ_RETRY_DELAY_MS = 5000;                             // 5s retry
const unsigned long QRZ_CACHE_TTL_MS = 15UL * 60UL * 1000UL;               // 15 min cache wpisu
const uint8_t QRZ_RETRY_LIMIT = 2;
const int QRZ_QUEUE_SIZE = 20;

// ========== STRUKTURA DANYCH ==========
struct DXSpot {
  String time;        // Czas UTC
  String spotter;     // Stacja zgłaszająca
  String callsign;    // Znak wywoławczy
  float frequency;    // Częstotliwość (kHz - jak w DX Cluster)
  String comment;     // Komentarz
  float distance;     // Odległość (km)
  String country;     // Kraj (z QRZ, jeśli dostępny)
  String locator;     // Maidenhead Locator (jeśli dostępny)
  float lat;          // Szerokosc geo (jesli znana)
  float lon;          // Dlugosc geo (jesli znana)
  bool hasLatLon;     // Czy lat/lon jest znane
  String band;        // Pasmo (160m, 80m, 40m, etc.)
  String mode;        // Modulacja (CW, SSB, FT8/FT4)
};

// Struktura dla stacji APRS
struct APRSStation {
  String time;        // Czas UTC (timestamp)
  String callsign;    // Znak wywoławczy nadawcy
  String symbol;      // Symbol APRS (raw)
  String symbolTable; // Table symbol (znak przed /)
  float lat;          // Szerokość geograficzna
  float lon;          // Długość geograficzna
  String comment;     // Komentarz
  float freqMHz;      // Częstotliwość z komentarza (MHz)
  float distance;     // Odległość w km (Haversine)
  bool hasLatLon;     // Czy pozycja jest znana
};

// ========== ZMIENNE GLOBALNE ==========
WebServer* server = nullptr;
Preferences* preferences = nullptr;
WiFiClient telnetClient;
WiFiClient potaTelnetClient;
WiFiClient aprsClient;  // Klient dla APRS-IS

struct PropagationData {
  String sfi;
  String kindex;
  String aindex;
  String muf;
  String updated;
  String hfBandLabel[4];
  String hfBandFreq[4];
  String hfBandDay[4];
  String hfBandNight[4];
  bool valid = false;
  String lastError = "";
  unsigned long fetchedAtMs = 0;
};

PropagationData propagationData;
unsigned long lastPropagationFetchMs = 0;
bool lastPropagationFetchOk = true;

struct WeatherData {
  static const uint8_t DETAIL_COLS = 5;
  String cityName;
  String description;
  String iconCode;  // OWM icon code (e.g., 01d/01n) to detect day/night
  int weatherId = 800; // OpenWeatherMap condition ID (default clear sky)
  float tempC = 0.0f;
  int humidity = 0;
  int pressure = 0;
  float windMs = 0.0f;
  float pm25 = 0.0f;  // PM2.5 w µg/m³
  float pm10 = 0.0f;  // PM10 w µg/m³
  // Prognozy
  float forecast3hTempC = 0.0f;
  float forecast3hWindMs = 0.0f;
  String forecast3hDesc;
  bool forecast3hValid = false;
  float forecastNextDayTempC = 0.0f;
  float forecastNextDayWindMs = 0.0f;
  String forecastNextDayDesc;
  bool forecastNextDayValid = false;
  float detailTempC[DETAIL_COLS] = {0, 0, 0, 0, 0};
  int detailHumidity[DETAIL_COLS] = {0, 0, 0, 0, 0};
  float detailWindMs[DETAIL_COLS] = {0, 0, 0, 0, 0};
  int detailWeatherId[DETAIL_COLS] = {800, 800, 800, 800, 800};
  String detailIconCode[DETAIL_COLS];
  bool detailValid[DETAIL_COLS] = {false, false, false, false, false};
  float nightTempC[2] = {0.0f, 0.0f};
  bool nightTempValid[2] = {false, false};
  String forecastError;
  String updated;
  bool valid = false;
  String lastError = "";
  unsigned long fetchedAtMs = 0;
};

WeatherData weatherData;
unsigned long lastWeatherFetchMs = 0;
bool lastWeatherFetchOk = true;

