tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
struct PendingQrzLookup {
  String callsign;
  unsigned long nextTryMs = 0;
  uint8_t attempts = 0;
};

PendingQrzLookup qrzQueue[QRZ_QUEUE_SIZE];
int qrzQueueLen = 0;
unsigned long lastQrzLookupMs = 0;

// Zwraca interwał dla kolejki QRZ zależnie od aktywnego ekranu
unsigned long getQrzLookupIntervalMs() {
#ifdef ENABLE_TFT_DISPLAY
  if (tftInitialized && !inMenu) {
    if (currentScreen == SCREEN_DX_CLUSTER) {
      return QRZ_LOOKUP_INTERVAL_DX_MS;
    }
    if (currentScreen == SCREEN_POTA_CLUSTER) {
      return QRZ_LOOKUP_INTERVAL_POTA_MS;
    }
  }
#endif
  return QRZ_LOOKUP_INTERVAL_DEFAULT_MS;
}

DXSpot spots[MAX_SPOTS];
int spotCount = 0;
DXSpot potaSpots[MAX_POTA_SPOTS];
int potaSpotCount = 0;
DXSpot hamalertSpots[MAX_POTA_SPOTS];
int hamalertSpotCount = 0;
SemaphoreHandle_t dxSpotsMutex = nullptr;
SemaphoreHandle_t potaSpotsMutex = nullptr;
SemaphoreHandle_t hamalertSpotsMutex = nullptr;
SemaphoreHandle_t weatherDataMutex = nullptr;

const size_t DX_TIME_MAX_LEN = 24;
const size_t DX_CALLSIGN_MAX_LEN = 16;
const size_t DX_SPOTTER_MAX_LEN = 16;
const size_t DX_COMMENT_MAX_LEN = 96;
const size_t DX_COUNTRY_MAX_LEN = 28;
const size_t DX_LOCATOR_MAX_LEN = 8;
const size_t DX_BAND_MAX_LEN = 12;
const size_t DX_MODE_MAX_LEN = 8;

const size_t APRS_TIME_MAX_LEN = 24;
const size_t APRS_CALLSIGN_MAX_LEN = 16;
const size_t APRS_SYMBOL_MAX_LEN = 12;
const size_t APRS_COMMENT_MAX_LEN = 96;

static inline void clampStringLength(String &value, size_t maxLen) {
  if (value.length() > maxLen) {
    value.remove(maxLen);
  }
}

static void compactDxSpotStrings(DXSpot &spot) {
  clampStringLength(spot.time, DX_TIME_MAX_LEN);
  clampStringLength(spot.callsign, DX_CALLSIGN_MAX_LEN);
  clampStringLength(spot.spotter, DX_SPOTTER_MAX_LEN);
  clampStringLength(spot.comment, DX_COMMENT_MAX_LEN);
  clampStringLength(spot.country, DX_COUNTRY_MAX_LEN);
  clampStringLength(spot.locator, DX_LOCATOR_MAX_LEN);
  clampStringLength(spot.band, DX_BAND_MAX_LEN);
  clampStringLength(spot.mode, DX_MODE_MAX_LEN);
}

static void compactAprsStationStrings(APRSStation &station) {
  clampStringLength(station.time, APRS_TIME_MAX_LEN);
  clampStringLength(station.callsign, APRS_CALLSIGN_MAX_LEN);
  clampStringLength(station.symbol, APRS_SYMBOL_MAX_LEN);
  clampStringLength(station.symbolTable, APRS_SYMBOL_MAX_LEN);
  clampStringLength(station.comment, APRS_COMMENT_MAX_LEN);
}

static inline void lockDxSpots() {
  if (dxSpotsMutex != nullptr) {
    xSemaphoreTake(dxSpotsMutex, portMAX_DELAY);
  }
}

static inline void unlockDxSpots() {
  if (dxSpotsMutex != nullptr) {
    xSemaphoreGive(dxSpotsMutex);
  }
}

static inline void lockPotaSpots() {
  if (potaSpotsMutex != nullptr) {
    xSemaphoreTake(potaSpotsMutex, portMAX_DELAY);
  }
}

static inline void unlockPotaSpots() {
  if (potaSpotsMutex != nullptr) {
    xSemaphoreGive(potaSpotsMutex);
  }
}

static inline void lockHamalertSpots() {
  if (hamalertSpotsMutex != nullptr) {
    xSemaphoreTake(hamalertSpotsMutex, portMAX_DELAY);
  }
}

static inline void unlockHamalertSpots() {
  if (hamalertSpotsMutex != nullptr) {
    xSemaphoreGive(hamalertSpotsMutex);
  }
}

static inline void lockWeatherData() {
  if (weatherDataMutex != nullptr) {
    xSemaphoreTake(weatherDataMutex, portMAX_DELAY);
  }
}

static inline void unlockWeatherData() {
  if (weatherDataMutex != nullptr) {
    xSemaphoreGive(weatherDataMutex);
  }
}

// Formatuje czas spotu do postaci "HH:MM" niezależnie od wejściowego formatu
String formatSpotUtc(String raw) {
  raw.trim();

  // Obsługa ISO 8601 (np. 2024-12-12T12:34Z)
  int tPos = raw.indexOf('T');
  if (tPos >= 0 && (tPos + 5) <= (int)raw.length()) {
    raw = raw.substring(tPos + 1);
  }

  // Usuń ewentualne końcowe "Z"
  if (raw.endsWith("Z") || raw.endsWith("z")) {
    raw.remove(raw.length() - 1);
  }

  // Jeżeli już jest dwukropek, przytnij do HH:MM
  if (raw.length() >= 5 && raw.charAt(2) == ':') {
    return raw.substring(0, 5);
  }

  // Brak dwukropka: próbuj wstawić między HH a MM (np. "1234" -> "12:34")
  if (raw.length() >= 4) {
    return raw.substring(0, 2) + ":" + raw.substring(2, 4);
  }

  // Awaryjnie: tylko godzina -> dodaj ":00"
  if (raw.length() >= 2) {
    return raw.substring(0, 2) + ":00";
  }

  return raw;
}

// POTA API (HTTP)
const unsigned long POTA_API_FETCH_INTERVAL_MS = 180UL * 1000UL; // 180s
unsigned long lastPotaApiFetchMs = 0;

// HAMALERT Telnet
const unsigned long HAMALERT_FETCH_INTERVAL_MS = 60UL * 1000UL; // 60s
unsigned long lastHamalertFetchMs = 0;

// APRS-IS konfiguracja (domyślne wartości)
#define DEFAULT_APRS_IS_HOST "rotate.aprs2.net"
#define DEFAULT_APRS_IS_PORT 14580
#define DEFAULT_APRS_CALLSIGN "nocall"
#define DEFAULT_APRS_PASSCODE 00000
#define DEFAULT_APRS_SSID 0
#define DEFAULT_APRS_FILTER_RADIUS 50  // Promień w km (domyślnie 50, zakres 1-50)
#define MAX_APRS_STATIONS 30  // Maksymalna liczba stacji do wyświetlenia (bufor dla WWW)
#define MAX_APRS_DISPLAY_LCD 11  // Maksymalna liczba stacji na ekranie LCD

// Zmienne konfiguracyjne APRS-IS
String aprsIsHost = DEFAULT_APRS_IS_HOST;
int aprsIsPort = DEFAULT_APRS_IS_PORT;
String aprsCallsign = DEFAULT_APRS_CALLSIGN;
int aprsPasscode = DEFAULT_APRS_PASSCODE;
int aprsSsid = DEFAULT_APRS_SSID;
int aprsFilterRadius = DEFAULT_APRS_FILTER_RADIUS;  // PromieĹ„ w km (0-30)
// Uwaga: APRS uĹĽywa wspĂłĹ‚rzÄ™dnych z sekcji "Moja Stacja" (userLat, userLon)

const unsigned long APRS_POSITION_FIRST_DELAY_MS = 60UL * 1000UL; // pierwszy beacon po 1 minucie
const unsigned long APRS_FILTER_REFRESH_MIN_INTERVAL_MS = 30000UL; // nie odswiezaj filtra czesciej niz co 30s
const float APRS_FILTER_REFRESH_MOVE_KM = 1.0f; // odswiez filtr po przesunieciu pozycji o >= 1 km
const int DEFAULT_APRS_INTERVAL_MIN = 29; // kolejne co 29 minut (domyślnie)
const char *NVS_KEY_APRS_INTERVAL_MIN = "aprs_int_min";
const int DEFAULT_APRS_ALERT_MIN_SEC = 300;
const char *NVS_KEY_APRS_ALERT_MIN_SEC = "aprs_alrt_sec";
const int DEFAULT_APRS_ALERT_SCREEN_SEC = 5;
const char *NVS_KEY_APRS_ALERT_SCREEN_SEC = "alrt_scr_s";
const float DEFAULT_APRS_ALERT_DISTANCE_KM = 1.0f;
const char *NVS_KEY_APRS_ALERT_DISTANCE_KM = "alrt_dst_km";
const char *NVS_KEY_APRS_ALERT_WX_ENABLED = "alrt_wx_en";
const char *NVS_KEY_WEATHER_ALERT_STORM_ENABLED = "wx_al_st";
const char *NVS_KEY_WEATHER_ALERT_WIND_ENABLED = "wx_al_wi";
const char *NVS_KEY_WEATHER_ALERT_WIND_THRESHOLD_MS = "wx_w_thr";
const char *NVS_KEY_TFT_NIGHT_DIMMING = "tft_ndim";
const char *NVS_KEY_USE_GPS_IF_ACTIVE = "gps_auto_pos";
const bool DEFAULT_WEATHER_ALERT_STORM_ENABLED = false;
const bool DEFAULT_WEATHER_ALERT_WIND_ENABLED = false;
const float DEFAULT_WEATHER_ALERT_WIND_THRESHOLD_MS = 12.0f;
const float WEATHER_ALERT_WIND_THRESHOLD_MIN_MS = 1.0f;
const float WEATHER_ALERT_WIND_THRESHOLD_MAX_MS = 60.0f;
const unsigned long WEATHER_ALERT_WIND_REPEAT_MS = 1UL * 60UL * 1000UL;
const unsigned long WEATHER_ALERT_CURRENT_DATA_MAX_AGE_MS = 30UL * 60UL * 1000UL;
const bool WEATHER_ALERT_STORM_TEST_MODE = false; // TEMP: wymusza alert burzy co 1 minute
const bool WEATHER_ALERT_WIND_FORCE_ENABLED = false; // TEMP: wymusza wlaczenie alertu o silnym wietrze
const bool DEFAULT_ENABLE_LED_ALERT = true;
const int DEFAULT_LED_ALERT_DURATION_MS = 5000;
const int DEFAULT_LED_ALERT_BLINK_MS = 500;
const char *NVS_KEY_ENABLE_LED_ALERT = "led_al_en";
const char *NVS_KEY_LED_ALERT_DURATION_MS = "led_al_dur";
const char *NVS_KEY_LED_ALERT_BLINK_MS = "led_al_blk";
unsigned long aprsPositionIntervalMs = (unsigned long)DEFAULT_APRS_INTERVAL_MIN * 60UL * 1000UL;
unsigned long lastAPRSPositionTxMs = 0;
unsigned long nextAPRSPositionDueMs = 0;
unsigned long aprsFilterLastSentMs = 0;
double aprsFilterLastLat = 0.0;
double aprsFilterLastLon = 0.0;
bool aprsFilterLastValid = false;
bool aprsFilterLastGpsBased = false;
int aprsIntervalMinutes = DEFAULT_APRS_INTERVAL_MIN;
const char DEFAULT_APRS_SYMBOL_TABLE = '/';
const char DEFAULT_APRS_SYMBOL_CODE = 'V';
String aprsSymbolTwoChar = "/V";
char aprsSymbolTable = DEFAULT_APRS_SYMBOL_TABLE;
char aprsSymbolCode = DEFAULT_APRS_SYMBOL_CODE;
String aprsUserComment = "";
String aprsAlertCsv = "";
bool aprsAlertEnabled = true;
int aprsAlertMinSeconds = DEFAULT_APRS_ALERT_MIN_SEC;
int aprsAlertScreenSeconds = DEFAULT_APRS_ALERT_SCREEN_SEC;
bool aprsAlertNearbyEnabled = true;
bool aprsAlertWxEnabled = false;
float aprsAlertDistanceKm = DEFAULT_APRS_ALERT_DISTANCE_KM;
bool weatherAlertStormEnabled = DEFAULT_WEATHER_ALERT_STORM_ENABLED;
bool weatherAlertWindEnabled = DEFAULT_WEATHER_ALERT_WIND_ENABLED;
float weatherAlertWindThresholdMs = DEFAULT_WEATHER_ALERT_WIND_THRESHOLD_MS;
bool enableLedAlert = DEFAULT_ENABLE_LED_ALERT;
int ledAlertDurationMs = DEFAULT_LED_ALERT_DURATION_MS;
int ledAlertBlinkMs = DEFAULT_LED_ALERT_BLINK_MS;
int aprsBeaconTxCount = 0;
const char *APRS_POSITION_COMMENT = "https://github.com/SP3KON/ESP32-HAM-CLOCK";
const char *APRS_KISS_RF_PATH1 = "WIDE1-1";
const char *APRS_KISS_RF_PATH2 = "WIDE2-1";
bool aprsBeaconEnabled = true;
const unsigned long APRS_ALERT_FRAME_PULSE_MS = 500UL;
const unsigned long APRS_BEACONING_SCREEN_MS = 2000UL;
const int APRS_ALERT_CLOSE_BTN_X = 286;
const int APRS_ALERT_CLOSE_BTN_Y = 7;
const int APRS_ALERT_CLOSE_BTN_W = 26;
const int APRS_ALERT_CLOSE_BTN_H = 26;
const int APRS_ALERT_CLOSE_HIT_W = 50;
const int APRS_ALERT_CLOSE_HIT_H = 50;

