tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
static void applyWeatherAlertWindThresholdMs(float thresholdMs) {
  float t = thresholdMs;
  if (t < WEATHER_ALERT_WIND_THRESHOLD_MIN_MS) t = WEATHER_ALERT_WIND_THRESHOLD_MIN_MS;
  if (t > WEATHER_ALERT_WIND_THRESHOLD_MAX_MS) t = WEATHER_ALERT_WIND_THRESHOLD_MAX_MS;
  weatherAlertWindThresholdMs = t;
}

static float weatherAlertWindGustThresholdMs() {
  return weatherAlertWindThresholdMs + 5.0f;
}

enum AlertScreenKind {
  ALERT_SCREEN_NONE = 0,
  ALERT_SCREEN_APRS = 1,
  ALERT_SCREEN_WEATHER = 2,
  ALERT_SCREEN_BEACONING = 3
};

struct WeatherAlertInfo {
  bool stormPossible = false;
  bool stormNow = false;
  bool windPossible = false;
  uint8_t stormEtaHours = 0;
  float maxWindMs = 0.0f;
  float maxWindGustMs = 0.0f;
};

bool aprsAlertScreenActive = false;
unsigned long aprsAlertScreenUntilMs = 0;
unsigned long aprsAlertFrameLastToggleMs = 0;
bool aprsAlertFramePulseOn = true;
AlertScreenKind activeAlertScreenKind = ALERT_SCREEN_NONE;
APRSStation aprsAlertScreenStation;
volatile bool aprsAlertDrawPending = false;
APRSStation aprsAlertPendingStation;
portMUX_TYPE aprsAlertPendingMux = portMUX_INITIALIZER_UNLOCKED;
volatile bool weatherAlertDrawPending = false;
WeatherAlertInfo weatherAlertPendingInfo;
portMUX_TYPE weatherAlertPendingMux = portMUX_INITIALIZER_UNLOCKED;
WeatherAlertInfo weatherAlertScreenInfo;
bool weatherStormForecastActive = false;
bool weatherWindForecastActive = false;
int weatherStormEtaMinutes = 0;
unsigned long weatherAlertForecastUpdatedMs = 0;
float weatherWindForecastMaxMs = 0.0f;
float weatherWindForecastGustMs = 0.0f;
unsigned long nextWeatherStormAlertMs = 0;
unsigned long nextWeatherWindAlertMs = 0;

struct AprsAlertCooldownEntry {
  String callsign;
  unsigned long lastAlertMs = 0;
};

AprsAlertCooldownEntry aprsAlertCooldown[MAX_APRS_STATIONS];
int aprsAlertCooldownReplaceIdx = 0;

APRSStation aprsStations[MAX_APRS_STATIONS];
int aprsStationCount = 0;
bool aprsConnected = false;
bool aprsLoginSent = false;
unsigned long lastAPRSAttempt = 0;
unsigned long lastAPRSRxMs = 0;
String aprsBuffer = "";
const unsigned long APRS_INACTIVITY_RECONNECT_MS = 5UL * 60UL * 1000UL; // 5 minut

// Konfiguracja WiFi i Cluster
String wifiSSID = "";
String wifiPassword = "";
String wifiSSID2 = "";
String wifiPassword2 = "";
String clusterHost = DEFAULT_CLUSTER_HOST;
int clusterPort = DEFAULT_CLUSTER_PORT;
String potaClusterHost = DEFAULT_POTA_CLUSTER_HOST;
int potaClusterPort = DEFAULT_POTA_CLUSTER_PORT;
String potaFilterCommand = DEFAULT_POTA_FILTER_COMMAND;
String potaApiUrl = DEFAULT_POTA_API_URL;
String hamalertHost = DEFAULT_HAMALERT_HOST;
int hamalertPort = DEFAULT_HAMALERT_PORT;
String hamalertLogin = "";
String hamalertPassword = "";
String userCallsign = "";
String userLocator = "";
double userLat = 0.0;
double userLon = 0.0;
bool userLatLonValid = false;
bool useGpsIfActive = false;

// GPS ATGM336H (UART)
const int GPS_UART_TX_PIN = 22;   // IO22 -> TX ESP32 -> RX GPS
const int GPS_UART_RX_PIN = 27;   // IO27 -> RX ESP32 <- TX GPS
const uint32_t GPS_UART_BAUD = 9600;
const char *GPS_UART_ACTIVATE_COMMAND = "GPS ON";
const char *UART2_APRS_TNC_KISS_ON_COMMAND = "KISS ON";
const char *UART2_APRS_TNC_RESTART_COMMAND = "RESTART";
const char *UART2_BRIDGE_BTSPP_ON_COMMAND = "BTSPP_ON";
const char *UART2_BRIDGE_BTSPP_OFF_COMMAND = "BTSPP_OFF";
const char *UART2_BRIDGE_BT_SCAN_COMMAND = "BT SCAN";
const char *NVS_KEY_UART2_MODE = "uart2_mode";
const char *NVS_KEY_UART2_CONNECTED_MODULE = "uart2_cmod";
const char *NVS_KEY_UART2_BAUD = "uart2_baud";
const char *NVS_KEY_UART2_DATABITS = "uart2_dbits";
const char *NVS_KEY_UART2_PARITY = "uart2_par";
const char *NVS_KEY_UART2_STOP_BITS = "uart2_stop";
const char *NVS_KEY_BRIDGE_PAIR_ADDR = "br_pair_addr";
const char *NVS_KEY_BRIDGE_PAIR_NAME = "br_pair_name";
const uint32_t UART2_BAUD_MIN = 300;
const uint32_t UART2_BAUD_MAX = 2000000;
const uint8_t DEFAULT_UART2_MODE = 0;      // 0=gps, 1=bt, 2=off
const uint32_t DEFAULT_UART2_BAUD = GPS_UART_BAUD;
const uint8_t DEFAULT_UART2_DATA_BITS = 8;
const uint8_t DEFAULT_UART2_PARITY = 0;    // 0=none, 1=even, 2=odd
const uint8_t DEFAULT_UART2_STOP_BITS = 1;
const uint8_t UART2_MODE_GPS = 0;
const uint8_t UART2_MODE_BT = 1;
const uint8_t UART2_MODE_OFF = 2;
const uint8_t UART2_PARITY_NONE = 0;
const uint8_t UART2_PARITY_EVEN = 1;
const uint8_t UART2_PARITY_ODD = 2;
uint8_t uart2Mode = DEFAULT_UART2_MODE;
String uart2ConnectedModule = "none"; // none, gps, aprs_tnc, aprs_tnc_kiss, esp32_bridge
uint32_t uart2BaudRate = DEFAULT_UART2_BAUD;
uint8_t uart2DataBits = DEFAULT_UART2_DATA_BITS;
uint8_t uart2Parity = DEFAULT_UART2_PARITY;
uint8_t uart2StopBits = DEFAULT_UART2_STOP_BITS;
const unsigned long GPS_STATUS_LOG_INTERVAL_MS = 60000UL;
const unsigned long GPS_FIX_FRESHNESS_MS = 15000UL;
const unsigned long GPS_UART_ACTIVE_TIMEOUT_MS = 3000UL;
const unsigned long GPS_RAW_BRIDGE_WINDOW_MS = 60000UL;
const unsigned long GPS_RAW_STATS_INTERVAL_MS = 5000UL;
const unsigned long GPS_GSV_SOURCE_FRESHNESS_MS = 10000UL;

static void processAprsFrameFromLine(const String &line, const char *sourceTag);
bool parseAPRSFrame(String line, APRSStation &station);
void addAPRSStation(APRSStation station);
static bool shouldTriggerAprsAlert(const APRSStation &station);
static bool isLikelyAprsTnc2Frame(const String &line);

const int MAX_BRIDGE_BT_DEVICES = 24;
const unsigned long BRIDGE_UART_COMMAND_COOLDOWN_MS = 250UL;
const unsigned long BRIDGE_BTSPP_ON_RETRY_INTERVAL_MS = 2000UL;
const uint8_t BRIDGE_BTSPP_ON_MAX_TRIES = 3;
const unsigned long BRIDGE_FORCE_GPS_ON_AFTER_BOOT_MS = 60000UL;
const unsigned long BRIDGE_FORCE_BTSPP_ON_DELAY_AFTER_GPS_ON_MS = 10000UL;
const unsigned long APRS_TNC_RESTART_AFTER_BOOT_MS = 30000UL;
const unsigned long APRS_TNC_KISS_RESTART_DELAY_AFTER_KISS_ON_MS = 1000UL;

struct BridgeBtDevice {
  String name;
  String addressNoColon;
};

HardwareSerial gpsSerial(2);
String gpsNmeaLine = "";
double gpsLatitude = 0.0;
double gpsLongitude = 0.0;
bool gpsLocationValid = false;
bool gpsRmcFix = false;
bool gpsGgaFix = false;
int gpsSatellitesUsed = -1;
int gpsSatellitesInView = -1;
int gpsSatellitesInViewGN = -1;
int gpsSatellitesInViewGP = -1;
int gpsSatellitesInViewGL = -1;
int gpsSatellitesInViewGA = -1;
int gpsSatellitesInViewGB = -1;
int gpsSatellitesInViewBD = -1;
int gpsSatellitesInViewGQ = -1;
unsigned long gpsSatellitesInViewLastGNMs = 0;
unsigned long gpsSatellitesInViewLastGPMS = 0;
unsigned long gpsSatellitesInViewLastGLMs = 0;
unsigned long gpsSatellitesInViewLastGAMs = 0;
unsigned long gpsSatellitesInViewLastGBMs = 0;
unsigned long gpsSatellitesInViewLastBDMs = 0;
unsigned long gpsSatellitesInViewLastGQMs = 0;
float gpsSpeedKmh = -1.0f;
unsigned long gpsLastRmcMs = 0;
unsigned long gpsLastGgaMs = 0;
unsigned long gpsLastStatusLogMs = 0;
unsigned long gpsLastRxMs = 0;
unsigned long gpsRawBridgeStartMs = 0;
bool gpsRawBridgeEndLogged = false;
unsigned long gpsRawLastStatsMs = 0;
uint32_t gpsRawBytesTotal = 0;
uint32_t gpsRawBytesSinceStats = 0;
String gpsUtcTime = "";
String gpsUtcDate = "";
String uart2AprsLine = "";
String uart2YaesuUiAprsPrefix = "";
bool uart2KissInFrame = false;
bool uart2KissEscape = false;
uint8_t uart2KissFrame[600];
size_t uart2KissFrameLen = 0;
BridgeBtDevice bridgeBtDevices[MAX_BRIDGE_BT_DEVICES];
int bridgeBtDeviceCount = 0;
bool bridgeBtListCollecting = false;
int bridgeBtListExpected = -1;
bool bridgeBtScanInProgress = false;
bool bridgeBtScanRequested = false;
bool bridgeAwaitBtsppOffAckForScan = false;
String bridgeBtLastError = "";
String bridgeBtLastDiscStatus = "";
String bridgeBtLastAck = "";
unsigned long bridgeBtLastScanMs = 0;
unsigned long bridgeBtLastCommandTxMs = 0;
String bridgeBtPairedAddress = "";
String bridgeBtPairedName = "";
bool bridgeBtAutoConnectPending = false;
bool bridgeBtPairPending = false;
String bridgeBtPairPendingAddress = "";
String bridgeBtPairPendingName = "";
int bridgeBtPairLastResult = 0; // 0=brak, 1=OK, -1=ERR
unsigned long bridgeBtPairLastResultMs = 0;
bool bridgeBtsppOnAwaitAck = false;
uint8_t bridgeBtsppOnRetryCount = 0;
unsigned long bridgeBtsppOnNextRetryMs = 0;
bool bridgeBootForceGpsOnSent = false;
unsigned long bridgeBootForceGpsOnMs = 0;
bool bridgeBootForceBtsppOnSent = false;
bool aprsTncBootRestartSent = false;
bool aprsTncBootKissOnSent = false;
unsigned long aprsTncBootKissOnSentMs = 0;

static String uart2ModeToCode(uint8_t mode) {
  if (mode == UART2_MODE_BT) {
    return "bt";
  }
  if (mode == UART2_MODE_OFF) {
    return "off";
  }
  return "gps";
}

static String sanitizeUart2ConnectedModule(String moduleCode) {
  moduleCode.trim();
  moduleCode.toLowerCase();

