tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  if (moduleCode == "gps") {
    return "gps";
  }
  if (moduleCode == "aprs tnc" || moduleCode == "aprs tnc2 (rx only)" || moduleCode == "aprs_tnc" || moduleCode == "tnc") {
    return "aprs_tnc";
  }
  if (moduleCode == "aprs tnc kiss" || moduleCode == "aprs-tnc-kiss" || moduleCode == "aprs_tnc-kiss" ||
      moduleCode == "aprs_tnc_kiss" || moduleCode == "kiss") {
    return "aprs_tnc_kiss";
  }
  if (moduleCode == "esp32-bridge" || moduleCode == "esp32_bridge" || moduleCode == "bridge") {
    return "esp32_bridge";
  }
  if (moduleCode == "brak" || moduleCode == "none" || moduleCode == "off") {
    return "none";
  }

  return "none";
}

static bool isUart2GpsModuleSelected() {
  return uart2ConnectedModule == "gps";
}

static bool isUart2AprsTncModuleSelected() {
  return uart2ConnectedModule == "aprs_tnc";
}

static bool isUart2AprsTncKissModuleSelected() {
  return uart2ConnectedModule == "aprs_tnc_kiss";
}

static bool isUart2BridgeModuleSelected() {
  return uart2ConnectedModule == "esp32_bridge";
}

static bool isLegacyGpsModeWithoutModule() {
  return (uart2ConnectedModule == "none") && (uart2Mode == UART2_MODE_GPS);
}

static bool isUart2GpsParsingEnabled() {
  return isUart2GpsModuleSelected() || isUart2BridgeModuleSelected() || isLegacyGpsModeWithoutModule();
}

static bool isUart2AprsUartSourceEnabled() {
  return isUart2AprsTncModuleSelected() || isUart2AprsTncKissModuleSelected() || isUart2BridgeModuleSelected();
}

static bool isUart2AprsTextParsingEnabled() {
  if (isUart2AprsTncKissModuleSelected()) {
    return false;
  }
  return isUart2AprsUartSourceEnabled();
}

static bool isUart2AprsKissParsingEnabled() {
  return isUart2AprsTncModuleSelected() || isUart2AprsTncKissModuleSelected();
}

static bool isAprsNetworkFeedEnabled() {
  return !isUart2AprsUartSourceEnabled();
}

static String normalizeBridgeBtAddress(String raw) {
  String cleaned = "";
  cleaned.reserve(12);
  for (size_t i = 0; i < raw.length(); i++) {
    char c = raw.charAt(i);
    bool isDigitChar = (c >= '0' && c <= '9');
    bool isUpperHex = (c >= 'A' && c <= 'F');
    bool isLowerHex = (c >= 'a' && c <= 'f');
    if (isDigitChar || isUpperHex || isLowerHex) {
      cleaned += (char)toupper((unsigned char)c);
      if (cleaned.length() >= 12) {
        break;
      }
    }
  }
  if (cleaned.length() != 12) {
    return "";
  }
  return cleaned;
}

static String formatBridgeBtAddressForDisplay(const String &addrNoColon) {
  String norm = normalizeBridgeBtAddress(addrNoColon);
  if (norm.length() != 12) {
    return "";
  }
  String out = "";
  out.reserve(17);
  for (int i = 0; i < 12; i += 2) {
    if (i > 0) out += ":";
    out += norm.substring(i, i + 2);
  }
  return out;
}

static String sanitizeBridgeTextField(String raw, size_t maxLen) {
  String out = "";
  out.reserve(raw.length());
  for (size_t i = 0; i < raw.length(); i++) {
    char c = raw.charAt(i);
    if (c < 32 || c > 126) continue;
    if (c == '[' || c == ']' || c == '\r' || c == '\n') continue;
    out += c;
    if (out.length() >= maxLen) break;
  }
  out.trim();
  return out;
}

static void clearBridgeBtScanList() {
  for (int i = 0; i < MAX_BRIDGE_BT_DEVICES; i++) {
    bridgeBtDevices[i].name = "";
    bridgeBtDevices[i].addressNoColon = "";
  }
  bridgeBtDeviceCount = 0;
  bridgeBtListExpected = -1;
  bridgeBtListCollecting = false;
}

static bool sendBridgeUartCommandLine(const String &command, bool bypassCooldown = false) {
  if (!isUart2BridgeModuleSelected() || command.length() == 0) {
    return false;
  }

  unsigned long nowMs = millis();
  if (!bypassCooldown && bridgeBtLastCommandTxMs != 0 && (nowMs - bridgeBtLastCommandTxMs) < BRIDGE_UART_COMMAND_COOLDOWN_MS) {
    return false;
  }

  gpsSerial.print(command);
  gpsSerial.print("\r\n");
  Serial.printf("[BRIDGE] TX: %s\\r\\n\n", command.c_str());
  bridgeBtLastCommandTxMs = nowMs;
  return true;
}

static void saveBridgeBtPairingToNvs() {
  Preferences bridgePrefs;
  bridgePrefs.begin("dxcluster", false);
  bridgePrefs.putString(NVS_KEY_BRIDGE_PAIR_ADDR, bridgeBtPairedAddress);
  bridgePrefs.putString(NVS_KEY_BRIDGE_PAIR_NAME, bridgeBtPairedName);
  bridgePrefs.end();
}

static void resetBridgeBtsppOnRetryState() {
  bridgeBtsppOnAwaitAck = false;
  bridgeBtsppOnRetryCount = 0;
  bridgeBtsppOnNextRetryMs = 0;
}

static void triggerBridgeBtsppOnRetryStart() {
  bridgeBtsppOnAwaitAck = true;
  bridgeBtsppOnRetryCount = 0;
  bridgeBtsppOnNextRetryMs = 0;
}

static void serviceBridgeBtsppOnRetry(unsigned long nowMs) {
  if (!bridgeBtsppOnAwaitAck) {
    return;
  }

  if (!isUart2BridgeModuleSelected()) {
    resetBridgeBtsppOnRetryState();
    return;
  }

  if ((long)(nowMs - bridgeBtsppOnNextRetryMs) < 0) {
    return;
  }

  if (bridgeBtsppOnRetryCount >= BRIDGE_BTSPP_ON_MAX_TRIES) {
    bridgeBtsppOnAwaitAck = false;
    bridgeBtLastError = "BTSPP_ON_NO_ACK";
    Serial.println("[BRIDGE] Brak ACK BTSPP_ON po 3 probach");
    return;
  }

  bool sent = sendBridgeUartCommandLine(UART2_BRIDGE_BTSPP_ON_COMMAND, true);
  if (sent) {
    bridgeBtsppOnRetryCount++;
    Serial.printf("[BRIDGE] BTSPP_ON proba %u/%u\n",
                  (unsigned)bridgeBtsppOnRetryCount,
                  (unsigned)BRIDGE_BTSPP_ON_MAX_TRIES);
  } else {
    Serial.println("[BRIDGE] BTSPP_ON send fail, ponowie za 2s");
  }

  bridgeBtsppOnNextRetryMs = nowMs + BRIDGE_BTSPP_ON_RETRY_INTERVAL_MS;
}

static void serviceBridgeBootForceCommands(unsigned long nowMs) {
  if (!isUart2BridgeModuleSelected()) {
    return;
  }

  // Fallback po starcie: po 60 s wymus GPS ON, niezależnie od statusu connect/autoconnect.
  if (!bridgeBootForceGpsOnSent && (long)(nowMs - BRIDGE_FORCE_GPS_ON_AFTER_BOOT_MS) >= 0) {
    if (sendBridgeUartCommandLine(GPS_UART_ACTIVATE_COMMAND, true)) {
      bridgeBootForceGpsOnSent = true;
      bridgeBootForceGpsOnMs = nowMs;
      Serial.println("[BRIDGE] Fallback boot: wysylam GPS ON po 60s");
    }
    return;
  }

  // 10 s po wymuszonym GPS ON wyslij BTSPP_ON bez czekania na odpowiedzi zwrotne.
  if (bridgeBootForceGpsOnSent && !bridgeBootForceBtsppOnSent &&
      (long)(nowMs - (bridgeBootForceGpsOnMs + BRIDGE_FORCE_BTSPP_ON_DELAY_AFTER_GPS_ON_MS)) >= 0) {
    if (sendBridgeUartCommandLine(UART2_BRIDGE_BTSPP_ON_COMMAND, true)) {
      bridgeBootForceBtsppOnSent = true;
      Serial.println("[BRIDGE] Fallback boot: wysylam BTSPP_ON po +10s od GPS ON");
    }
  }
}

static void serviceAprsTncBootRestart(unsigned long nowMs) {
  if (aprsTncBootRestartSent) {
    return;
  }

  if (isUart2AprsTncKissModuleSelected()) {
    // Po 30 s wlacz tryb KISS, a 1 s pozniej zrestartuj modem.
    if (!aprsTncBootKissOnSent) {
      if ((long)(nowMs - APRS_TNC_RESTART_AFTER_BOOT_MS) < 0) {
        return;
      }
      gpsSerial.print(UART2_APRS_TNC_KISS_ON_COMMAND);
      gpsSerial.print("\r\n");
      Serial.printf("[UART2] TX: %s\\r\\n\n", UART2_APRS_TNC_KISS_ON_COMMAND);
      aprsTncBootKissOnSent = true;
      aprsTncBootKissOnSentMs = nowMs;
      return;
    }

    if ((long)(nowMs - (aprsTncBootKissOnSentMs + APRS_TNC_KISS_RESTART_DELAY_AFTER_KISS_ON_MS)) < 0) {
      return;
    }

