tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
    gpsSerial.print(UART2_APRS_TNC_RESTART_COMMAND);
    gpsSerial.print("\r\n");
    Serial.printf("[UART2] TX: %s\\r\\n\n", UART2_APRS_TNC_RESTART_COMMAND);
    aprsTncBootRestartSent = true;
    return;
  }

  if (!isUart2AprsTncModuleSelected()) {
    return;
  }

  // Po starcie wymusz restart modemu APRS TNC, aby odswiezyc polaczenie BT.
  if ((long)(nowMs - APRS_TNC_RESTART_AFTER_BOOT_MS) < 0) {
    return;
  }

  gpsSerial.print(UART2_APRS_TNC_RESTART_COMMAND);
  gpsSerial.print("\r\n");
  Serial.printf("[UART2] TX: %s\\r\\n\n", UART2_APRS_TNC_RESTART_COMMAND);
  aprsTncBootRestartSent = true;
}

static void startBridgeScanSequence() {
  if (!isUart2BridgeModuleSelected()) {
    return;
  }

  clearBridgeBtScanList();
  bridgeBtScanInProgress = true;
  bridgeBtScanRequested = true;
  bridgeAwaitBtsppOffAckForScan = true;
  bridgeBtLastError = "";
  bridgeBtLastDiscStatus = "";
  bridgeBtLastAck = "";

  if (!sendBridgeUartCommandLine(UART2_BRIDGE_BTSPP_OFF_COMMAND, true)) {
    bridgeBtLastError = "SEND_BTSPP_OFF_FAIL";
    bridgeBtScanInProgress = false;
    bridgeBtScanRequested = false;
    bridgeAwaitBtsppOffAckForScan = false;
  }
}

static void addOrUpdateBridgeBtDevice(const String &name, const String &addressNoColon) {
  if (addressNoColon.length() != 12) {
    return;
  }

  String safeName = sanitizeBridgeTextField(name, 40);
  if (safeName.length() == 0) {
    safeName = "BT_DEVICE";
  }

  for (int i = 0; i < bridgeBtDeviceCount; i++) {
    if (bridgeBtDevices[i].addressNoColon.equalsIgnoreCase(addressNoColon)) {
      bridgeBtDevices[i].name = safeName;
      return;
    }
  }

  if (bridgeBtDeviceCount >= MAX_BRIDGE_BT_DEVICES) {
    return;
  }

  bridgeBtDevices[bridgeBtDeviceCount].name = safeName;
  bridgeBtDevices[bridgeBtDeviceCount].addressNoColon = addressNoColon;
  bridgeBtDeviceCount++;
}

static bool requestBridgePairConnect(String nameRaw, String addrRaw, String passwordRaw, bool bypassCooldown = false) {
  if (!isUart2BridgeModuleSelected()) {
    return false;
  }

  String addr = normalizeBridgeBtAddress(addrRaw);
  if (addr.length() != 12) {
    bridgeBtLastError = "PAIR_ADDR_INVALID";
    return false;
  }

  String safeName = sanitizeBridgeTextField(nameRaw, 40);
  if (safeName.length() == 0) {
    safeName = "BT_DEVICE";
  }

  String safePassword = sanitizeBridgeTextField(passwordRaw, 16);
  if (safePassword.length() > 16) {
    bridgeBtLastError = "PAIR_PASSWORD_TOO_LONG";
    return false;
  }

  // PIN/hasło jest opcjonalne: nie wymuszaj sztucznego "****", bo to powoduje BTCNT_ERR na części modułów.
  String command = "BTCNT[NAME]" + safeName + "[ADR]" + addr;
  if (safePassword.length() > 0) {
    command += "[PSWD]";
    command += safePassword;
  }
  if (!sendBridgeUartCommandLine(command, bypassCooldown)) {
    bridgeBtLastError = "PAIR_COMMAND_SEND_FAIL";
    return false;
  }

  bridgeBtPairPending = true;
  bridgeBtPairPendingAddress = addr;
  bridgeBtPairPendingName = safeName;
  bridgeBtPairLastResult = 0;
  return true;
}

static uint8_t uart2ModeFromCode(String modeCode) {
  modeCode.trim();
  modeCode.toLowerCase();
  if (modeCode == "bt" || modeCode == "bt_module" || modeCode == "bluetooth") {
    return UART2_MODE_BT;
  }
  if (modeCode == "off" || modeCode == "none" || modeCode == "disabled") {
    return UART2_MODE_OFF;
  }
  return UART2_MODE_GPS;
}

static String uart2ParityToCode(uint8_t parity) {
  if (parity == UART2_PARITY_EVEN) {
    return "even";
  }
  if (parity == UART2_PARITY_ODD) {
    return "odd";
  }
  return "none";
}

static uint8_t uart2ParityFromCode(String parityCode) {
  parityCode.trim();
  parityCode.toLowerCase();
  if (parityCode == "even" || parityCode == "e") {
    return UART2_PARITY_EVEN;
  }
  if (parityCode == "odd" || parityCode == "o") {
    return UART2_PARITY_ODD;
  }
  return UART2_PARITY_NONE;
}

static void applyUart2BaudRate(int candidateBaud) {
  long bounded = candidateBaud;
  if (bounded < (long)UART2_BAUD_MIN) bounded = (long)UART2_BAUD_MIN;
  if (bounded > (long)UART2_BAUD_MAX) bounded = (long)UART2_BAUD_MAX;
  uart2BaudRate = (uint32_t)bounded;
}

static void applyUart2DataBits(int candidateDataBits) {
  uart2DataBits = (candidateDataBits == 7) ? 7 : 8;
}

static void applyUart2StopBits(int candidateStopBits) {
  uart2StopBits = (candidateStopBits == 2) ? 2 : 1;
}

static uint32_t getUart2SerialConfig() {
  if (uart2DataBits == 7) {
    if (uart2Parity == UART2_PARITY_EVEN) {
      return (uart2StopBits == 2) ? SERIAL_7E2 : SERIAL_7E1;
    }
    if (uart2Parity == UART2_PARITY_ODD) {
      return (uart2StopBits == 2) ? SERIAL_7O2 : SERIAL_7O1;
    }
    return (uart2StopBits == 2) ? SERIAL_7N2 : SERIAL_7N1;
  }

  if (uart2Parity == UART2_PARITY_EVEN) {
    return (uart2StopBits == 2) ? SERIAL_8E2 : SERIAL_8E1;
  }
  if (uart2Parity == UART2_PARITY_ODD) {
    return (uart2StopBits == 2) ? SERIAL_8O2 : SERIAL_8O1;
  }
  return (uart2StopBits == 2) ? SERIAL_8N2 : SERIAL_8N1;
}

static void resetGpsRuntimeState() {
  gpsNmeaLine = "";
  gpsLatitude = 0.0;
  gpsLongitude = 0.0;
  gpsLocationValid = false;
  gpsRmcFix = false;
  gpsGgaFix = false;
  gpsSatellitesUsed = -1;
  gpsSatellitesInView = -1;
  gpsSatellitesInViewGN = -1;
  gpsSatellitesInViewGP = -1;
  gpsSatellitesInViewGL = -1;
  gpsSatellitesInViewGA = -1;
  gpsSatellitesInViewGB = -1;
  gpsSatellitesInViewBD = -1;
  gpsSatellitesInViewGQ = -1;
  gpsSatellitesInViewLastGNMs = 0;
  gpsSatellitesInViewLastGPMS = 0;
  gpsSatellitesInViewLastGLMs = 0;
  gpsSatellitesInViewLastGAMs = 0;
  gpsSatellitesInViewLastGBMs = 0;
  gpsSatellitesInViewLastBDMs = 0;
  gpsSatellitesInViewLastGQMs = 0;
  gpsSpeedKmh = -1.0f;
  gpsLastRmcMs = 0;
  gpsLastGgaMs = 0;
  gpsLastStatusLogMs = 0;
  gpsLastRxMs = 0;
  gpsRawBridgeStartMs = millis();
  gpsRawBridgeEndLogged = false;
  gpsRawLastStatsMs = gpsRawBridgeStartMs;
  gpsRawBytesTotal = 0;
  gpsRawBytesSinceStats = 0;
  gpsUtcTime = "";
  gpsUtcDate = "";
  uart2AprsLine = "";
  uart2YaesuUiAprsPrefix = "";
  uart2KissInFrame = false;
  uart2KissEscape = false;
  uart2KissFrameLen = 0;
}

