tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
static void configureUart2Port() {
  gpsSerial.end();
  resetGpsRuntimeState();
  resetBridgeBtsppOnRetryState();
  aprsTncBootRestartSent = false;
  aprsTncBootKissOnSent = false;
  aprsTncBootKissOnSentMs = 0;
  bridgeBtScanInProgress = false;
  bridgeBtScanRequested = false;
  bridgeAwaitBtsppOffAckForScan = false;

  uint32_t serialCfg = getUart2SerialConfig();
  gpsSerial.begin(uart2BaudRate, serialCfg, GPS_UART_RX_PIN, GPS_UART_TX_PIN);

  char parityChar = 'N';
  if (uart2Parity == UART2_PARITY_EVEN) parityChar = 'E';
  if (uart2Parity == UART2_PARITY_ODD) parityChar = 'O';
  Serial.printf("[UART2] Start RX=IO%d TX=IO%d BAUD=%lu FORMAT=%u%c%u TRYB=%s\n",
                GPS_UART_RX_PIN,
                GPS_UART_TX_PIN,
                (unsigned long)uart2BaudRate,
                (unsigned)uart2DataBits,
                parityChar,
                (unsigned)uart2StopBits,
                uart2ModeToCode(uart2Mode).c_str());

  if (isUart2GpsParsingEnabled()) {
    // Aktywacja GPS. Dla ATGM336H komenda jest po prostu ignorowana.
    gpsSerial.print(GPS_UART_ACTIVATE_COMMAND);
    gpsSerial.print("\r\n");
    Serial.printf("[UART2] TX: %s\\r\\n\n", GPS_UART_ACTIVATE_COMMAND);

    // Nie uruchamiaj automatycznie skanu BT na starcie.
    // Skan BTSPP ma byc wykonywany tylko recznie z panelu WWW.
    gpsSerial.print(UART2_BRIDGE_BTSPP_OFF_COMMAND);
    gpsSerial.print("\r\n");
    Serial.printf("[UART2] TX: %s\\r\\n\n", UART2_BRIDGE_BTSPP_OFF_COMMAND);

    gpsRawBridgeStartMs = millis();
    gpsRawLastStatsMs = gpsRawBridgeStartMs;
    gpsRawBridgeEndLogged = false;
    Serial.println("[GPS RAW] Start trybu testowego: przez 60 s surowe bajty z GPS beda kopiowane 1:1 na USB Serial");
#ifdef ENABLE_TFT_DISPLAY
    if (TOUCH_MISO == GPS_UART_RX_PIN) {
      Serial.printf("[GPS WARN] MOZLIWY KONFLIKT PINOW: GPS RX=IO%d i TOUCH_MISO=IO%d\n", GPS_UART_RX_PIN, TOUCH_MISO);
    }
#endif
  } else {
    // Gdy GPS parser nie jest aktywny, most BT SPP ma byc wyłączony.
    gpsSerial.print(UART2_BRIDGE_BTSPP_OFF_COMMAND);
    gpsSerial.print("\r\n");
    Serial.printf("[UART2] TX: %s\\r\\n\n", UART2_BRIDGE_BTSPP_OFF_COMMAND);
    gpsRawBridgeEndLogged = true;
    if (isUart2AprsUartSourceEnabled()) {
      Serial.println("[UART2] Nasluch APRS/TNC aktywny (parser GPS wylaczony)");
    } else {
      Serial.println("[UART2] Tryb none: dane z UART2 beda ignorowane");
    }
  }
}

float timezoneHours = DEFAULT_TIMEZONE_HOURS;
String qrzUsername = "";
String qrzPassword = "";
String qrzStatus = "QRZ: not configured";
String weatherApiKey = "";
String openWebRxUrl = DEFAULT_OPENWEBRX_URL;

// Konfiguracja filtrĂłw CC-Cluster (dxspots.com)
bool clusterNoAnnouncements = true;      // set/noann - wyłącz ogłoszenia
bool clusterNoWWV = true;                // set/nowwv - wyłącz WWV
bool clusterNoWCY = true;                // set/nowcy - wyłącz WCY
bool clusterUseFilters = true;            // Czy używać filtrów (set/filter)
String clusterFilterCommands = "set/ft8"; // Domyślna komenda filtra dla nowej konfiguracji
// Preferences/NVS key max length on ESP32 is 15 chars.
const char* NVS_KEY_CLUSTER_USEFILTERS = "cluster_usefl";

// Status poĹ‚Ä…czenia
bool wifiConnected = false;
unsigned long wifiConnectedAtMs = 0;
bool telnetConnected = false;
unsigned long lastTelnetAttempt = 0;
unsigned long lastNTPUpdate = 0;
bool gpsTimeSourceWasActive = false;
unsigned long lastWiFiReconnectAttempt = 0;
unsigned long lastWiFiStaReconnectAttempt = 0;
unsigned long wifiStaRetryWindowStartMs = 0;
unsigned long lastPotaAttempt = 0;
const unsigned long WIFI_AP_RETRY_INTERVAL_MS = 5UL * 60UL * 1000UL; // 5 minut
const unsigned long WIFI_STA_RETRY_INTERVAL_MS = 20UL * 1000UL; // 20 sekund
const unsigned long WIFI_STA_RETRY_WINDOW_MS = 10UL * 60UL * 1000UL; // maks. 10 minut prób w STA
const uint8_t WIFI_STA_RECONNECT_ATTEMPTS = 6; // 6 * 500ms = ~3s na SSID (mniej blokujące)

const uint8_t RGB_LED_RED_PIN = 4;
const uint8_t RGB_LED_GREEN_PIN = 16;
const uint8_t RGB_LED_BLUE_PIN = 17;
const unsigned long RGB_RED_DISCONNECTED_BLINK_MS = 1000UL;
bool rgbLedPrevWifiConnected = false;
unsigned long rgbRedBlinkLastToggleMs = 0;
bool rgbRedBlinkStateOn = false;
bool rgbBlueAprsAlertActive = false;
unsigned long rgbBlueAprsAlertUntilMs = 0;
unsigned long rgbBlueAprsLastToggleMs = 0;
bool rgbBlueAprsStateOn = false;

// Restart (np. po zapisaniu konfiguracji)
bool restartRequested = false;
unsigned long restartAtMs = 0;

// Stan sesji DX Cluster (Telnet)
bool clusterLoginSent = false;
bool clusterLoginScheduled = false;
unsigned long clusterSendLoginAtMs = 0;
unsigned long lastClusterKeepAliveMs = 0;
unsigned long lastTelnetRxMs = 0;
const unsigned long TELNET_INACTIVITY_RECONNECT_MS = 5UL * 60UL * 1000UL; // 5 minut

// Stan sesji POTA Cluster (Telnet)
bool potaTelnetConnected = false;
bool potaLoginSent = false;
bool potaLoginScheduled = false;
unsigned long potaSendLoginAtMs = 0;
unsigned long lastPotaKeepAliveMs = 0;
unsigned long lastPotaRxMs = 0;
const unsigned long POTA_TELNET_INACTIVITY_RECONNECT_MS = 5UL * 60UL * 1000UL; // 5 minut

// Bufor dla danych Telnet
String telnetBuffer = "";
String pendingTelnetLine = "";
unsigned long pendingTelnetDropped = 0;

// Bufor dla danych POTA Telnet
String potaTelnetBuffer = "";
String pendingPotaLine = "";
unsigned long pendingPotaDropped = 0;

// QRZ cache (żeby nie pytaÄ‡ w kółko o te same znaki)
struct QrzCacheEntry {
  String callsign;
  String grid;
  String country;
  float lat;
  float lon;
  bool hasLatLon;
  unsigned long fetchedAtMs;
};
const int QRZ_CACHE_SIZE = 20;
QrzCacheEntry qrzCache[QRZ_CACHE_SIZE];

static bool validateNmeaChecksum(const String &line) {
  if (!line.startsWith("$")) {
    return false;
  }

  int starPos = line.indexOf('*');
  if (starPos < 0) {
    return true;
  }
  if ((starPos + 2) >= (int)line.length()) {
    return false;
  }

  uint8_t calc = 0;
  for (int i = 1; i < starPos; i++) {
    calc ^= (uint8_t)line.charAt(i);
  }

  char expectedHex[3];
  expectedHex[0] = line.charAt(starPos + 1);
  expectedHex[1] = line.charAt(starPos + 2);
  expectedHex[2] = '\0';
  uint8_t expected = (uint8_t)strtoul(expectedHex, nullptr, 16);

  return calc == expected;
}

static String getNmeaField(const String &line, int fieldIndex) {
  int fieldStart = 0;
  int currentField = 0;

