tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  for (int i = 0; i <= (int)line.length(); i++) {
    bool fieldEnd = (i == (int)line.length()) || (line.charAt(i) == ',') || (line.charAt(i) == '*');
    if (!fieldEnd) {
      continue;
    }

    if (currentField == fieldIndex) {
      return line.substring(fieldStart, i);
    }

    currentField++;
    fieldStart = i + 1;

    if (i < (int)line.length() && line.charAt(i) == '*') {
      break;
    }
  }

  return "";
}

static bool parseNmeaCoordinate(const String &rawCoord, char hemisphere, double &outCoord) {
  if (rawCoord.length() < 4) {
    return false;
  }

  int dotPos = rawCoord.indexOf('.');
  int degDigits = (dotPos > 4) ? 3 : 2;
  if (dotPos < 0) {
    degDigits = (rawCoord.length() > 5) ? 3 : 2;
  }
  if ((int)rawCoord.length() <= degDigits) {
    return false;
  }

  double degrees = rawCoord.substring(0, degDigits).toDouble();
  double minutes = rawCoord.substring(degDigits).toDouble();
  if (minutes < 0.0 || minutes >= 60.0) {
    return false;
  }

  outCoord = degrees + (minutes / 60.0);
  hemisphere = (char)toupper((unsigned char)hemisphere);
  if (hemisphere == 'S' || hemisphere == 'W') {
    outCoord = -outCoord;
  }

  return true;
}

static void updateGpsFromRmc(const String &line) {
  String status = getNmeaField(line, 2);
  status.toUpperCase();

  gpsRmcFix = (status.length() > 0 && status.charAt(0) == 'A');
  gpsLastRmcMs = millis();

  String utc = getNmeaField(line, 1);
  if (utc.length() >= 6) {
    gpsUtcTime = utc.substring(0, 6);
  }

  String date = getNmeaField(line, 9);
  if (date.length() >= 6) {
    gpsUtcDate = date.substring(0, 6);
  }

  String speedKnotsField = getNmeaField(line, 7);
  if (speedKnotsField.length() > 0) {
    gpsSpeedKmh = speedKnotsField.toFloat() * 1.852f;
  } else {
    gpsSpeedKmh = -1.0f;
  }

  if (!gpsRmcFix) {
    return;
  }

  String latField = getNmeaField(line, 3);
  String latHemField = getNmeaField(line, 4);
  String lonField = getNmeaField(line, 5);
  String lonHemField = getNmeaField(line, 6);

  if (latField.length() == 0 || latHemField.length() == 0 || lonField.length() == 0 || lonHemField.length() == 0) {
    return;
  }

  double parsedLat = 0.0;
  double parsedLon = 0.0;
  if (!parseNmeaCoordinate(latField, latHemField.charAt(0), parsedLat)) {
    return;
  }
  if (!parseNmeaCoordinate(lonField, lonHemField.charAt(0), parsedLon)) {
    return;
  }

  gpsLatitude = parsedLat;
  gpsLongitude = parsedLon;
  gpsLocationValid = true;
}

static void updateGpsFromGga(const String &line) {
  String fixQualityField = getNmeaField(line, 6);
  int fixQuality = fixQualityField.toInt();
  String satsUsedField = getNmeaField(line, 7);
  if (satsUsedField.length() > 0) {
    gpsSatellitesUsed = satsUsedField.toInt();
  }

  gpsGgaFix = (fixQuality > 0);
  gpsLastGgaMs = millis();

  String utc = getNmeaField(line, 1);
  if (utc.length() >= 6) {
    gpsUtcTime = utc.substring(0, 6);
  }

  if (!gpsGgaFix) {
    return;
  }

  String latField = getNmeaField(line, 2);
  String latHemField = getNmeaField(line, 3);
  String lonField = getNmeaField(line, 4);
  String lonHemField = getNmeaField(line, 5);

  if (latField.length() == 0 || latHemField.length() == 0 || lonField.length() == 0 || lonHemField.length() == 0) {
    return;
  }

  double parsedLat = 0.0;
  double parsedLon = 0.0;
  if (!parseNmeaCoordinate(latField, latHemField.charAt(0), parsedLat)) {
    return;
  }
  if (!parseNmeaCoordinate(lonField, lonHemField.charAt(0), parsedLon)) {
    return;
  }

  gpsLatitude = parsedLat;
  gpsLongitude = parsedLon;
  gpsLocationValid = true;
}

static void updateGpsFromGsv(const String &line) {
  String sentenceType = getNmeaField(line, 0);
  if (sentenceType.startsWith("$")) {
    sentenceType.remove(0, 1);
  }
  sentenceType.toUpperCase();

  String talker = "";
  if (sentenceType.length() >= 2) {
    talker = sentenceType.substring(0, 2);
  }

  String satsInViewField = getNmeaField(line, 3);
  if (satsInViewField.length() == 0) {
    return;
  }

  int satsInView = satsInViewField.toInt();
  if (satsInView < 0) {
    return;
  }

  unsigned long nowMs = millis();

  if (talker == "GN") {
    gpsSatellitesInViewGN = satsInView;
    gpsSatellitesInViewLastGNMs = nowMs;
  } else if (talker == "GP") {
    gpsSatellitesInViewGP = satsInView;
    gpsSatellitesInViewLastGPMS = nowMs;
  } else if (talker == "GL") {
    gpsSatellitesInViewGL = satsInView;
    gpsSatellitesInViewLastGLMs = nowMs;
  } else if (talker == "GA") {
    gpsSatellitesInViewGA = satsInView;
    gpsSatellitesInViewLastGAMs = nowMs;
  } else if (talker == "GB" || talker == "BD") {
    if (talker == "GB") {
      gpsSatellitesInViewGB = satsInView;
      gpsSatellitesInViewLastGBMs = nowMs;
    } else {
      gpsSatellitesInViewBD = satsInView;
      gpsSatellitesInViewLastBDMs = nowMs;
    }
  } else if (talker == "GQ") {
    gpsSatellitesInViewGQ = satsInView;
    gpsSatellitesInViewLastGQMs = nowMs;
  }

  bool gnFresh = (gpsSatellitesInViewGN >= 0) && (gpsSatellitesInViewLastGNMs != 0) && ((nowMs - gpsSatellitesInViewLastGNMs) <= GPS_GSV_SOURCE_FRESHNESS_MS);
  if (gnFresh) {
    // GNGSV zwykle podaje laczna liczbe satelitow we wszystkich konstelacjach.
    gpsSatellitesInView = gpsSatellitesInViewGN;
    return;
  }

  int totalInView = 0;
  bool hasAny = false;

  if (gpsSatellitesInViewGP >= 0 && gpsSatellitesInViewLastGPMS != 0 && (nowMs - gpsSatellitesInViewLastGPMS) <= GPS_GSV_SOURCE_FRESHNESS_MS) {
    totalInView += gpsSatellitesInViewGP;
    hasAny = true;
  }
  if (gpsSatellitesInViewGL >= 0 && gpsSatellitesInViewLastGLMs != 0 && (nowMs - gpsSatellitesInViewLastGLMs) <= GPS_GSV_SOURCE_FRESHNESS_MS) {
    totalInView += gpsSatellitesInViewGL;
    hasAny = true;
  }
  if (gpsSatellitesInViewGA >= 0 && gpsSatellitesInViewLastGAMs != 0 && (nowMs - gpsSatellitesInViewLastGAMs) <= GPS_GSV_SOURCE_FRESHNESS_MS) {
    totalInView += gpsSatellitesInViewGA;
    hasAny = true;
  }
  if (gpsSatellitesInViewGB >= 0 && gpsSatellitesInViewLastGBMs != 0 && (nowMs - gpsSatellitesInViewLastGBMs) <= GPS_GSV_SOURCE_FRESHNESS_MS) {
    totalInView += gpsSatellitesInViewGB;
    hasAny = true;
  }
  if (gpsSatellitesInViewBD >= 0 && gpsSatellitesInViewLastBDMs != 0 && (nowMs - gpsSatellitesInViewLastBDMs) <= GPS_GSV_SOURCE_FRESHNESS_MS) {
    totalInView += gpsSatellitesInViewBD;
    hasAny = true;
  }
  if (gpsSatellitesInViewGQ >= 0 && gpsSatellitesInViewLastGQMs != 0 && (nowMs - gpsSatellitesInViewLastGQMs) <= GPS_GSV_SOURCE_FRESHNESS_MS) {
    totalInView += gpsSatellitesInViewGQ;
    hasAny = true;
  }

  if (hasAny) {
    gpsSatellitesInView = totalInView;
  } else {
    gpsSatellitesInView = satsInView;
  }
}

