tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
static bool parseGpsEsp32Frame(const String &line) {
  if (!line.startsWith("$GPSESP32[")) {
    return false;
  }

  int openPos = line.indexOf('[');
  int closePos = line.lastIndexOf(']');
  if (openPos < 0 || closePos <= openPos) {
    return true;
  }

  String payload = line.substring(openPos + 1, closePos);
  String fields[7];
  int fieldCount = 0;
  int start = 0;
  for (int i = 0; i <= (int)payload.length(); i++) {
    bool endField = (i == (int)payload.length()) || (payload.charAt(i) == ',');
    if (!endField) {
      continue;
    }

    if (fieldCount >= 7) {
      return true;
    }

    fields[fieldCount] = payload.substring(start, i);
    fields[fieldCount].trim();
    fieldCount++;
    start = i + 1;
  }

  if (fieldCount != 7) {
    return true;
  }

  bool nmeaValid = (fields[0].toInt() == 1);
  bool hasFix = (fields[1].toInt() == 1);
  int sats = fields[2].toInt();
  if (sats < 0) sats = 0;
  if (sats > 99) sats = 99;

  String hhmmss = "";
  if (fields[5].length() == 8 && fields[5].charAt(2) == ':' && fields[5].charAt(5) == ':') {
    hhmmss = fields[5].substring(0, 2) + fields[5].substring(3, 5) + fields[5].substring(6, 8);
  }

  String ddmmyy = "";
  if (fields[6].length() == 10 && fields[6].charAt(2) == '-' && fields[6].charAt(5) == '-') {
    ddmmyy = fields[6].substring(0, 2) + fields[6].substring(3, 5) + fields[6].substring(8, 10);
  }

  unsigned long nowMs = millis();
  gpsLastRmcMs = nowMs;
  gpsLastGgaMs = nowMs;
  gpsRmcFix = nmeaValid && hasFix;
  gpsGgaFix = nmeaValid && hasFix;
  gpsSatellitesUsed = sats;
  gpsSatellitesInView = sats;
  gpsSatellitesInViewGN = -1;
  gpsSatellitesInViewGP = -1;
  gpsSatellitesInViewGL = -1;
  gpsSatellitesInViewGA = -1;
  gpsSatellitesInViewGB = -1;
  gpsSatellitesInViewBD = -1;
  gpsSatellitesInViewGQ = -1;
  gpsSatellitesInViewLastGNMs = 0;
  gpsSatellitesInViewLastGPMS = 0;
  gpsSatellitesInViewLastGLMs = 0;
  gpsSatellitesInViewLastGAMs = 0;
  gpsSatellitesInViewLastGBMs = 0;
  gpsSatellitesInViewLastBDMs = 0;
  gpsSatellitesInViewLastGQMs = 0;
  gpsSpeedKmh = -1.0f;
  gpsUtcTime = hhmmss;
  gpsUtcDate = ddmmyy;

  if (!(nmeaValid && hasFix)) {
    gpsLocationValid = false;
    gpsLatitude = 0.0;
    gpsLongitude = 0.0;
    return true;
  }

  double lat = fields[3].toDouble();
  double lon = fields[4].toDouble();
  bool latOk = (lat >= -90.0 && lat <= 90.0);
  bool lonOk = (lon >= -180.0 && lon <= 180.0);
  if (latOk && lonOk) {
    gpsLatitude = lat;
    gpsLongitude = lon;
    gpsLocationValid = true;
  } else {
    gpsLocationValid = false;
  }

  return true;
}

static void parseGpsNmeaSentence(const String &line) {
  if (parseGpsEsp32Frame(line)) {
    return;
  }

  if (!validateNmeaChecksum(line)) {
    return;
  }

  String sentenceType = getNmeaField(line, 0);
  if (sentenceType.startsWith("$")) {
    sentenceType.remove(0, 1);
  }
  sentenceType.toUpperCase();

  if (sentenceType.endsWith("RMC")) {
    updateGpsFromRmc(line);
    return;
  }

  if (sentenceType.endsWith("GGA")) {
    updateGpsFromGga(line);
    return;
  }

  if (sentenceType.endsWith("GSV")) {
    updateGpsFromGsv(line);
    return;
  }
}

static String decodeKissPrintableInfo(const uint8_t *payload, size_t len, size_t infoStart) {
  if (len == 0 || infoStart >= len) {
    return "";
  }

  String out = "";
  out.reserve((len - infoStart) + 8);
  for (size_t i = infoStart; i < len; i++) {
    char c = (char)payload[i];
    if (c == '\r' || c == '\n') {
      continue;
    }
    if ((uint8_t)c < 32 || (uint8_t)c > 126) {
      if (c == '\t') {
        out += ' ';
      }
      continue;
    }
    out += c;
  }
  out.trim();
  return out;
}

static String decodeAx25AddressToken(const uint8_t *addr, bool withRepeatedMark, bool *okOut, bool *lastOut = nullptr) {
  bool ok = true;
  String call = "";
  call.reserve(6);

  for (int i = 0; i < 6; i++) {
    char c = (char)(addr[i] >> 1);
    if (c == ' ') {
      continue;
    }
    if (!((c >= 'A' && c <= 'Z') || (c >= '0' && c <= '9'))) {
      ok = false;
      break;
    }
    call += c;
  }

  call.trim();
  if (call.length() == 0) {
    ok = false;
  }

  if (!ok) {
    if (okOut) *okOut = false;
    if (lastOut) *lastOut = false;
    return "";
  }

  uint8_t ssid = (uint8_t)((addr[6] >> 1) & 0x0F);
  bool isLast = (addr[6] & 0x01) != 0;
  bool hasBeenRepeated = (addr[6] & 0x80) != 0;

  String token = call;
  if (ssid > 0) {
    token += "-";
    token += String(ssid);
  }
  if (withRepeatedMark && hasBeenRepeated) {
    token += "*";
  }

  if (okOut) *okOut = true;
  if (lastOut) *lastOut = isLast;
  return token;
}

static String decodeKissPayloadToTnc2(const uint8_t *payload, size_t len) {
  if (len == 0) {
    return "";
  }

  // Fallback: część modemów zwraca już payload tekstowy.
  if (len < 16) {
    return decodeKissPrintableInfo(payload, len, 0);
  }

  size_t offset = 0;
  bool ok = false;
  bool isLast = false;

  String destination = decodeAx25AddressToken(payload + offset, false, &ok, &isLast);
  if (!ok) {
    return decodeKissPrintableInfo(payload, len, 0);
  }
  offset += 7;

  if ((offset + 7) > len) {
    return decodeKissPrintableInfo(payload, len, 0);
  }

  String source = decodeAx25AddressToken(payload + offset, false, &ok, &isLast);
  if (!ok) {
    return decodeKissPrintableInfo(payload, len, 0);
  }
  offset += 7;

  String path = "";
  uint8_t digiGuard = 0;
  while (!isLast && (offset + 7) <= len && digiGuard < 8) {
    bool digiLast = false;
    String digi = decodeAx25AddressToken(payload + offset, true, &ok, &digiLast);
    if (!ok || digi.length() == 0) {
      return decodeKissPrintableInfo(payload, len, 0);
    }
    if (path.length() > 0) {
      path += ",";
    }
    path += digi;
    isLast = digiLast;
    offset += 7;
    digiGuard++;
  }

  if (!isLast || offset >= len) {
    return decodeKissPrintableInfo(payload, len, 0);
  }

  size_t infoStart = offset;
  if (infoStart < len && payload[infoStart] == 0x03) {
    infoStart++;
  }
  if (infoStart < len && payload[infoStart] == 0xF0) {
    infoStart++;
  }

  String info = decodeKissPrintableInfo(payload, len, infoStart);
  if (info.length() == 0) {
    return "";
  }

  String tnc2 = source;
  tnc2 += ">";
  tnc2 += destination;
  if (path.length() > 0) {
    tnc2 += ",";
    tnc2 += path;
  }
  tnc2 += ":";
  tnc2 += info;
  return tnc2;
}

static bool isAprsCallsignTokenValid(const String &token) {
  if (token.length() < 3 || token.length() > 15) {
    return false;
  }

  for (size_t i = 0; i < token.length(); i++) {
    char c = token.charAt(i);
    bool ok = ((c >= 'A' && c <= 'Z') ||
               (c >= 'a' && c <= 'z') ||
               (c >= '0' && c <= '9') ||
               c == '-');
    if (!ok) {
      return false;
    }
  }
  return true;
}

