tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
static bool isAprsSourceChar(char c) {
  return ((c >= 'A' && c <= 'Z') ||
          (c >= 'a' && c <= 'z') ||
          (c >= '0' && c <= '9') ||
          c == '-');
}

static int findAprsFrameStartInText(const String &text, int fromPos) {
  int gtPos = text.indexOf('>', fromPos);
  while (gtPos >= 0) {
    int start = gtPos - 1;
    while (start >= 0 && isAprsSourceChar(text.charAt(start))) {
      start--;
    }
    start++;

    int tokenLen = gtPos - start;
    if (tokenLen >= 3 && tokenLen <= 15) {
      String src = text.substring(start, gtPos);
      if (isAprsCallsignTokenValid(src)) {
        return start;
      }
    }

    gtPos = text.indexOf('>', gtPos + 1);
  }

  return -1;
}

static void stripKnownUartNoiseTokens(String &line) {
  // BT stack alert, który bywa doklejany do ramek APRS bez separatora.
  const char *warnToken = "ASSERT_WARN(1 8), in lc_task.c at line 1559";
  while (line.indexOf(warnToken) >= 0) {
    line.replace(warnToken, "");
  }
}

static void removeAllTokenFromLine(String &line, const char *token) {
  while (line.indexOf(token) >= 0) {
    line.replace(token, "");
  }
}

static void stripBridgeControlTokensFromLine(String &line) {
  removeAllTokenFromLine(line, "ACK BTSPP_OFF");
  removeAllTokenFromLine(line, "ACK BTSPP_ON");
  removeAllTokenFromLine(line, "ACK BT SCAN");
  removeAllTokenFromLine(line, "[BT] AUTO CONNECT OK");
  removeAllTokenFromLine(line, "AUTO CONNECT OK");
  removeAllTokenFromLine(line, "BTCNT_OK");
  removeAllTokenFromLine(line, "BTCNT_ERR");
  removeAllTokenFromLine(line, "BTDISC_OK");
  removeAllTokenFromLine(line, "BTDISC_ERR");
  removeAllTokenFromLine(line, "BT[LIST_END]");

  int beginPos = line.indexOf("BT[LIST_BEGIN]:");
  while (beginPos >= 0) {
    int endPos = beginPos + (int)strlen("BT[LIST_BEGIN]:");
    while (endPos < (int)line.length() && isdigit((unsigned char)line.charAt(endPos))) {
      endPos++;
    }
    line.remove(beginPos, endPos - beginPos);
    beginPos = line.indexOf("BT[LIST_BEGIN]:");
  }

  int namePos = line.indexOf("BT[NAME]:");
  while (namePos >= 0) {
    int btPos = line.indexOf("[BT]", namePos + 9);
    if (btPos >= 0) {
      line.remove(namePos, (btPos + 4) - namePos);
    } else {
      line.remove(namePos);
      break;
    }
    namePos = line.indexOf("BT[NAME]:");
  }

  int errPos = line.indexOf("BT[ERROR]:");
  while (errPos >= 0) {
    int btPos = line.indexOf("[BT]", errPos + 10);
    if (btPos >= 0) {
      line.remove(errPos, (btPos + 4) - errPos);
    } else {
      line.remove(errPos);
      break;
    }
    errPos = line.indexOf("BT[ERROR]:");
  }
}

static bool parseBridgeBtNameLine(const String &line, String &outName, String &outAddrNoColon) {
  int namePos = line.indexOf("BT[NAME]:");
  if (namePos < 0) {
    return false;
  }

  String payload = line.substring(namePos + 9);
  int adrPos = payload.indexOf("[ADR]");
  int btPos = payload.indexOf("[BT]", adrPos + 5);
  if (adrPos < 0 || btPos < 0 || btPos <= adrPos) {
    return false;
  }

  String name = payload.substring(0, adrPos);
  String rawAddr = payload.substring(adrPos + 5, btPos);
  name = sanitizeBridgeTextField(name, 40);
  String normAddr = normalizeBridgeBtAddress(rawAddr);
  if (normAddr.length() != 12) {
    return false;
  }
  if (name.length() == 0) {
    name = "BT_DEVICE";
  }

  outName = name;
  outAddrNoColon = normAddr;
  return true;
}

static bool processBridgeControlLine(String rawLine) {
  if (!isUart2BridgeModuleSelected()) {
    return false;
  }

  String line = rawLine;
  line.trim();
  if (line.length() == 0) {
    return false;
  }

  bool handled = false;

  if (line.indexOf("ACK BTSPP_OFF") >= 0) {
    bridgeBtLastAck = "ACK BTSPP_OFF";
    handled = true;
    if (bridgeAwaitBtsppOffAckForScan || bridgeBtScanRequested) {
      bridgeAwaitBtsppOffAckForScan = false;
      bridgeBtScanRequested = false;
      if (!sendBridgeUartCommandLine(UART2_BRIDGE_BT_SCAN_COMMAND, true)) {
        bridgeBtLastError = "SEND_BT_SCAN_FAIL";
        bridgeBtScanInProgress = false;
      }
    }
  }

  if (line.indexOf("ACK BTSPP_ON") >= 0) {
    bridgeBtLastAck = "ACK BTSPP_ON";
    bridgeBtLastError = "";
    resetBridgeBtsppOnRetryState();
    handled = true;
  }

  if (line.indexOf("ACK BT SCAN") >= 0) {
    bridgeBtLastAck = "ACK BT SCAN";
    bridgeBtScanInProgress = true;
    bridgeBtLastScanMs = millis();
    bridgeBtLastError = "";
    handled = true;
  }

  if (line.indexOf("[BT] AUTO CONNECT OK") >= 0 || line.indexOf("AUTO CONNECT OK") >= 0) {
    bridgeBtLastAck = "AUTO CONNECT OK";
    bridgeBtLastError = "";
    handled = true;
    Serial.println("[BRIDGE] AUTO CONNECT OK -> start retry BTSPP_ON (max 3, co 2s)");
    triggerBridgeBtsppOnRetryStart();
    serviceBridgeBtsppOnRetry(millis());
  }

  if (line.indexOf("BTDISC_OK") >= 0) {
    bridgeBtLastDiscStatus = "BTDISC_OK";
    handled = true;
  }
  if (line.indexOf("BTDISC_ERR") >= 0) {
    bridgeBtLastDiscStatus = "BTDISC_ERR";
    handled = true;
  }

  int listBeginPos = line.indexOf("BT[LIST_BEGIN]:");
  if (listBeginPos >= 0) {
    int countStart = listBeginPos + (int)strlen("BT[LIST_BEGIN]:");
    int countEnd = countStart;
    while (countEnd < (int)line.length() && isdigit((unsigned char)line.charAt(countEnd))) {
      countEnd++;
    }
    String countStr = line.substring(countStart, countEnd);
    countStr.trim();
    bridgeBtListExpected = (countStr.length() > 0) ? countStr.toInt() : -1;
    clearBridgeBtScanList();
    bridgeBtListCollecting = true;
    bridgeBtScanInProgress = true;
    handled = true;
  }

  String nameParsed;
  String addrParsed;
  if (parseBridgeBtNameLine(line, nameParsed, addrParsed)) {
    addOrUpdateBridgeBtDevice(nameParsed, addrParsed);
    bridgeBtListCollecting = true;
    bridgeBtScanInProgress = true;
    handled = true;
  }

  if (line.indexOf("BT[LIST_END]") >= 0) {
    bridgeBtListCollecting = false;
    bridgeBtScanInProgress = false;
    bridgeBtLastScanMs = millis();
    handled = true;

    if (bridgeBtAutoConnectPending && bridgeBtPairedAddress.length() == 12) {
      requestBridgePairConnect(bridgeBtPairedName, bridgeBtPairedAddress, "", true);
      bridgeBtAutoConnectPending = false;
    }
  }

