tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  int errPos = line.indexOf("BT[ERROR]:");
  if (errPos >= 0) {
    String errPayload = line.substring(errPos + 10);
    int btEnd = errPayload.indexOf("[BT]");
    if (btEnd >= 0) {
      errPayload = errPayload.substring(0, btEnd);
    }
    errPayload.trim();
    bridgeBtLastError = errPayload;
    bridgeBtScanInProgress = false;
    bridgeBtListCollecting = false;
    handled = true;
  }

  if (line.indexOf("BTCNT_OK") >= 0) {
    bridgeBtPairPending = false;
    bridgeBtPairLastResult = 1;
    bridgeBtPairLastResultMs = millis();
    handled = true;

    if (bridgeBtPairPendingAddress.length() == 12) {
      bridgeBtPairedAddress = bridgeBtPairPendingAddress;
      bridgeBtPairedName = bridgeBtPairPendingName;
      saveBridgeBtPairingToNvs();
    }

    bridgeBtPairPendingAddress = "";
    bridgeBtPairPendingName = "";
    Serial.println("[BRIDGE] BTCNT_OK -> start retry BTSPP_ON (max 3, co 2s)");
    triggerBridgeBtsppOnRetryStart();
    serviceBridgeBtsppOnRetry(millis());
  }

  if (line.indexOf("BTCNT_ERR") >= 0) {
    bridgeBtPairPending = false;
    bridgeBtPairLastResult = -1;
    bridgeBtPairLastResultMs = millis();
    bridgeBtLastError = "BTCNT_ERR";
    bridgeBtPairPendingAddress = "";
    bridgeBtPairPendingName = "";
    handled = true;
  }

  return handled;
}

static bool isLikelyAprsTnc2Frame(const String &line) {
  if (line.length() < 10 || line.length() > 340) {
    return false;
  }

  if (line.startsWith("ASSERT") || line.startsWith("Guru Meditation") || line.startsWith("E (")) {
    return false;
  }

  int gtPos = line.indexOf('>');
  if (gtPos < 3 || gtPos > 15) {
    return false;
  }

  int colonPos = line.indexOf(':', gtPos + 1);
  if (colonPos < 0 || colonPos <= (gtPos + 1) || colonPos >= (int)line.length() - 1) {
    return false;
  }

  String source = line.substring(0, gtPos);
  source.trim();
  if (!isAprsCallsignTokenValid(source)) {
    return false;
  }

  return true;
}

static bool isYaesuUiMonitorHeaderLine(const String &line) {
  if (line.length() < 12) {
    return false;
  }
  if (line.indexOf("] <UI") < 0) {
    return false;
  }
  return line.endsWith(">:");
}

static String normalizeYaesuUiHeaderToAprsPrefix(const String &headerLine) {
  String prefix = headerLine;
  int uiPos = prefix.lastIndexOf(" <UI");
  if (uiPos < 0 || !prefix.endsWith(">:")) {
    return prefix;
  }

  int timestampPos = prefix.lastIndexOf(" [", uiPos);
  if (timestampPos >= 0 && prefix.indexOf("] <UI", timestampPos) >= 0) {
    prefix = prefix.substring(0, timestampPos);
  } else {
    prefix = prefix.substring(0, uiPos);
  }
  prefix += ":";
  return prefix;
}

static void handleUartAprsKissFrame(const uint8_t *frame, size_t len) {
  if (!isUart2AprsKissParsingEnabled()) {
    return;
  }
  if (len < 2) {
    return;
  }

  uint8_t portCmd = frame[0];
  if ((portCmd & 0x0F) != 0x00) {
    return;
  }

  String line = decodeKissPayloadToTnc2(frame + 1, len - 1);
  if (line.length() == 0) {
    return;
  }

  if (!isLikelyAprsTnc2Frame(line)) {
    return;
  }

  processAprsFrameFromLine(line, "UART2/KISS");
}

static void handleUartAprsTextLine(String line) {
  if (!isUart2AprsTextParsingEnabled()) {
    return;
  }

  stripKnownUartNoiseTokens(line);
  processBridgeControlLine(line);
  stripBridgeControlTokensFromLine(line);
  line.trim();
  if (line.length() == 0) {
    return;
  }

  if (line.startsWith("#")) {
    return;
  }

  // Yaesu Packet Monitor: naglowek jest w osobnej linii, payload w nastepnej.
  if (uart2YaesuUiAprsPrefix.length() > 0) {
    String combined = uart2YaesuUiAprsPrefix + line;
    uart2YaesuUiAprsPrefix = "";
    combined.trim();
    if (isLikelyAprsTnc2Frame(combined)) {
      processAprsFrameFromLine(combined, "UART2/TNC2");
      return;
    }
  }

  if (isYaesuUiMonitorHeaderLine(line)) {
    uart2YaesuUiAprsPrefix = normalizeYaesuUiHeaderToAprsPrefix(line);
    return;
  }

  int cursor = 0;
  while (cursor < (int)line.length()) {
    int start = findAprsFrameStartInText(line, cursor);
    if (start < 0) {
      break;
    }

    int gtPos = line.indexOf('>', start);
    if (gtPos < 0) {
      break;
    }

    int colonPos = line.indexOf(':', gtPos + 1);
    if (colonPos < 0) {
      break;
    }

    int nextStart = findAprsFrameStartInText(line, colonPos + 1);
    int end = (nextStart >= 0) ? nextStart : (int)line.length();
    if (end <= start) {
      cursor = start + 1;
      continue;
    }

    String candidate = line.substring(start, end);
    candidate.trim();
    if (isLikelyAprsTnc2Frame(candidate)) {
      processAprsFrameFromLine(candidate, "UART2/TNC2");
    }

    cursor = end;
  }
}

static void processUartAprsByte(uint8_t b) {
  if (!isUart2AprsUartSourceEnabled()) {
    return;
  }

  if (isUart2AprsKissParsingEnabled()) {
    if (b == 0xC0) {
      if (uart2KissInFrame && uart2KissFrameLen > 0) {
        handleUartAprsKissFrame(uart2KissFrame, uart2KissFrameLen);
      }
      uart2KissInFrame = true;
      uart2KissEscape = false;
      uart2KissFrameLen = 0;
      return;
    }

    if (uart2KissInFrame) {
      if (uart2KissEscape) {
        uart2KissEscape = false;
        if (b == 0xDC) {
          b = 0xC0;
        } else if (b == 0xDD) {
          b = 0xDB;
        }
      } else if (b == 0xDB) {
        uart2KissEscape = true;
        return;
      }

      if (uart2KissFrameLen < sizeof(uart2KissFrame)) {
        uart2KissFrame[uart2KissFrameLen++] = b;
      } else {
        uart2KissFrameLen = 0;
        uart2KissInFrame = false;
        uart2KissEscape = false;
      }
      return;
    }
  }

  if (b == '\r' || b == '\n') {
    if (uart2AprsLine.length() > 0) {
      String line = uart2AprsLine;
      uart2AprsLine = "";
      handleUartAprsTextLine(line);
    }
    return;
  }

  if (uart2AprsLine.length() < 512) {
    uart2AprsLine += (char)b;
  } else {
    uart2AprsLine = "";
  }
}

static void pollGpsSerial() {
  if (!isUart2GpsParsingEnabled() && !isUart2AprsUartSourceEnabled()) {
    return;
  }

