tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  unsigned long nowMs = millis();
  bool gpsParsingEnabled = isUart2GpsParsingEnabled();
  bool rawBridgeActive = gpsParsingEnabled && ((nowMs - gpsRawBridgeStartMs) < GPS_RAW_BRIDGE_WINDOW_MS);

  if (rawBridgeActive && (nowMs - gpsRawLastStatsMs) >= GPS_RAW_STATS_INTERVAL_MS) {
    gpsRawLastStatsMs = nowMs;
    Serial.printf("[GPS RAW] Odebrane bajty (ostatnie 5 s): %lu | suma: %lu\n",
                  (unsigned long)gpsRawBytesSinceStats,
                  (unsigned long)gpsRawBytesTotal);
    gpsRawBytesSinceStats = 0;
  }

  if (!rawBridgeActive && !gpsRawBridgeEndLogged) {
    Serial.printf("[GPS RAW] Koniec trybu testowego po 60 s | suma odebranych bajtow: %lu\n",
                  (unsigned long)gpsRawBytesTotal);
    gpsRawBridgeEndLogged = true;
  }

  while (gpsSerial.available() > 0) {
    char c = (char)gpsSerial.read();
    gpsLastRxMs = nowMs;
    gpsRawBytesTotal++;
    gpsRawBytesSinceStats++;

    if (rawBridgeActive) {
      Serial.write((uint8_t)c);
    }

    if (isUart2AprsUartSourceEnabled()) {
      processUartAprsByte((uint8_t)c);
    }

    if (!gpsParsingEnabled) {
      continue;
    }

    if (c == '\r') {
      continue;
    }

    if (c == '\n') {
      if (gpsNmeaLine.length() > 6) {
        parseGpsNmeaSentence(gpsNmeaLine);
      }
      gpsNmeaLine = "";
      continue;
    }

    if (gpsNmeaLine.length() < 160) {
      gpsNmeaLine += c;
    } else {
      gpsNmeaLine = "";
    }
  }
}

static bool isGpsFixActive(unsigned long nowMs) {
  bool rmcFreshFix = gpsRmcFix && gpsLastRmcMs != 0 && (nowMs - gpsLastRmcMs) <= GPS_FIX_FRESHNESS_MS;
  bool ggaFreshFix = gpsGgaFix && gpsLastGgaMs != 0 && (nowMs - gpsLastGgaMs) <= GPS_FIX_FRESHNESS_MS;
  return rmcFreshFix || ggaFreshFix;
}

static bool isGpsUartActive(unsigned long nowMs) {
  return gpsLastRxMs != 0 && (nowMs - gpsLastRxMs) <= GPS_UART_ACTIVE_TIMEOUT_MS;
}

static bool getServiceCoordinatesForServices(double &lat, double &lon) {
  if (useGpsIfActive) {
    unsigned long nowMs = millis();
    if (gpsLocationValid && isGpsFixActive(nowMs)) {
      lat = gpsLatitude;
      lon = gpsLongitude;
      return true;
    }
  }

  if (userLatLonValid) {
    lat = userLat;
    lon = userLon;
    return true;
  }

  if (userLocator.length() >= 4) {
    locatorToLatLon(userLocator, lat, lon);
    return true;
  }

  return false;
}

static String formatGpsUtcForLog() {
  if (gpsUtcTime.length() < 6) {
    return "brak czasu";
  }

  String hhmmss = gpsUtcTime.substring(0, 2) + ":" + gpsUtcTime.substring(2, 4) + ":" + gpsUtcTime.substring(4, 6);
  if (gpsUtcDate.length() < 6) {
    return hhmmss + " UTC";
  }

  String dd = gpsUtcDate.substring(0, 2);
  String mm = gpsUtcDate.substring(2, 4);
  int yy = gpsUtcDate.substring(4, 6).toInt();
  int fullYear = (yy >= 80) ? (1900 + yy) : (2000 + yy);

  return String(fullYear) + "-" + mm + "-" + dd + " " + hhmmss + " UTC";
}

static bool isGpsUtcFieldSixDigits(const String &value) {
  if (value.length() < 6) {
    return false;
  }

  for (int i = 0; i < 6; i++) {
    if (!isdigit((unsigned char)value.charAt(i))) {
      return false;
    }
  }
  return true;
}

static bool isGpsTimeSourceActive(unsigned long nowMs) {
  if (!isUart2GpsParsingEnabled()) {
    return false;
  }
  if (!isGpsUartActive(nowMs) || !isGpsFixActive(nowMs)) {
    return false;
  }
  return isGpsUtcFieldSixDigits(gpsUtcTime) && isGpsUtcFieldSixDigits(gpsUtcDate);
}

static int64_t daysFromCivilUtc(int year, unsigned month, unsigned day) {
  year -= (month <= 2);
  const int era = (year >= 0 ? year : year - 399) / 400;
  const unsigned yoe = (unsigned)(year - era * 400);
  const unsigned doy = (153U * (month + (month > 2 ? -3 : 9)) + 2U) / 5U + day - 1U;
  const unsigned doe = yoe * 365U + yoe / 4U - yoe / 100U + doy;
  return (int64_t)era * 146097LL + (int64_t)doe - 719468LL;
}

static bool parseGpsUtcToUnix(time_t &outUtcSeconds) {
  if (!isGpsUtcFieldSixDigits(gpsUtcTime) || !isGpsUtcFieldSixDigits(gpsUtcDate)) {
    return false;
  }

  int day = gpsUtcDate.substring(0, 2).toInt();
  int month = gpsUtcDate.substring(2, 4).toInt();
  int yy = gpsUtcDate.substring(4, 6).toInt();
  int hour = gpsUtcTime.substring(0, 2).toInt();
  int minute = gpsUtcTime.substring(2, 4).toInt();
  int second = gpsUtcTime.substring(4, 6).toInt();

  if (day < 1 || day > 31 || month < 1 || month > 12) {
    return false;
  }
  if (hour < 0 || hour > 23 || minute < 0 || minute > 59 || second < 0 || second > 59) {
    return false;
  }

  int fullYear = (yy >= 80) ? (1900 + yy) : (2000 + yy);
  int64_t daysSinceEpoch = daysFromCivilUtc(fullYear, (unsigned)month, (unsigned)day);
  int64_t unixSeconds = daysSinceEpoch * 86400LL + (int64_t)hour * 3600LL + (int64_t)minute * 60LL + (int64_t)second;
  if (unixSeconds < 100000LL) {
    return false;
  }

  outUtcSeconds = (time_t)unixSeconds;
  return true;
}

static uint64_t makeGpsDateTimeToken() {
  uint64_t token = 0;
  for (int i = 0; i < 6; i++) {
    token = token * 10ULL + (uint64_t)(gpsUtcDate.charAt(i) - '0');
  }
  for (int i = 0; i < 6; i++) {
    token = token * 10ULL + (uint64_t)(gpsUtcTime.charAt(i) - '0');
  }
  return token;
}

static bool syncSystemTimeFromGps(unsigned long nowMs) {
  if (!isGpsTimeSourceActive(nowMs)) {
    return false;
  }

  static uint64_t lastSyncedToken = 0;
  uint64_t currentToken = makeGpsDateTimeToken();
  if (currentToken == lastSyncedToken) {
    return true;
  }

  time_t utcSeconds = 0;
  if (!parseGpsUtcToUnix(utcSeconds)) {
    return false;
  }

  struct timeval tv;
  tv.tv_sec = utcSeconds;
  tv.tv_usec = 0;
  if (settimeofday(&tv, nullptr) != 0) {
    return false;
  }

  lastSyncedToken = currentToken;
  return true;
}

static void logGpsStatusEvery5s(unsigned long nowMs) {
  if (!isUart2GpsParsingEnabled()) {
    return;
  }

  if (gpsLastStatusLogMs != 0 && (nowMs - gpsLastStatusLogMs) < GPS_STATUS_LOG_INTERVAL_MS) {
    return;
  }
  gpsLastStatusLogMs = nowMs;

  bool fix = isGpsFixActive(nowMs);
  String gpsUtc = formatGpsUtcForLog();
  String satsInViewText = (gpsSatellitesInView >= 0) ? String(gpsSatellitesInView) : String("--");
  String satsUsedText = (gpsSatellitesUsed >= 0) ? String(gpsSatellitesUsed) : String("--");

  if (fix && gpsLocationValid) {
    Serial.printf("[GPS] FIX=TAK SAT_VIEW=%s SAT_USED=%s LAT=%.6f LON=%.6f UTC=%s\n",
                  satsInViewText.c_str(),
                  satsUsedText.c_str(),
                  gpsLatitude,
                  gpsLongitude,
                  gpsUtc.c_str());
  } else {
    Serial.printf("[GPS] FIX=NIE SAT_VIEW=%s SAT_USED=%s UTC=%s\n",
                  satsInViewText.c_str(),
                  satsUsedText.c_str(),
                  gpsUtc.c_str());
  }
}

// ========== INICJALIZACJA TFT (ESP32-2432S028) ==========
#ifdef ENABLE_TFT_DISPLAY
void setupBacklightPwm() {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  // Arduino ESP32 core 3.x LEDC API
  ledcAttach(TFT_BL_PIN, BACKLIGHT_PWM_FREQ, BACKLIGHT_PWM_RES_BITS);
#else
  // Arduino ESP32 core 2.x LEDC API
  ledcSetup(BACKLIGHT_PWM_CHANNEL, BACKLIGHT_PWM_FREQ, BACKLIGHT_PWM_RES_BITS);
  ledcAttachPin(TFT_BL_PIN, BACKLIGHT_PWM_CHANNEL);
#endif
}

static void writeBacklightPwmPercent(int percent) {
  if (percent < MIN_BACKLIGHT_PERCENT) percent = MIN_BACKLIGHT_PERCENT;
  if (percent > 100) percent = 100;
  currentBacklightAppliedPercent = percent;
  uint32_t dutyMax = (1U << BACKLIGHT_PWM_RES_BITS) - 1U;
  uint32_t duty = (percent * dutyMax) / 100U;
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcWrite(TFT_BL_PIN, duty);
#else
  ledcWrite(BACKLIGHT_PWM_CHANNEL, duty);
#endif
}

static bool getWeatherIsNightFromIcon(bool &isNight) {
  String iconCodeLocal;
  bool weatherValidLocal = false;

  lockWeatherData();
  weatherValidLocal = weatherData.valid;
  iconCodeLocal = weatherData.iconCode;
  unlockWeatherData();

  iconCodeLocal.trim();
  iconCodeLocal.toLowerCase();
  if (!weatherValidLocal || iconCodeLocal.length() == 0) {
    return false;
  }
  if (iconCodeLocal.endsWith("n")) {
    isNight = true;
    return true;
  }
  if (iconCodeLocal.endsWith("d")) {
    isNight = false;
    return true;
  }
  return false;
}

static int getTargetBacklightPercentForCurrentDayNight() {
  int targetPercent = backlightPercent;
  if (targetPercent < MIN_BACKLIGHT_PERCENT) targetPercent = MIN_BACKLIGHT_PERCENT;
  if (targetPercent > 100) targetPercent = 100;

  bool isNight = false;
  bool hasWeatherDayNight = getWeatherIsNightFromIcon(isNight);
  if (!hasWeatherDayNight || !isNight || tftNightDimmingPercent <= 0) {
    return targetPercent;
  }

  int dimming = tftNightDimmingPercent;
  if (dimming < 0) dimming = 0;
  if (dimming > 100) dimming = 100;

