tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  int reducedPercent = (targetPercent * (100 - dimming)) / 100;
  if (reducedPercent < MIN_BACKLIGHT_PERCENT) reducedPercent = MIN_BACKLIGHT_PERCENT;
  if (reducedPercent > 100) reducedPercent = 100;
  return reducedPercent;
}

static void applyBacklightByDayNight(bool forceApply) {
  if (!tftInitialized || brightnessMenuActive) {
    return;
  }
  int targetPercent = getTargetBacklightPercentForCurrentDayNight();
  if (!forceApply && targetPercent == currentBacklightAppliedPercent) {
    return;
  }
  writeBacklightPwmPercent(targetPercent);
}

void setBacklightPercent(int percent) {
  if (percent < MIN_BACKLIGHT_PERCENT) percent = MIN_BACKLIGHT_PERCENT;
  if (percent > 100) percent = 100;
  backlightPercent = percent;
  int targetPercent = getTargetBacklightPercentForCurrentDayNight();
  writeBacklightPwmPercent(targetPercent);
}

void applyTouchRotation() {
  Serial.print("*** Applying touch.setRotation(");
  Serial.print(touchRotation);
  Serial.println(") ***");
  touch.setRotation(touchRotation);
}

void applyTftRotation() {
  Serial.print("*** Applying tft.setRotation(");
  Serial.print(tftRotation);
  Serial.println(") ***");
  tft.setRotation(tftRotation);
}

void applyTftInversion() {
  Serial.print("*** Applying tft.invertDisplay(");
  Serial.print(tftInvertColors ? "true" : "false");
  Serial.println(") ***");
  tft.invertDisplay(tftInvertColors);
}

void initTFT() {
  Serial.println("=== Inicjalizacja TFT ===");
  
  // Backlight włączany automatycznie przez tft.begin() (zgodnie z Setup801)
  // Nie trzeba ręcznie włączać backlight przed begin()
  Serial.println("TFT begin()...");
  tft.begin();
  Serial.println("TFT begin() OK");
  setupBacklightPwm();
  setBacklightPercent(backlightPercent);
  
  applyTftRotation();
  applyTftInversion();
  // Dla rotacji 1: szerokości 320, wysokości 240
  tft.fillScreen(TFT_WHITE);

  // Inicjalizacja dotyku (XPT2046, osobny SPI)
  touchSPI.begin(TOUCH_CLK, TOUCH_MISO, TOUCH_MOSI, TOUCH_CS);
  touch.begin(touchSPI);
  applyTouchRotation();
  
  tftInitialized = true;
  inMenu = false;
  menuOption = 0;
  
  Serial.println("=== TFT zainicjalizowany OK ===");
  
  // Wyświetl ekran startowy (boot log)
  drawBootScreen();
  tftBootPrintLine("=== Inicjalizacja TFT ===");
  tftBootPrintLine("TFT begin()...");
  tftBootPrintLine("TFT begin() OK");
  tftBootPrintLine("=== TFT zainicjalizowany OK ===");
}

void drawBootScreen() {
  if (!tftInitialized) {
    return;
  }
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_GREEN);
  tft.setTextSize(1);
  bootLogY = 2;
  tft.setCursor(2, bootLogY);
}

void tftBootPrintLine(const String &line) {
  if (!tftInitialized) {
    return;
  }
  tft.setTextColor(TFT_GREEN);
  tft.setTextSize(1);
  tft.setCursor(2, bootLogY);
  tft.print(line);
  bootLogY += BOOT_LOG_LINE_HEIGHT;
  if (bootLogY > 230) {
    tft.fillScreen(TFT_BLACK);
    bootLogY = 2;
  }
}

void drawWelcomeScreenYellow() {
  if (!tftInitialized) {
    return;
  }
  tft.fillScreen(TFT_BLACK);
  // Optional startup background from LittleFS (data/logo.bmp)
  drawBmpFromFS("/logo.bmp", 0, 0);
  tft.setTextSize(1);
  const int centerX = 160;
  const int startY = 40;
  const int lineGap = 16;
  String lines[] = {
    "ESP32-HAM-CLOCK",
    "version 1.3.0",
    "Created by SP3KON",
    "(AI-assisted)",
    "sp3kon@gmail.com",
    ""
  };
  for (int i = 0; i < 6; i++) {
    tft.setTextColor(TFT_YELLOW, TFT_BLACK);
    tft.setCursor(5, startY + i * lineGap);
    tft.print(lines[i]);
  }
}

void drawWelcomeScreenGreen() {
  if (!tftInitialized) {
    return;
  }
  tft.setTextColor(TFT_GREEN);
  tft.setTextSize(1);
  const int centerX = 160;
  const int startY = 40;
  const int lineGap = 16;
  tft.setTextSize(2);
  String line = "FOLLOW THE PROPAGATION...";
  int textWidth = line.length() * 12;
  int x = centerX - (textWidth / 2);
  tft.setCursor(x, startY + 6 * lineGap + 25);
  tft.print(line);
}

// Aktualizuj wyĹ›wietlacz z aktualnym adresem IP
void updateTFT_IP() {
  if (!tftInitialized) {
    return;
  }
  
  IPAddress ip;
  String modeStr = "";
  
  // SprawdĹş czy jesteĹ›my w trybie STA czy AP
  if (wifiConnected && WiFi.status() == WL_CONNECTED) {
    ip = WiFi.localIP();
    modeStr = "WiFi";
  } else if (WiFi.getMode() & WIFI_AP) {
    ip = WiFi.softAPIP();
    modeStr = "AP Mode";
  } else {
    // Brak IP - wyświetl komunikat
    tft.fillRect(10, 40, 300, 20, TFT_WHITE);
    tft.setTextColor(TFT_RED, TFT_WHITE);
    tft.setTextSize(1);
    tft.setCursor(10, 45);
    tft.print("No connection");
    return;
  }
  
  // WyczyĹ›Ä‡ obszar IP (dla rotacji 1: szerokoĹ›Ä‡ 320)
  tft.fillRect(10, 40, 300, 20, TFT_BLACK);
  
  // WyĹ›wietl tryb i IP w jednej linii (oszczędność miejsca)
    tft.setTextColor(TFT_BLACK, TFT_WHITE);
  tft.setTextSize(1);
  tft.setCursor(10, 45);
  tft.print(modeStr);
  tft.print(": ");
  
  // Wyświetl IP
  tft.setTextColor(TFT_GREEN, TFT_BLACK);
  tft.print(ip.toString());
}

// Aktualizuj wyĹ›wietlacz z tabelą spotów (podobnie jak na stronie WWW)
void updateTFT_Spots() {
  static unsigned long lastTFTPrint = 0;
  static int tftCallCount = 0;
  tftCallCount++;
  
  if (!tftInitialized) {
    return;
  }
  
  // Print co 10 wywołań (dla debugowania)
  unsigned long now = millis();
  if (now - lastTFTPrint > 10000) { // Co 10 sekund
    Serial.print("[TFT] updateTFT_Spots wywoĹ‚ane ");
    Serial.print(tftCallCount);
    Serial.print(" razy, spotCount=");
    Serial.println(spotCount);
    lastTFTPrint = now;
    tftCallCount = 0;
  }
  
  // WyczyĹ›Ä‡ obszar tabeli (zostaw nagĹ‚Ăłwek i IP)
  // Dla rotacji 1 (krajobraz): szerokoĹ›Ä‡ 320, wysokoĹ›Ä‡ 240
  // Zostaw miejsce na nagĹ‚Ăłwek (0-45) i tabelÄ™ (65-240)
    tft.fillRect(0, 65, 320, 175, TFT_WHITE);
  
  // WyĹ›wietl nagĹ‚Ăłwek tabeli
    tft.setTextColor(TFT_BLACK, TFT_WHITE);
  tft.setTextSize(1);
  
  // Nagłówki kolumn (dla szerokoĹ›ci 320px)
  int yPos = 65;
  tft.setCursor(5, yPos);
  tft.print(tr(TR_TIME_SHORT));
  tft.setCursor(55, yPos);
  tft.print(tr(TR_CALL_SHORT));
  tft.setCursor(130, yPos);
  tft.print("MHz");
  tft.setCursor(200, yPos);
  tft.print("Mode");
  tft.setCursor(260, yPos);
  tft.print("km");
  
  yPos += 15;
  
  // Wyświetl maksymalnie 10 spotĂłw na wyĹ›wietlaczu TFT (ĹĽeby zmieścić się na ekranie)
  int maxDisplaySpots = min(spotCount, 10);
  
