tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  for (int i = 0; i < maxDisplaySpots; i++) {
    if (yPos >= 230) break; // Nie wchodź poza ekran
    
    tft.setTextColor(TFT_BLACK, TFT_WHITE);
    tft.setTextSize(1);
    
    // Czas
    tft.setCursor(5, yPos);
    String timeStr = spots[i].time;
    if (timeStr.length() > 5) timeStr = timeStr.substring(0, 5);
    tft.print(timeStr);
    
    // Znak wywoĹ‚awczy
    tft.setCursor(55, yPos);
    String callStr = spots[i].callsign;
    if (callStr.length() > 10) callStr = callStr.substring(0, 10);
    tft.print(callStr);
    
    // CzÄ™stotliwoĹ›Ä‡ (w MHz)
    tft.setCursor(130, yPos);
    float freqMHz = spots[i].frequency / 1000.0;
    tft.print(freqMHz, 3);
    
    // Mode
    tft.setCursor(200, yPos);
    String modeStr = spots[i].mode;
    if (modeStr.length() > 4) modeStr = modeStr.substring(0, 4);
    tft.print(modeStr);
    
    // OdlegĹ‚oĹ›Ä‡
    tft.setCursor(260, yPos);
    tft.print(formatDistanceOrCountry(spots[i], 6));
    
    yPos += 18; // OdstÄ™p miÄ™dzy wierszami
  }
  
  // Jeśli brak spotów, wyĹ›wietl komunikat
  if (spotCount == 0) {
    tft.setTextColor(TFT_RED, TFT_WHITE);
    tft.setTextSize(1);
    tft.setCursor(10, 90);
    tft.println(tr(TR_WAITING_SPOTS));
  }
}

// ========== SYSTEM MENU I EKRANĂ“W ==========

extern TaskHandle_t uiTaskHandle;
static void requestUiScreenRedraw(uint8_t pendingScreenId);
void drawLokalizacja();

// GĹ‚Ăłwna funkcja rysujÄ…ca ekrany
void drawScreen(ScreenType screenNum) {
  if (!tftInitialized) {
    return;
  }

  if (uiTaskHandle != nullptr && xTaskGetCurrentTaskHandle() != uiTaskHandle) {
    requestUiScreenRedraw((uint8_t)screenNum);
    return;
  }

  static ScreenType lastDrawnScreen = SCREEN_OFF;
  if (screenNum != lastDrawnScreen) {
    if (isTableFooterScreen(screenNum)) {
      tableNavFooterVisibleUntilMs = millis() + TABLE_NAV_FOOTER_VISIBLE_MS;
    }
    if (screenNum == SCREEN_APRS_RADAR) {
      // On first enter to radar screen, show zoom/info hints for a short time.
      screen6RadarHintUntilMs = millis() + SCREEN6_RADAR_HINT_DURATION_MS;
    }
    lastDrawnScreen = screenNum;
  }

  if (aprsAlertScreenActive) {
    return;
  }
  
  if (screenNum == SCREEN_MATRIX_CLOCK || screenNum == SCREEN_UNLIS_HUNTER) {
    tft.fillScreen(TFT_BLACK);
  } else {
    tft.fillScreen(tftUiPalette.bg);
  }
  
  switch (screenNum) {
    case SCREEN_HAM_CLOCK:
      drawHamClock();
      break;
    case SCREEN_DX_CLUSTER:
      drawDxCluster();
      break;
    case SCREEN_SUN_SPOTS:
      drawSunSpots();
      break;
    case SCREEN_BAND_INFO:
      drawBandInfo();
      break;
    case SCREEN_WEATHER_DSP:
      drawWeather();
      break;
    case SCREEN_WEATHER_FORECAST:
      drawWeatherForecast();
      break;
    case SCREEN_LOKALIZACJA:
      drawLokalizacja();
      break;
    case SCREEN_APRS_IS:
      drawAprsIs();
      break;
    case SCREEN_APRS_RADAR:
      drawAprsRadar();
      break;
    case SCREEN_POTA_CLUSTER:
      drawPotaCluster();
      break;
    case SCREEN_HAMALERT_CLUSTER:
      drawHamalertCluster();
      break;
    case SCREEN_MATRIX_CLOCK:
      drawMatrixClock();
      break;
    case SCREEN_UNLIS_HUNTER:
      drawUnlisHunter();
      break;
    case SCREEN_OFF:
    default:
      drawHamClock();
      break;
  }
}

static void drawLokalizacjaValueField(int x, int y, int width, uint16_t color, const String &value) {
  uint16_t bgColor = isTftStyleLight() ? TFT_WHITE : TFT_BLACK;
  tft.fillRect(x, y - 2, width, 20, bgColor);
  tft.setTextColor(color);
  tft.setCursor(x, y);
  tft.print(value);
}

static const int LOK_SAVE_BTN_X = 246;
static const int LOK_SAVE_BTN_Y = 6;
static const int LOK_SAVE_BTN_W = 68;
static const int LOK_SAVE_BTN_H = 24;

static bool isLokalizacjaSaveButtonHit(uint16_t x, uint16_t y) {
  const int hitPaddingX = 10;
  const int hitPaddingY = 10;
  const int hitX = max(0, LOK_SAVE_BTN_X - hitPaddingX);
  const int hitY = max(0, LOK_SAVE_BTN_Y - hitPaddingY);
  const int hitW = min(320 - hitX, LOK_SAVE_BTN_W + 2 * hitPaddingX);
  const int hitH = min(240 - hitY, LOK_SAVE_BTN_H + 2 * hitPaddingY);
  return isPointInRect(x, y, hitX, hitY, hitW, hitH);
}

static void drawLokalizacjaSaveButton() {
  bool isEn = (tftLanguage == TFT_LANG_EN);
  const char *btnLabel = isEn ? "SAVE" : "ZAPISZ";
  uint16_t btnFill = TFT_WHITE;
  uint16_t btnBorder = TFT_BLACK;
  uint16_t btnText = TFT_BLACK;
  int textW = strlen(btnLabel) * 6;

  tft.fillRoundRect(LOK_SAVE_BTN_X, LOK_SAVE_BTN_Y, LOK_SAVE_BTN_W, LOK_SAVE_BTN_H, 4, btnFill);
  tft.drawRoundRect(LOK_SAVE_BTN_X, LOK_SAVE_BTN_Y, LOK_SAVE_BTN_W, LOK_SAVE_BTN_H, 4, btnBorder);
  tft.setTextSize(1);
  tft.setTextColor(btnText);
  tft.setCursor(LOK_SAVE_BTN_X + (LOK_SAVE_BTN_W - textW) / 2, LOK_SAVE_BTN_Y + 8);
  tft.print(btnLabel);
}

static String latLonToMaidenhead6(double lat, double lon) {
  if (lat < -90.0 || lat > 90.0 || lon < -180.0 || lon > 180.0) {
    return "--";
  }

  if (lat >= 90.0) lat = 89.999999;
  if (lon >= 180.0) lon = 179.999999;

  double lonAdj = lon + 180.0;
  double latAdj = lat + 90.0;

  int fieldLon = (int)(lonAdj / 20.0);
  int fieldLat = (int)(latAdj / 10.0);
  if (fieldLon < 0 || fieldLon > 17 || fieldLat < 0 || fieldLat > 17) {
    return "--";
  }

  double lonAfterField = lonAdj - (fieldLon * 20.0);
  double latAfterField = latAdj - (fieldLat * 10.0);

  int squareLon = (int)(lonAfterField / 2.0);
  int squareLat = (int)(latAfterField / 1.0);
  if (squareLon < 0) squareLon = 0;
  if (squareLon > 9) squareLon = 9;
  if (squareLat < 0) squareLat = 0;
  if (squareLat > 9) squareLat = 9;

  double lonAfterSquare = lonAfterField - (squareLon * 2.0);
  double latAfterSquare = latAfterField - (squareLat * 1.0);

  int subLon = (int)(lonAfterSquare * 12.0);
  int subLat = (int)(latAfterSquare * 24.0);
  if (subLon < 0) subLon = 0;
  if (subLon > 23) subLon = 23;
  if (subLat < 0) subLat = 0;
  if (subLat > 23) subLat = 23;

  String locator = "";
  locator += (char)('A' + fieldLon);
  locator += (char)('A' + fieldLat);
  locator += (char)('0' + squareLon);
  locator += (char)('0' + squareLat);
  locator += (char)('A' + subLon);
  locator += (char)('A' + subLat);
  return locator;
}

static void updateLokalizacjaFields() {
  unsigned long nowMs = millis();
  bool gpsActive = isGpsUartActive(nowMs);
  bool gpsFix = isGpsFixActive(nowMs);
  bool isEn = (tftLanguage == TFT_LANG_EN);
  bool lightTheme = isTftStyleLight();
  uint16_t bgColor = lightTheme ? TFT_WHITE : TFT_BLACK;

