tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  String gpsText = gpsActive ? (isEn ? "ACTIVE" : "aktywny") : (isEn ? "INACTIVE" : "nieaktywny");
  String fixText = gpsFix ? (isEn ? "YES" : "TAK") : (isEn ? "NO" : "NIE");
  String satsInView = (gpsSatellitesInView >= 0) ? String(gpsSatellitesInView) : String("--");
  String latText = gpsLocationValid ? String(gpsLatitude, 6) : String("--");
  String lonText = gpsLocationValid ? String(gpsLongitude, 6) : String("--");
  String speedText = (gpsSpeedKmh >= 0.0f) ? (String(gpsSpeedKmh, 1) + " km/h") : String("--");
  String locatorText = gpsLocationValid ? latLonToMaidenhead6(gpsLatitude, gpsLongitude) : String("--");

  uint16_t gpsLabelColor = lightTheme ? TFT_BLACK : TFT_WHITE;
  uint16_t gpsValueColor = lightTheme ? TFT_BLACK : (gpsActive ? TFT_GREEN : TFT_RED);
  uint16_t fixValueColor = lightTheme ? TFT_BLACK : (gpsFix ? TFT_GREEN : TFT_RED);
  uint16_t satsColor = lightTheme ? TFT_BLACK : TFT_CYAN;
  uint16_t latColor = lightTheme ? TFT_BLACK : TFT_YELLOW;
  uint16_t lonColor = lightTheme ? TFT_BLACK : TFT_YELLOW;
  uint16_t speedColor = lightTheme ? TFT_BLACK : TFT_CYAN;
  uint16_t locatorColor = lightTheme ? TFT_BLACK : TFT_CYAN;

  tft.setTextSize(2);
  tft.fillRect(20, 60, 290, 20, bgColor);
  tft.setCursor(20, 62);
  tft.setTextColor(gpsLabelColor);
  tft.print("GPS: ");
  tft.setTextColor(gpsValueColor);
  tft.print(gpsText);
  tft.setTextColor(gpsLabelColor);
  tft.print(" FIX: ");
  tft.setTextColor(fixValueColor);
  tft.print(fixText);
  drawLokalizacjaValueField(130, 88, 170, satsColor, satsInView);
  drawLokalizacjaValueField(130, 114, 170, latColor, latText);
  drawLokalizacjaValueField(130, 140, 170, lonColor, lonText);
  drawLokalizacjaValueField(130, 166, 170, speedColor, speedText);
  drawLokalizacjaValueField(130, 192, 170, locatorColor, locatorText);
}

void drawLokalizacja() {

  bool isEn = (tftLanguage == TFT_LANG_EN);
  bool lightTheme = isTftStyleLight();
  uint16_t pageBgColor = lightTheme ? TFT_WHITE : TFT_BLACK;
  uint16_t labelColor = lightTheme ? TFT_BLACK : TFT_WHITE;
  uint16_t frameOuterColor = TFT_DARKGREY;
  uint16_t frameMidColor = lightTheme ? TFT_BLACK : TFT_LIGHTGREY;
  uint16_t frameInnerColor = lightTheme ? TFT_BLACK : TFT_WHITE;

  tft.fillScreen(pageBgColor);
  tft.fillRect(0, 0, 320, 40, menuThemeColor);
  tft.drawFastHLine(0, 39, 320, 0x8410);

  const String headerText = isEn ? "LOCATION" : "LOKALIZACJA";
  int headerX = (320 - ((int)headerText.length() * 12)) / 2;
  if (headerX < 6) {
    headerX = 6;
  }
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(headerX, 12);
  tft.print(headerText);
  tft.setCursor(headerX + 1, 12);
  tft.print(headerText);
  drawLokalizacjaSaveButton();

  const int frameX = 10;
  const int frameY = 50;
  const int frameW = 300;
  const int frameH = 170;
  const int frameR = 8;
  tft.drawRoundRect(frameX - 2, frameY - 2, frameW + 4, frameH + 4, frameR + 2, frameOuterColor);
  tft.drawRoundRect(frameX - 1, frameY - 1, frameW + 2, frameH + 2, frameR + 1, frameMidColor);
  tft.drawRoundRect(frameX, frameY, frameW, frameH, frameR, frameInnerColor);

  tft.setTextSize(2);
  tft.setTextColor(labelColor);

  int y = 88;
  const int rowH = 26;
  tft.setTextColor(labelColor);
  tft.setCursor(20, y);
  tft.print(isEn ? "SATS:" : "Satelity:");

  y += rowH;
  tft.setTextColor(labelColor);
  tft.setCursor(20, y);
  tft.print("LAT:");

  y += rowH;
  tft.setTextColor(labelColor);
  tft.setCursor(20, y);
  tft.print("LON:");

  y += rowH;
  tft.setTextColor(labelColor);
  tft.setCursor(20, y);
  tft.print(isEn ? "SPEED:" : "Predkosc:");

  y += rowH;
  tft.setTextColor(labelColor);
  tft.setCursor(20, y);
  tft.print(isEn ? "LOCATOR:" : "Lokator:");

  updateLokalizacjaFields();
  drawSwitchScreenFooter();
}

// Ekran 1: Startowy - Info
uint16_t rgb565(uint8_t r, uint8_t g, uint8_t b) {
  return (uint16_t)(((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3));
}

uint16_t colorWheel(uint8_t pos) {
  pos = 255 - pos;
  if (pos < 85) {
    return rgb565(255 - pos * 3, 0, pos * 3);
  }
  if (pos < 170) {
    pos -= 85;
    return rgb565(0, pos * 3, 255 - pos * 3);
  }
  pos -= 170;
  return rgb565(pos * 3, 255 - pos * 3, 0);
}

void applyMenuThemeFromHue() {
  menuThemeColor = colorWheel(menuThemeHue);
  applyTftUiPalette();
}

// Definicja koloru "Radio Orange" - dynamiczny motyw
#define TFT_RADIO_ORANGE menuThemeColor

// Kolory i tĹ‚o "Matrix" dla ekranu 10
#define MATRIX_DARKGREEN 0x0320
#define MATRIX_BRIGHTGREEN 0x07E0
#define MATRIX_WHITEGREEN 0xAFE5

uint16_t lerpColor565(uint16_t from, uint16_t to, uint8_t t) {
  uint8_t r1 = (from >> 11) & 0x1F;
  uint8_t g1 = (from >> 5) & 0x3F;
  uint8_t b1 = from & 0x1F;
  uint8_t r2 = (to >> 11) & 0x1F;
  uint8_t g2 = (to >> 5) & 0x3F;
  uint8_t b2 = to & 0x1F;
  uint8_t r = r1 + ((r2 - r1) * t) / 255;
  uint8_t g = g1 + ((g2 - g1) * t) / 255;
  uint8_t b = b1 + ((b2 - b1) * t) / 255;
  return (r << 11) | (g << 5) | b;
}

struct MatrixDrop {
  int x;
  int y;
  int speed;
  int len;
  char headChar;
  bool introParticipates;
  int introStartY;
  int introDelayMs;
  float introSpeedPxPerMs;
  bool introActive;
};

const int SCREEN10_WIDTH = 320;
const int MATRIX_COL_SPACING = 7;
const int numDrops = SCREEN10_WIDTH / MATRIX_COL_SPACING; // Tyle kolumn, ile się mieści
const char MATRIX_HEAD_TEXT[] = "ESP32   HAM   CLOCK   by   SP3KON";
const int MATRIX_HEAD_TEXT_LEN = (int)(sizeof(MATRIX_HEAD_TEXT) - 1);
MatrixDrop drops[numDrops];
bool matrixInitialized = false;

static inline char getMatrixHeadCharForColumn(int columnIdx) {
  if (MATRIX_HEAD_TEXT_LEN <= 0) {
    return ' ';
  }
  if (numDrops <= MATRIX_HEAD_TEXT_LEN) {
    return MATRIX_HEAD_TEXT[columnIdx];
  }

  const int freeCols = numDrops - MATRIX_HEAD_TEXT_LEN;
  const int leftPad = freeCols / 2;
  const int rightStart = leftPad + MATRIX_HEAD_TEXT_LEN;

  if (columnIdx < leftPad || columnIdx >= rightStart) {
    return ' ';
  }

  return MATRIX_HEAD_TEXT[columnIdx - leftPad];
}

const int SCREEN10_HEADER_H = 0;
const int SCREEN10_BODY_TOP = SCREEN10_HEADER_H;
const int SCREEN10_BODY_BOTTOM = 240;
const int SCREEN10_BODY_H = SCREEN10_BODY_BOTTOM - SCREEN10_BODY_TOP;
const int CLOCK_TEXT_SIZE = 6;
const int CLOCK_CHAR_W = 6;
const int CLOCK_CHAR_H = 8;
const unsigned long MATRIX_UPDATE_INTERVAL_MS = 120;
const unsigned long MATRIX_INTRO_ALIGN_MS = 3400UL;

unsigned long lastScreen10UpdateMs = 0;
unsigned long lastMatrixUpdateMs = 0;
bool screen10NeedsRedraw = true;
bool matrixIntroActive = false;
unsigned long matrixIntroStartMs = 0;
int clockMaskX = 0;
int clockMaskY = 0;
int clockMaskW = 0;
int clockMaskH = 0;
String lastClockText = "";
bool clockNeedsRedraw = true;

static void resetMatrixDropRandom(int i) {
  drops[i].y = random(-SCREEN10_BODY_H, 0);
  drops[i].speed = random(5, 15);
  drops[i].len = random(4, 17);
  drops[i].headChar = (char)random(33, 126);
  drops[i].introActive = false;
}

static void prepareMatrixIntro() {
  const int charStep = 8;
  const int alignHeadY = SCREEN10_BODY_TOP + (SCREEN10_BODY_H / 2);

