tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  for (int i = 0; i < numDrops; i++) {
    drops[i].headChar = getMatrixHeadCharForColumn(i);
    drops[i].introParticipates = (drops[i].headChar != ' ');
    drops[i].introStartY = random(-140, -40);
    drops[i].introDelayMs = random(0, 1900);
    drops[i].introActive = drops[i].introParticipates;

    int targetDropY = (alignHeadY - SCREEN10_BODY_TOP) - ((drops[i].len - 1) * charStep);
    int travelMs = (int)MATRIX_INTRO_ALIGN_MS - drops[i].introDelayMs;
    if (travelMs < 250) {
      travelMs = 250;
    }

    drops[i].introSpeedPxPerMs = (float)(targetDropY - drops[i].introStartY) / (float)travelMs;
    if (drops[i].introSpeedPxPerMs < 0.03f) {
      drops[i].introSpeedPxPerMs = 0.03f;
    }
  }

  matrixIntroActive = true;
  matrixIntroStartMs = millis();
}

String getUtcTimeString() {
  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuffer[9];
    strftime(timeBuffer, 9, "%H:%M:%S", &timeinfo);
    return String(timeBuffer);
  }
  return "--:--:--";
}

bool getTimeWithTimezone(struct tm *outTm) {
  time_t now = time(nullptr);
  if (now < 100000) {
    return false;
  }
  now += (time_t)(timezoneHours * 3600.0f);
  gmtime_r(&now, outTm);
  return true;
}

String getTimezoneTimeString(const char *fmt, size_t bufSize) {
  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return "--:--";
  }
  char timeBuffer[16];
  strftime(timeBuffer, bufSize, fmt, &timeinfo);
  return String(timeBuffer);
}

String formatAprsTimeWithTimezone(String timeStr) {
  if (timeStr.endsWith("Z")) {
    timeStr.remove(timeStr.length() - 1);
  }
  if (timeStr.length() < 4) {
    return timeStr;
  }
  int hour = timeStr.substring(0, 2).toInt();
  int minute = timeStr.substring(2, 4).toInt();
  int hourLocal = hour + (int)timezoneHours;
  while (hourLocal < 0) hourLocal += 24;
  while (hourLocal >= 24) hourLocal -= 24;
  String hh = (hourLocal < 10 ? "0" : "") + String(hourLocal);
  String mm = (minute < 10 ? "0" : "") + String(minute);
  return hh + ":" + mm;
}

String sanitizePolishToAscii(const String &input) {
  String out;
  out.reserve(input.length());
  const char *s = input.c_str();
  size_t len = input.length();
  for (size_t i = 0; i < len; i++) {
    uint8_t c = (uint8_t)s[i];
    if (c < 0x80) {
      out += (char)c;
      continue;
    }
    if (i + 1 >= len) {
      continue;
    }
    uint8_t c2 = (uint8_t)s[i + 1];
    // UTF-8 Polish letters
    if (c == 0xC4 && c2 == 0x84) { out += 'a'; i++; continue; } // Ą
    if (c == 0xC4 && c2 == 0x85) { out += 'a'; i++; continue; } // ą
    if (c == 0xC4 && c2 == 0x86) { out += 'c'; i++; continue; } // Ć
    if (c == 0xC4 && c2 == 0x87) { out += 'c'; i++; continue; } // ć
    if (c == 0xC4 && c2 == 0x98) { out += 'e'; i++; continue; } // Ę
    if (c == 0xC4 && c2 == 0x99) { out += 'e'; i++; continue; } // ę
    if (c == 0xC5 && c2 == 0x81) { out += 'l'; i++; continue; } // Ł
    if (c == 0xC5 && c2 == 0x82) { out += 'l'; i++; continue; } // ł
    if (c == 0xC5 && c2 == 0x83) { out += 'n'; i++; continue; } // Ń
    if (c == 0xC5 && c2 == 0x84) { out += 'n'; i++; continue; } // ń
    if (c == 0xC3 && c2 == 0x93) { out += 'o'; i++; continue; } // Ó
    if (c == 0xC3 && c2 == 0xB3) { out += 'o'; i++; continue; } // ó
    if (c == 0xC5 && c2 == 0x9A) { out += 'S'; i++; continue; } // Ś
    if (c == 0xC5 && c2 == 0x9B) { out += 's'; i++; continue; } // ś
    if (c == 0xC5 && c2 == 0xB9) { out += 'z'; i++; continue; } // Ź
    if (c == 0xC5 && c2 == 0xBA) { out += 'z'; i++; continue; } // ź
    if (c == 0xC5 && c2 == 0xBB) { out += 'z'; i++; continue; } // Ż
    if (c == 0xC5 && c2 == 0xBC) { out += 'z'; i++; continue; } // ż
    // Unknown multibyte - skip
  }
  return out;
}

static inline const char* utf8LiteralToChar(const char *s) {
  return s;
}

#if defined(__cpp_char8_t)
static inline const char* utf8LiteralToChar(const char8_t *s) {
  return reinterpret_cast<const char*>(s);
}
#endif

String getPolishDateStringFull() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return "Brak daty";
  }

  #if defined(__cpp_char8_t)
  static const char8_t* const weekdaysFull[] = {
    u8"Niedziela", u8"Poniedzia\u0142ek", u8"Wtorek",
    u8"\u015Aroda", u8"Czwartek", u8"Pi\u0105tek", u8"Sobota"
  };
  static const char8_t* const monthsFull[] = {
    u8"stycznia", u8"lutego", u8"marca", u8"kwietnia",
    u8"maja", u8"czerwca", u8"lipca", u8"sierpnia",
    u8"wrze\u015Bnia", u8"pa\u017Adziernika", u8"listopada", u8"grudnia"
  };
  #else
  static const char* const weekdaysFull[] = {
    u8"Niedziela", u8"Poniedzia\u0142ek", u8"Wtorek",
    u8"\u015Aroda", u8"Czwartek", u8"Pi\u0105tek", u8"Sobota"
  };
  static const char* const monthsFull[] = {
    u8"stycznia", u8"lutego", u8"marca", u8"kwietnia",
    u8"maja", u8"czerwca", u8"lipca", u8"sierpnia",
    u8"wrze\u015Bnia", u8"pa\u017Adziernika", u8"listopada", u8"grudnia"
  };
  #endif

  String dateBuf = String(timeinfo.tm_mday < 10 ? "0" : "") + String(timeinfo.tm_mday) +
                   "." +
                   String((timeinfo.tm_mon + 1) < 10 ? "0" : "") + String(timeinfo.tm_mon + 1) +
                   "." + String(1900 + timeinfo.tm_year);

  String full = String(utf8LiteralToChar(weekdaysFull[timeinfo.tm_wday])) + " " + dateBuf;
  return full;
}

String getEnglishDateStringFull() {
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return "No date";
  }

  static const char* weekdaysFullEn[] = {
    "Sunday", "Monday", "Tuesday", "Wednesday",
    "Thursday", "Friday", "Saturday"
  };

  String dateBuf = String(timeinfo.tm_mday < 10 ? "0" : "") + String(timeinfo.tm_mday) +
                   "." +
                   String((timeinfo.tm_mon + 1) < 10 ? "0" : "") + String(timeinfo.tm_mon + 1) +
                   "." + String(1900 + timeinfo.tm_year);

  String full = String(weekdaysFullEn[timeinfo.tm_wday]) + " " + dateBuf;
  return full;
}

String getPolishDateStringFullWithTimezone() {
  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return "Brak daty";
  }

  #if defined(__cpp_char8_t)
  static const char8_t* const weekdaysFull[] = {
    u8"Niedziela", u8"Poniedzia\u0142ek", u8"Wtorek",
    u8"\u015Aroda", u8"Czwartek", u8"Pi\u0105tek", u8"Sobota"
  };
  #else
  static const char* const weekdaysFull[] = {
    u8"Niedziela", u8"Poniedzia\u0142ek", u8"Wtorek",
    u8"\u015Aroda", u8"Czwartek", u8"Pi\u0105tek", u8"Sobota"
  };
  #endif

  String dateBuf = String(timeinfo.tm_mday < 10 ? "0" : "") + String(timeinfo.tm_mday) +
                   "." +
                   String((timeinfo.tm_mon + 1) < 10 ? "0" : "") + String(timeinfo.tm_mon + 1) +
                   "." + String(1900 + timeinfo.tm_year);

  String full = String(utf8LiteralToChar(weekdaysFull[timeinfo.tm_wday])) + " " + dateBuf;
  return full;
}

String getEnglishDateStringFullWithTimezone() {
  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return "No date";
  }

  static const char* weekdaysFullEn[] = {
    "Sunday", "Monday", "Tuesday", "Wednesday",
    "Thursday", "Friday", "Saturday"
  };

  String dateBuf = String(timeinfo.tm_mday < 10 ? "0" : "") + String(timeinfo.tm_mday) +
                   "." +
                   String((timeinfo.tm_mon + 1) < 10 ? "0" : "") + String(timeinfo.tm_mon + 1) +
                   "." + String(1900 + timeinfo.tm_year);

  String full = String(weekdaysFullEn[timeinfo.tm_wday]) + " " + dateBuf;
  return full;
}

// Rysuje linię daty/tygodnia wyśrodkowaną z użyciem polskiej czcionki VLW (jeśli dostępna)
void drawDateLine(const String &dateText) {
  const int frameX = 10;
  const int frameWidth = 300;
  const int frameY = 50;
  const int frameHeight = 155;
  const int dateY = 178;

  bool fontLoaded = false;
  int textW = 0;
  int textH = 0;

  if (tryLoadSmoothFont(ROBOTO_FONT20_NAME, ROBOTO_FONT20_FILE)) {
    fontLoaded = true;
    textW = tft.textWidth(dateText);
    textH = tft.fontHeight();
    // Jeśli linia jest zbyt szeroka, wróć do mniejszej czcionki systemowej
    if (textW > (frameWidth - 10)) {
      tft.unloadFont();
      fontLoaded = false;
    }
  }

  if (!fontLoaded) {
    tft.setTextSize(2);
    textW = dateText.length() * 12;
    textH = 16;
  }

  int dateX = frameX + (frameWidth - textW) / 2;
  if (dateX < frameX + 5) {
    dateX = frameX + 5;
  }

  // Czyści stały obszar: pełna szerokość między ramkami i wysokość
  // od strefy pod napisem Local/UTC do dolnej ramki.
  const int cleanX = frameX + 5;
  const int cleanW = frameWidth - 10;
  const int cleanY = 173;
  const int cleanBottom = (frameY + frameHeight) - 5;
  const int cleanH = cleanBottom - cleanY;

