tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  const bool lightTheme = isTftStyleLight();
  const uint16_t dateBg = lightTheme ? TFT_WHITE : TFT_BLACK;
  const uint16_t dateFg = lightTheme ? TFT_BLACK : TFT_WHITE;
  tft.fillRect(cleanX, cleanY, cleanW, cleanH, dateBg);
  tft.setTextColor(dateFg);

  if (fontLoaded) {
    tft.setTextDatum(TL_DATUM);
    tft.drawString(dateText, dateX, dateY);
    tft.unloadFont();
  } else {
    tft.setCursor(dateX, dateY);
    tft.print(sanitizePolishToAscii(dateText));
  }
}

void updateScreen1Header() {
  if (!tftInitialized || currentScreen != SCREEN_HAM_CLOCK || inMenu) {
    return;
  }

  if (!screen1HeaderNeedsRedraw) {
    return;
  }

  const int headerY = 0;
  const int headerH = 40;
  const uint16_t headerBg = TFT_RADIO_ORANGE;
  const uint16_t headerText = TFT_BLACK;
  const uint16_t logoBlockBg = TFT_BLACK;
  const uint16_t logoBlockText = TFT_RADIO_ORANGE;
  const uint16_t lineColor = 0x8410;
  
  // 1. TĹO I RAMKA LOGO
  tft.fillRect(0, headerY, 320, headerH, headerBg);
  // Ciemniejsza krawÄ™dĹş na dole dla efektu 3D
  tft.drawFastHLine(0, headerH - 1, 320, lineColor); 

  // 2. FORMATOWANIE "LOGO"
  
  int startX = 25; // OdstÄ™p od lewej (miejsce na ikonÄ™ menu)
  int textY = 12;

  // CzÄ™Ĺ›Ä‡ 1: "ESP32" w czarnym prostokÄ…cie (negatyw)
  tft.fillRect(startX, textY - 4, 65, 22, logoBlockBg);
  tft.setTextColor(logoBlockText);
  tft.setTextSize(2);
  tft.setCursor(startX + 5, textY);
  tft.print("ESP32");

  // CzÄ™Ĺ›Ä‡ 2: "-HAM-" (standardowo)
  tft.setTextColor(headerText);
  tft.setCursor(startX + 75, textY);
  tft.print("-HAM-");

  // Część 3: "CLOCK" (pogrubione wizualnie przez podwĂłjny druk)
  int clockX = startX + 145;
  tft.setCursor(clockX, textY);
  tft.print("CLOCK");
  tft.setCursor(clockX + 1, textY); // Lekkie przesuniÄ™cie o 1px w bok daje efekt "Bold"
  tft.print("CLOCK");

  // 3. OZDOBNIK GRAFICZNY (Fale radiowe)
  for(int i = 0; i < 3; i++) {
    tft.drawCircle(300, 20, 4 + (i * 4), headerText);
  }

  screen1HeaderNeedsRedraw = false;
}

static const unsigned long SCREEN1_GPS_BADGE_INTERVAL_MS = 4000UL;
static const unsigned long SCREEN1_GPS_BADGE_VISIBLE_MS = 2000UL;

static void drawHamClockConnectionIndicator(bool connected, bool lightTheme) {
  const int indicatorCx = 50;
  const int indicatorCy = 222;
  const int indicatorMaxR = 12;
  const int indicatorClearPad = 2;
  const int indicatorClearX = indicatorCx - indicatorMaxR - indicatorClearPad;
  const int indicatorClearY = indicatorCy - indicatorMaxR - indicatorClearPad;
  const int indicatorClearW = 2 * (indicatorMaxR + indicatorClearPad);
  const int indicatorClearH = 2 * (indicatorMaxR + indicatorClearPad);

  tft.fillRect(indicatorClearX, indicatorClearY, indicatorClearW, indicatorClearH, lightTheme ? TFT_WHITE : TFT_BLACK);

  unsigned long nowMs = millis();
  bool gpsBadgeVisible = false;
  if (isUart2GpsParsingEnabled()) {
    bool gpsActive = isGpsUartActive(nowMs);
    bool gpsFix = isGpsFixActive(nowMs);
    gpsBadgeVisible = gpsActive && gpsFix && ((nowMs % SCREEN1_GPS_BADGE_INTERVAL_MS) < SCREEN1_GPS_BADGE_VISIBLE_MS);
  }

  if (!connected) {
    if (gpsBadgeVisible) {
      tft.fillCircle(indicatorCx, indicatorCy, indicatorMaxR, TFT_GREEN);
      tft.drawCircle(indicatorCx, indicatorCy, indicatorMaxR, lightTheme ? TFT_BLACK : TFT_WHITE);
      tft.setTextSize(1);
      tft.setTextColor(TFT_BLACK, TFT_GREEN);
      tft.setCursor(indicatorCx - 9, indicatorCy - 3);
      tft.print("GPS");
    } else {
      tft.fillCircle(indicatorCx, indicatorCy, 4, TFT_RED);
    }
    return;
  }

  if (gpsBadgeVisible) {
    tft.fillCircle(indicatorCx, indicatorCy, indicatorMaxR, TFT_GREEN);
    tft.drawCircle(indicatorCx, indicatorCy, indicatorMaxR, lightTheme ? TFT_BLACK : TFT_WHITE);
    tft.setTextSize(1);
    tft.setTextColor(TFT_BLACK, TFT_GREEN);
    tft.setCursor(indicatorCx - 9, indicatorCy - 3);
    tft.print("GPS");
  } else {
    tft.fillCircle(indicatorCx, indicatorCy, 4, TFT_GREEN);
  }
}

void drawHamClock() {
  const bool lightTheme = isTftStyleLight();
  const uint16_t bgColor = lightTheme ? TFT_WHITE : TFT_BLACK;
  const uint16_t fgColor = lightTheme ? TFT_BLACK : TFT_WHITE;
  const uint16_t frameColor = lightTheme ? TFT_BLACK : TFT_DARKGREY;
  const uint16_t accentColor = lightTheme ? TFT_BLACK : TFT_RADIO_ORANGE;
  const uint16_t ipColor = lightTheme ? TFT_BLACK : TFT_LIGHTGREY;
  // Ciemne tĹ‚o - profesjonalny wyglÄ…d i mniejsze zmÄ™czenie oczu
  tft.fillScreen(bgColor);
  screen1HeaderNeedsRedraw = true;
  
  // 1. NAGĹĂ“WEK - PomaraĹ„czowa belka
  updateScreen1Header();

  // 2. RAMKA GĹĂ“WNA
  tft.drawRoundRect(10, 50, 300, 155, 8, frameColor);

  // 3. CALLSIGN (sp3kon) - PrzesuniÄ™ty wyĹĽej
  tft.setTextColor(fgColor);
  tft.setTextSize(4);
  String callsign = (userCallsign.length() > 0) ? userCallsign : DEFAULT_CALLSIGN;
  callsign.toUpperCase();
  int callX = (320 - (callsign.length() * 24)) / 2; // Rozmiar 4 ma ok. 24px szerokoĹ›ci
  tft.setCursor(callX > 15 ? callX : 15, 65);
  tft.print(callsign);

  // Napis "OPERATOR STATION"
  tft.setTextSize(1);
  tft.setTextColor(accentColor);
  tft.setCursor(110, 105);
  tft.print("OPERATOR STATION");

  // 4. ZEGAR UTC - WielkoĹ›Ä‡ taka sama jak Callsign (TextSize 4)
  // Ograniczenie do obszaru ramki gĹ‚Ăłwnej (x=10, szerokoĹ›Ä‡=300)
  tft.setTextColor(fgColor);
  tft.setTextSize(4);
  String timeUTC = (screen1TimeMode == SCREEN1_TIME_LOCAL)
                     ? getTimezoneTimeString("%H:%M:%S", 9)
                     : getUtcTimeString();
  int frameX = 10;        // PoczÄ…tek ramki gĹ‚Ăłwnej
  int frameWidth = 300;   // SzerokoĹ›Ä‡ ramki gĹ‚Ăłwnej
  int timeWidth = timeUTC.length() * 24; // SzerokoĹ›Ä‡ tekstu zegara
  int timeX = frameX + (frameWidth - timeWidth) / 2; // WyĹ›rodkowanie w ramce
  // Ograniczenie do obszaru ramki (minimum frameX + margines)
  timeX = (timeX < frameX + 5) ? frameX + 5 : timeX;
  tft.setCursor(timeX, 125);
  tft.print(timeUTC);

  tft.setTextSize(1);
  const char *timeLabel = "UTC";
  if (screen1TimeMode == SCREEN1_TIME_LOCAL) {
    timeLabel = (tftLanguage == TFT_LANG_EN) ? "Local Time" : "Czas Lokalny";
  }
  int labelWidth = (int)strlen(timeLabel) * 6;
  int labelX = frameX + (frameWidth - labelWidth) / 2;
  tft.setCursor(labelX, 165);
  tft.print(timeLabel);

  String dateText;
  if (screen1TimeMode == SCREEN1_TIME_LOCAL) {
    dateText = (tftLanguage == TFT_LANG_EN)
                 ? getEnglishDateStringFullWithTimezone()
                 : getPolishDateStringFullWithTimezone();
  } else {
    dateText = (tftLanguage == TFT_LANG_EN)
                 ? getEnglishDateStringFull()
                 : getPolishDateStringFull();
  }
  drawDateLine(dateText);

  // 5. DOLNY PASEK - Tylko Adres IP
  IPAddress ip;
  bool connected = false;
  if (wifiConnected && WiFi.status() == WL_CONNECTED) {
    ip = WiFi.localIP();
    connected = true;
  } else if (WiFi.getMode() & WIFI_AP) {
    ip = WiFi.softAPIP();
    connected = true;
  }

  if (connected) {
    tft.setTextColor(ipColor);
    tft.setTextSize(2);
    String ipStr = ip.toString();
    int ipX = (320 - (ipStr.length() * 12)) / 2;
    tft.setCursor(ipX, 215);
    tft.print(ipStr);
  } else {
    tft.setTextColor(lightTheme ? TFT_BLACK : TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(80, 215);
    tft.print("NO CONNECTION");
  }
  drawHamClockConnectionIndicator(connected, lightTheme);
    // 4. STRZAĹKI ZMIANY EKRANU (Nawigacja)
  // Lewa strzaĹ‚ka (TrĂłjkÄ…t: x1, y1, x2, y2, x3, y3, kolor)
  tft.fillTriangle(10, 230, 20, 222, 20, 238, accentColor);
  
  // Prawa strzaĹ‚ka
  tft.fillTriangle(310, 230, 300, 222, 300, 238, accentColor);
  

