tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
}

void updateScreen1Clock() {
  if (!tftInitialized || currentScreen != SCREEN_HAM_CLOCK || inMenu) {
    return;
  }

  String timeUTC = (screen1TimeMode == SCREEN1_TIME_LOCAL)
                     ? getTimezoneTimeString("%H:%M:%S", 9)
                     : getUtcTimeString();
  
  // UĹĽyj tych samych wspĂłĹ‚rzÄ™dnych co w drawHamClock() - ograniczenie do obszaru ramki
  int frameX = 10;        // PoczÄ…tek ramki gĹ‚Ăłwnej
  int frameWidth = 300;   // SzerokoĹ›Ä‡ ramki gĹ‚Ăłwnej
  int timeWidth = timeUTC.length() * 24; // SzerokoĹ›Ä‡ tekstu zegara
  int timeX = frameX + (frameWidth - timeWidth) / 2; // WyĹ›rodkowanie w ramce
  timeX = (timeX < frameX + 5) ? frameX + 5 : timeX;
  
  // WyczyĹ›Ä‡ tylko obszar tekstu zegara (z maĹ‚ym marginesem), nie caĹ‚y prostokÄ…t
  // TextSize 4 ma wysokoĹ›Ä‡ okoĹ‚o 32px, wiÄ™c wyczyĹ›Ä‡ trochÄ™ wiÄ™cej
  const int timeBoxY = 120;
  const int timeBoxH = 35; // WysokoĹ›Ä‡ tekstu + margines
  const int timeBoxW = timeWidth + 10; // SzerokoĹ›Ä‡ tekstu + margines po bokach
  const int timeBoxX = timeX - 5; // Margines z lewej
  
  // Ograniczenie do obszaru ramki (nie wychodĹş poza ramkÄ™)
  int cleanX = (timeBoxX < frameX + 5) ? frameX + 5 : timeBoxX;
  int cleanW = timeBoxW;
  if (cleanX + cleanW > frameX + frameWidth - 5) {
    cleanW = (frameX + frameWidth - 5) - cleanX;
  }
  
  const bool lightTheme = isTftStyleLight();
  tft.fillRect(cleanX, timeBoxY, cleanW, timeBoxH, lightTheme ? TFT_WHITE : TFT_BLACK);

  // WyĹ›wietl zegar
  tft.setTextColor(lightTheme ? TFT_BLACK : TFT_WHITE);
  tft.setTextSize(4);
  tft.setCursor(timeX, 125);
  tft.print(timeUTC);

  bool connected = false;
  if (wifiConnected && WiFi.status() == WL_CONNECTED) {
    connected = true;
  } else if (WiFi.getMode() & WIFI_AP) {
    connected = true;
  }
  drawHamClockConnectionIndicator(connected, lightTheme);
}

void updateScreen1Date() {
  if (!tftInitialized || currentScreen != SCREEN_HAM_CLOCK || inMenu) {
    return;
  }

  struct tm timeinfo;
  bool gotTime = false;
  if (screen1TimeMode == SCREEN1_TIME_LOCAL) {
    gotTime = getTimeWithTimezone(&timeinfo);
  } else {
    gotTime = getLocalTime(&timeinfo, 1);
  }
  if (!gotTime) {
    return;
  }

  static int lastDay = -1;
  static int lastMonth = -1;
  static int lastYear = -1;
  if (timeinfo.tm_mday == lastDay &&
      timeinfo.tm_mon == lastMonth &&
      timeinfo.tm_year == lastYear) {
    return;
  }
  lastDay = timeinfo.tm_mday;
  lastMonth = timeinfo.tm_mon;
  lastYear = timeinfo.tm_year;

  String dateText;
  if (screen1TimeMode == SCREEN1_TIME_LOCAL) {
    dateText = (tftLanguage == TFT_LANG_EN)
                 ? getEnglishDateStringFullWithTimezone()
                 : getPolishDateStringFullWithTimezone();
  } else {
    dateText = (tftLanguage == TFT_LANG_EN)
                 ? getEnglishDateStringFull()
                 : getPolishDateStringFull();
  }
  drawDateLine(dateText);
}

void updateScreen2Clock() {
  if (!tftInitialized || currentScreen != SCREEN_DX_CLUSTER || inMenu) {
    return;
  }

  static unsigned long lastClockRedrawMs = 0;
  unsigned long now = millis();
  if (lastClockRedrawMs != 0 && (now - lastClockRedrawMs) < DX_SCREEN_MIN_REDRAW_MS) {
    return;
  }

  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return;
  }

  char timeBuffer[10];
  strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 315 - timeWidth;

  // WyczyĹ›Ä‡ tylko obszar godziny w nagĹ‚Ăłwku.
  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, tftHeaderBgColor());
  tft.setTextColor(tftHeaderTextColor());
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
  lastClockRedrawMs = now;
}

bool spotMatchesScreen2Filters(const DXSpot &spot) {
  return spotMatchesModeFilter(spot.mode, screen2FilterModeMask) &&
         spotMatchesBandFilter(spot, screen2FilterBandMask, SCREEN8_FILTER_BANDS, SCREEN8_FILTER_BANDS_COUNT);
}

uint8_t getModeFilterBitForIndex(int index) {
  switch (index) {
    case FILTER_MODE_CW:
      return FILTER_MODE_BIT_CW;
    case FILTER_MODE_SSB:
      return FILTER_MODE_BIT_SSB;
    case FILTER_MODE_DIGI:
      return FILTER_MODE_BIT_DIGI;
    default:
      return 0;
  }
}

uint16_t getBandFilterBitForIndex(int index) {
  if (index <= 0 || index >= 16) {
    return 0;
  }
  return (uint16_t)1u << (index - 1);
}

bool isModeFilterTileSelected(uint8_t mask, int index) {
  if (index == FILTER_MODE_ALL) {
    return mask == 0;
  }
  return (mask & getModeFilterBitForIndex(index)) != 0;
}

bool isBandFilterTileSelected(uint16_t mask, int index) {
  if (index == 0) {
    return mask == 0;
  }
  return (mask & getBandFilterBitForIndex(index)) != 0;
}

void toggleModeFilterSelection(uint8_t &mask, int index) {
  if (index == FILTER_MODE_ALL) {
    mask = 0;
    return;
  }

  uint8_t bit = getModeFilterBitForIndex(index);
  if (bit == 0) {
    return;
  }

  mask ^= bit;
}

void toggleBandFilterSelection(uint16_t &mask, int index) {
  if (index == 0) {
    mask = 0;
    return;
  }

  uint16_t bit = getBandFilterBitForIndex(index);
  if (bit == 0) {
    return;
  }

  mask ^= bit;
}

bool spotMatchesModeFilter(const String &modeRaw, uint8_t mask) {
  if (mask == 0) {
    return true;
  }

  String mode = modeRaw;
  mode.toUpperCase();

  if ((mask & FILTER_MODE_BIT_CW) && mode == "CW") {
    return true;
  }
  if ((mask & FILTER_MODE_BIT_SSB) && mode == "SSB") {
    return true;
  }
  if ((mask & FILTER_MODE_BIT_DIGI) && (mode == "FT8" || mode == "FT4")) {
    return true;
  }
  return false;
}

bool spotMatchesBandFilter(const DXSpot &spot, uint16_t mask, const char **bands, int bandCount) {
  if (mask == 0) {
    return true;
  }

  float freqMHz = spot.frequency;
  for (int index = 1; index < bandCount; index++) {
    uint16_t bit = getBandFilterBitForIndex(index);
    if ((mask & bit) == 0) {
      continue;
    }

    String selectedBand = bands[index];
    if (selectedBand == "VHF") {
      if (freqMHz >= 30.0f && freqMHz < 300.0f) {
        return true;
      }
      continue;
    }
    if (selectedBand == "UHF") {
      if (freqMHz >= 300.0f && freqMHz < 3000.0f) {
        return true;
      }
      continue;
    }
    if (selectedBand == "SHF") {
      if (freqMHz >= 3000.0f && freqMHz < 30000.0f) {
        return true;
      }
      continue;
    }
    if (spot.band == selectedBand) {
      return true;
    }
  }

