tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  return false;
}

bool spotMatchesScreen7Filters(const DXSpot &spot) {
  return spotMatchesModeFilter(spot.mode, screen7FilterModeMask) &&
         spotMatchesBandFilter(spot, screen7FilterBandMask, SCREEN2_FILTER_BANDS, SCREEN2_FILTER_BANDS_COUNT);
}

bool spotMatchesScreen8Filters(const DXSpot &spot) {
  return spotMatchesModeFilter(spot.mode, screen8FilterModeMask) &&
         spotMatchesBandFilter(spot, screen8FilterBandMask, SCREEN8_FILTER_BANDS, SCREEN8_FILTER_BANDS_COUNT);
}

float getAprsSortDistance(const APRSStation &s) {
  if (s.hasLatLon && s.distance > 0) {
    return s.distance;
  }
  return 1.0e9f;
}

static int roundAprsDistanceKm(float km) {
  // Odległość APRS jest nieujemna; +0.5f daje zaokrąglenie do pełnego km zamiast obcinania.
  return (int)(km + 0.5f);
}

bool aprsSortLess(int a, int b) {
  if (screen6SortMode == APRS_SORT_CALLSIGN) {
    String ca = aprsStations[a].callsign;
    String cb = aprsStations[b].callsign;
    ca.toUpperCase();
    cb.toUpperCase();
    if (ca == cb) {
      return a < b;
    }
    return ca < cb;
  }
  if (screen6SortMode == APRS_SORT_DISTANCE) {
    float da = getAprsSortDistance(aprsStations[a]);
    float db = getAprsSortDistance(aprsStations[b]);
    if (da == db) {
      String ca = aprsStations[a].callsign;
      String cb = aprsStations[b].callsign;
      ca.toUpperCase();
      cb.toUpperCase();
      return ca < cb;
    }
    return da < db;
  }
  // APRS_SORT_TIME = aktualna kolejność
  return a < b;
}

void buildAprsDisplayOrder(int *order, int &count) {
  count = min(aprsStationCount, MAX_APRS_DISPLAY_LCD);
  for (int i = 0; i < count; i++) {
    order[i] = i;
  }
  if (screen6SortMode == APRS_SORT_TIME) {
    return;
  }
  for (int i = 0; i < count - 1; i++) {
    int best = i;
    for (int j = i + 1; j < count; j++) {
      if (aprsSortLess(order[j], order[best])) {
        best = j;
      }
    }
    if (best != i) {
      int tmp = order[i];
      order[i] = order[best];
      order[best] = tmp;
    }
  }
}

uint32_t computeScreen2Signature() {
  // Prosty hash treĹ›ci tabeli (10 lub 11 wierszy zależnie od paska nawigacji)
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  lockDxSpots();
  hash ^= (uint32_t)spotCount;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen2FilterModeMask;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen2FilterBandMask;
  hash *= fnvPrime;
  hash ^= (uint32_t)dxTableSizeMode;
  hash *= fnvPrime;
  hash ^= isTableNavFooterVisible(SCREEN_DX_CLUSTER) ? 1u : 0u;
  hash *= fnvPrime;

  int maxRows = getDxTableMaxRows();
  int displayCount = 0;
  for (int i = 0; i < spotCount && displayCount < maxRows; i++) {
    const DXSpot &s = spots[i];
    if (!spotMatchesScreen2Filters(s)) {
      continue;
    }
    for (size_t j = 0; j < s.time.length(); j++) {
      hash ^= (uint8_t)s.time[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.callsign.length(); j++) {
      hash ^= (uint8_t)s.callsign[j];
      hash *= fnvPrime;
    }
    hash ^= (uint32_t)(s.frequency * 100);
    hash *= fnvPrime;
    for (size_t j = 0; j < s.mode.length(); j++) {
      hash ^= (uint8_t)s.mode[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.country.length(); j++) {
      hash ^= (uint8_t)s.country[j];
      hash *= fnvPrime;
    }
    hash ^= (uint32_t)s.distance;
    hash *= fnvPrime;
    displayCount++;
  }

  unlockDxSpots();

  return hash;
}

void updateScreen2Data() {
  if (!tftInitialized || currentScreen != SCREEN_DX_CLUSTER || inMenu) {
    return;
  }

  // 1) Zaktualizuj czas w nagĹ‚Ăłwku (bez peĹ‚nego odĹ›wieĹĽania)
  updateScreen2Clock();

  // 2) OdĹ›wieĹĽ tabelÄ™ tylko gdy dane siÄ™ zmieniĹ‚y
  static uint32_t lastSig = 0;
  static unsigned long lastTableRedrawMs = 0;
  uint32_t currentSig = computeScreen2Signature();
  if (currentSig == lastSig) {
    return;
  }

  unsigned long now = millis();
  if (lastTableRedrawMs != 0 && (now - lastTableRedrawMs) < DX_SCREEN_MIN_REDRAW_MS) {
    return;
  }

  lastSig = currentSig;
  lastTableRedrawMs = now;

  // 3) Renderuj tabelÄ™ do bufora i wypchnij jednym ruchem (bez migotania)
  const bool navVisible = isTableNavFooterVisible(SCREEN_DX_CLUSTER);
  const bool enlarged = isDxTableEnlarged();
  const int maxRows = getDxTableMaxRows();
  const int tableTop = TFT_TABLE_TOP;
  const int tableBottom = getTableBottomForScreen(SCREEN_DX_CLUSTER);
  const int tableHeight = tableBottom - tableTop;
  TFT_eSprite *tableSprite = (navVisible && ensureSharedTableSprite()) ? &sharedTableSprite : nullptr;

  if (tableSprite != nullptr) {
    tableSprite->fillSprite(tftUiPalette.bg);

    int yPos = 8;
    tableSprite->setTextColor(tftUiPalette.muted);
    tableSprite->setTextSize(1);
    if (enlarged) {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(74, yPos);  tableSprite->print("CALL");
      tableSprite->setCursor(191, yPos); tableSprite->print("MHz");
      tableSprite->setCursor(274, yPos); tableSprite->print("MODE");
    } else {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(50, yPos);  tableSprite->print("CALLSIGN");
      tableSprite->setCursor(125, yPos); tableSprite->print("MHz");
      tableSprite->setCursor(182, yPos); tableSprite->print("MODE");
      tableSprite->setCursor(212, yPos); tableSprite->print(tr(TR_COUNTRY));
    }
    tableSprite->drawFastHLine(0, yPos + 10, 320, tftUiPalette.muted);
    yPos += enlarged ? 20 : 18;

    int displayCount = 0;
    lockDxSpots();
    for (int i = 0; i < spotCount && displayCount < maxRows; i++) {
      if (!spotMatchesScreen2Filters(spots[i])) {
        continue;
      }
      if (yPos >= (tableHeight - 2)) {
        break;
      }
      if (enlarged) {
        if (displayCount % 2 == 0) {
          tableSprite->fillRect(0, yPos - 5, 320, 24, tftUiPalette.rowAlt);
        }

        tableSprite->setTextSize(2);
        tableSprite->setTextColor(tftUiPalette.muted);
        tableSprite->setCursor(5, yPos);
        tableSprite->print(formatSpotUtc(spots[i].time));

        tableSprite->setTextColor(tftUiPalette.fg);
        tableSprite->setCursor(74, yPos);
        String callText = spots[i].callsign;
        if (callText.length() > 9) callText = callText.substring(0, 9);
        tableSprite->print(callText);

        tableSprite->setTextColor(tftTableFreqColor());
        tableSprite->setCursor(191, yPos);
        tableSprite->print(spots[i].frequency / 1000.0, 3);

