tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
        tableSprite->setTextColor(tftTableModeColor());
        tableSprite->setCursor(274, yPos);
        String modeText = spots[i].mode;
        if (modeText.length() > 4) modeText = modeText.substring(0, 4);
        tableSprite->print(modeText);

        yPos += 27;
      } else {
        if (displayCount % 2 == 0) {
          tableSprite->fillRect(0, yPos - 2, 320, 16, tftUiPalette.rowAlt);
        }

        tableSprite->setTextSize(1);

        tableSprite->setTextColor(tftUiPalette.muted);
        tableSprite->setCursor(5, yPos);
        tableSprite->print(formatSpotUtc(spots[i].time));

        tableSprite->setTextColor(tftUiPalette.fg);
        tableSprite->setCursor(50, yPos);
        tableSprite->print(spots[i].callsign);

        tableSprite->setTextColor(tftTableFreqColor());
        tableSprite->setCursor(125, yPos);
        tableSprite->print(spots[i].frequency / 1000.0, 3);

        tableSprite->setTextColor(tftTableModeColor());
        tableSprite->setCursor(182, yPos);
        tableSprite->print(spots[i].mode);

        tableSprite->setTextColor(tftTableAccentTextColor());
        tableSprite->setCursor(212, yPos);
        String countryText = formatDistanceOrCountry(spots[i], COUNTRY_COL_MAX_LEN);
        tableSprite->print(countryText);

        yPos += 17;
      }
      displayCount++;
    }
    unlockDxSpots();

    if (displayCount == 0) {
      tableSprite->setTextColor(TFT_RED);
      tableSprite->setTextSize(2);
      tableSprite->setCursor(40, 120 - tableTop);
      tableSprite->print("WAITING FOR SPOTS...");
    }

    tableSprite->pushSprite(0, tableTop);
    return;
  }

  // Fallback bez sprite (np. gdy zabraknie RAM)
  tft.fillRect(0, tableTop, 320, tableHeight, tftUiPalette.bg);

  int yPos = 40;
  tft.setTextColor(tftUiPalette.muted);
  tft.setTextSize(1);
  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(191, yPos); tft.print("MHz");
    tft.setCursor(274, yPos); tft.print("MODE");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("MHz");
    tft.setCursor(182, yPos); tft.print("MODE");
    tft.setCursor(212, yPos); tft.print(tr(TR_COUNTRY));
  }
  tft.drawFastHLine(0, yPos + 10, 320, tftUiPalette.muted);
  yPos += enlarged ? 20 : 18;

  int displayCount = 0;
  lockDxSpots();
  for (int i = 0; i < spotCount && displayCount < maxRows; i++) {
    if (!spotMatchesScreen2Filters(spots[i])) {
      continue;
    }
    if (yPos >= (tableBottom - 2)) {
      break;
    }
    if (enlarged) {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 5, 320, 24, tftUiPalette.rowAlt);
      }

      tft.setTextSize(2);
      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      tft.print(formatSpotUtc(spots[i].time));

      tft.setTextColor(tftUiPalette.fg);
      tft.setCursor(74, yPos);
      String callText = spots[i].callsign;
      if (callText.length() > 9) callText = callText.substring(0, 9);
      tft.print(callText);

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(191, yPos);
      tft.print(spots[i].frequency / 1000.0, 3);

      tft.setTextColor(tftTableModeColor());
      tft.setCursor(274, yPos);
      String modeText = spots[i].mode;
      if (modeText.length() > 4) modeText = modeText.substring(0, 4);
      tft.print(modeText);

      yPos += 27;
    } else {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 2, 320, 16, tftUiPalette.rowAlt);
      }

      tft.setTextSize(1);

      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      tft.print(formatSpotUtc(spots[i].time));

      tft.setTextColor(tftUiPalette.fg);
      tft.setCursor(50, yPos);
      tft.print(spots[i].callsign);

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(125, yPos);
      tft.print(spots[i].frequency / 1000.0, 3);

      tft.setTextColor(tftTableModeColor());
      tft.setCursor(182, yPos);
      tft.print(spots[i].mode);

      tft.setTextColor(tftTableAccentTextColor());
      tft.setCursor(212, yPos);
      String countryText = formatDistanceOrCountry(spots[i], COUNTRY_COL_MAX_LEN);
      tft.print(countryText);

      yPos += 17;
    }
    displayCount++;
  }
  unlockDxSpots();

  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
}

// Ekran 7: POTA Cluster (SSB only, 10 spotów)
void drawPotaCluster() {
  // Użyj tych samych współrzędnych co w drawHamClock() - ograniczenie do obszaru ramki

  tft.fillRect(0, 0, 320, 32, tftHeaderBgColor());
  tft.setTextColor(tftHeaderTextColor());

  drawHamburgerMenuButton3D(5, 7);

  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print("POTA.app");
  

  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuffer[10];
    strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setCursor(315 - timeWidth, 8);
    tft.print(timeBuffer);
  }

  int yPos = 40;
  const bool enlarged = isDxTableEnlarged();
  tft.setTextColor(tftUiPalette.muted);
  tft.setTextSize(1);

  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(191, yPos); tft.print("MHz");
    tft.setCursor(274, yPos); tft.print("MODE");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("MHz");
    tft.setCursor(182, yPos); tft.print("MODE");
    tft.setCursor(212, yPos); tft.print(tr(TR_COUNTRY));
  }
  tft.drawFastHLine(0, yPos + 10, 320, tftUiPalette.muted);
  yPos += enlarged ? 20 : 18;

  int maxRows = getPotaTableMaxRows();
  int displayCount = 0;
  lockPotaSpots();
  for (int i = 0; i < potaSpotCount && displayCount < maxRows; i++) {
    if (!spotMatchesScreen7Filters(potaSpots[i])) continue;
    if (enlarged) {
      if (displayCount % 2 == 0) tft.fillRect(0, yPos - 5, 320, 24, tftUiPalette.rowAlt);

      tft.setTextSize(2);
      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      tft.print(formatSpotUtc(potaSpots[i].time));

      tft.setTextColor(tftUiPalette.fg);
      tft.setCursor(74, yPos);
      String callText = potaSpots[i].callsign;
      if (callText.length() > 9) callText = callText.substring(0, 9);
      tft.print(callText);

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(191, yPos);
      tft.print(potaSpots[i].frequency, 3);

      tft.setTextColor(tftTableModeColor());
      tft.setCursor(274, yPos);
      String modeText = potaSpots[i].mode;
      if (modeText.length() > 4) modeText = modeText.substring(0, 4);
      tft.print(modeText);

      yPos += 27;
    } else {
      if (displayCount % 2 == 0) tft.fillRect(0, yPos - 2, 320, 16, tftUiPalette.rowAlt);

      tft.setTextSize(1);
      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      String timeStr = potaSpots[i].time;
      // Obsłuż ISO 8601 z datą: wyciągnij HH:MM
      int tPos = timeStr.indexOf('T');
      if (tPos > 0 && tPos + 5 < (int)timeStr.length()) {
        timeStr = timeStr.substring(tPos + 1, tPos + 6);
      }
      if (timeStr.length() > 5) timeStr = timeStr.substring(0, 5);
      tft.print(timeStr);

      tft.setTextColor(tftUiPalette.fg);
      tft.setCursor(50, yPos);
      tft.print(potaSpots[i].callsign);

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(125, yPos);
      tft.print(potaSpots[i].frequency, 3); // frequency już w MHz

      tft.setTextColor(tftTableModeColor());
      tft.setCursor(182, yPos);
      tft.print(potaSpots[i].mode);

      tft.setTextColor(tftTableAccentTextColor());
      tft.setCursor(212, yPos);
      String countryText = formatDistanceOrCountry(potaSpots[i], COUNTRY_COL_MAX_LEN);
      tft.print(countryText);

      yPos += 17;
    }
    displayCount++;
  }
  unlockPotaSpots();

  if (isTableNavFooterVisible(SCREEN_POTA_CLUSTER)) {
    drawSwitchScreenFooter();
  }

