tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
}

void updateScreen7Clock() {
  if (!tftInitialized || currentScreen != 7 || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return;
  }

  char timeBuffer[10];
  strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 315 - timeWidth;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, tftHeaderBgColor());
  tft.setTextColor(tftHeaderTextColor());
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
}

uint32_t computeScreen7Signature() {
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  lockPotaSpots();
  hash ^= (uint32_t)potaSpotCount;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen7FilterModeMask;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen7FilterBandMask;
  hash *= fnvPrime;
  hash ^= (uint32_t)dxTableSizeMode;
  hash *= fnvPrime;
  hash ^= isTableNavFooterVisible(SCREEN_POTA_CLUSTER) ? 1u : 0u;
  hash *= fnvPrime;

  int maxDisplaySpots = min(potaSpotCount, getPotaTableMaxRows());
  int displayCount = 0;
  for (int i = 0; i < potaSpotCount && displayCount < maxDisplaySpots; i++) {
    const DXSpot &s = potaSpots[i];
    if (!spotMatchesScreen7Filters(s)) continue;
    for (size_t j = 0; j < s.time.length(); j++) {
      hash ^= (uint8_t)s.time[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.callsign.length(); j++) {
      hash ^= (uint8_t)s.callsign[j];
      hash *= fnvPrime;
    }

    hash ^= (uint32_t)(s.frequency * 100);
    hash *= fnvPrime;
    for (size_t j = 0; j < s.mode.length(); j++) {
      hash ^= (uint8_t)s.mode[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.country.length(); j++) {
      hash ^= (uint8_t)s.country[j];
      hash *= fnvPrime;
    }
    displayCount++;
  }
  unlockPotaSpots();

  return hash;
}

void updateScreen7Data() {
  if (!tftInitialized || currentScreen != 7 || inMenu) {
    return;
  }

  updateScreen7Clock();

  static uint32_t lastSig = 0;
  uint32_t currentSig = computeScreen7Signature();
  if (currentSig == lastSig) {
    return;
  }
  lastSig = currentSig;

  const bool navVisible = isTableNavFooterVisible(SCREEN_POTA_CLUSTER);
  const bool enlarged = isDxTableEnlarged();
  const int maxRows = getPotaTableMaxRows();
  const int tableTop = TFT_TABLE_TOP;
  const int tableBottom = getTableBottomForScreen(SCREEN_POTA_CLUSTER);
  const int tableHeight = tableBottom - tableTop;
  TFT_eSprite *tableSprite = (navVisible && ensureSharedTableSprite()) ? &sharedTableSprite : nullptr;

  if (tableSprite != nullptr) {
    tableSprite->fillSprite(tftUiPalette.bg);

    int yPos = 8;
    tableSprite->setTextColor(tftUiPalette.muted);
    tableSprite->setTextSize(1);
    if (enlarged) {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(74, yPos);  tableSprite->print("CALL");
      tableSprite->setCursor(191, yPos); tableSprite->print("MHz");
      tableSprite->setCursor(274, yPos); tableSprite->print("MODE");
    } else {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(50, yPos);  tableSprite->print("CALLSIGN");
      tableSprite->setCursor(125, yPos); tableSprite->print("MHz");
      tableSprite->setCursor(182, yPos); tableSprite->print("MODE");
      tableSprite->setCursor(212, yPos); tableSprite->print(tr(TR_COUNTRY));
    }
    tableSprite->drawFastHLine(0, yPos + 10, 320, tftUiPalette.muted);
    yPos += enlarged ? 20 : 18;

    int displayCount = 0;
    lockPotaSpots();
    for (int i = 0; i < potaSpotCount && displayCount < maxRows; i++) {
      if (!spotMatchesScreen7Filters(potaSpots[i])) continue;
      if (yPos >= (tableHeight - 2)) {
        break;
      }
      if (enlarged) {
        if (displayCount % 2 == 0) {
          tableSprite->fillRect(0, yPos - 5, 320, 24, tftUiPalette.rowAlt);
        }

        tableSprite->setTextSize(2);

        tableSprite->setTextColor(tftUiPalette.muted);
        tableSprite->setCursor(5, yPos);
        tableSprite->print(formatSpotUtc(potaSpots[i].time));

        tableSprite->setTextColor(tftUiPalette.fg);
        tableSprite->setCursor(74, yPos);
        String callText = potaSpots[i].callsign;
        if (callText.length() > 9) callText = callText.substring(0, 9);
        tableSprite->print(callText);

        tableSprite->setTextColor(tftTableFreqColor());
        tableSprite->setCursor(191, yPos);
        tableSprite->print(potaSpots[i].frequency, 3);

        tableSprite->setTextColor(tftTableModeColor());
        tableSprite->setCursor(274, yPos);
        String modeText = potaSpots[i].mode;
        if (modeText.length() > 4) modeText = modeText.substring(0, 4);
        tableSprite->print(modeText);

        yPos += 27;
      } else {
        if (displayCount % 2 == 0) {
          tableSprite->fillRect(0, yPos - 2, 320, 16, tftUiPalette.rowAlt);
        }

        tableSprite->setTextSize(1);

        tableSprite->setTextColor(tftUiPalette.muted);
        tableSprite->setCursor(5, yPos);
        String timeStr = potaSpots[i].time;
        int tPos = timeStr.indexOf('T');
        if (tPos > 0 && tPos + 5 < (int)timeStr.length()) {
          timeStr = timeStr.substring(tPos + 1, tPos + 6);
        }
        if (timeStr.length() > 5) timeStr = timeStr.substring(0, 5);
        tableSprite->print(timeStr);

        tableSprite->setTextColor(tftUiPalette.fg);
        tableSprite->setCursor(50, yPos);
        tableSprite->print(potaSpots[i].callsign);

        tableSprite->setTextColor(tftTableFreqColor());
        tableSprite->setCursor(125, yPos);
        tableSprite->print(potaSpots[i].frequency, 3);

        tableSprite->setTextColor(tftTableModeColor());
        tableSprite->setCursor(182, yPos);
        tableSprite->print(potaSpots[i].mode);

        tableSprite->setTextColor(tftTableAccentTextColor());
        tableSprite->setCursor(212, yPos);
        String countryText = formatDistanceOrCountry(potaSpots[i], COUNTRY_COL_MAX_LEN);
        tableSprite->print(countryText);

        yPos += 17;
      }
      displayCount++;
    }
    unlockPotaSpots();

