tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
}

void updateScreen8Clock() {
  if (!tftInitialized || currentScreen != SCREEN_HAMALERT_CLUSTER || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return;
  }

  char timeBuffer[10];
  strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 315 - timeWidth;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, tftHeaderBgColor());
  tft.setTextColor(tftHeaderTextColor());
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
}

uint32_t computeScreen8Signature() {
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  lockHamalertSpots();
  hash ^= (uint32_t)hamalertSpotCount;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen8FilterModeMask;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen8FilterBandMask;
  hash *= fnvPrime;
  hash ^= (uint32_t)dxTableSizeMode;
  hash *= fnvPrime;
  hash ^= isTableNavFooterVisible(SCREEN_HAMALERT_CLUSTER) ? 1u : 0u;
  hash *= fnvPrime;

  int maxRows = getHamalertTableMaxRows();
  int displayCount = 0;
  for (int i = 0; i < hamalertSpotCount && displayCount < maxRows; i++) {
    const DXSpot &s = hamalertSpots[i];
    if (!spotMatchesScreen8Filters(s)) {
      continue;
    }
    for (size_t j = 0; j < s.time.length(); j++) {
      hash ^= (uint8_t)s.time[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.callsign.length(); j++) {
      hash ^= (uint8_t)s.callsign[j];
      hash *= fnvPrime;
    }
    hash ^= (uint32_t)(s.frequency * 100);
    hash *= fnvPrime;
    for (size_t j = 0; j < s.mode.length(); j++) {
      hash ^= (uint8_t)s.mode[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.country.length(); j++) {
      hash ^= (uint8_t)s.country[j];
      hash *= fnvPrime;
    }
    displayCount++;
  }
  unlockHamalertSpots();

  return hash;
}

void updateScreen8Data() {
  if (!tftInitialized || currentScreen != SCREEN_HAMALERT_CLUSTER || inMenu) {
    return;
  }

  updateScreen8Clock();

  static uint32_t lastSig = 0;
  uint32_t currentSig = computeScreen8Signature();
  if (currentSig == lastSig) {
    return;
  }
  lastSig = currentSig;

  const bool enlarged = isDxTableEnlarged();
  const int maxRows = getHamalertTableMaxRows();
  const int tableTop = TFT_TABLE_TOP;
  const int tableBottom = getTableBottomForScreen(SCREEN_HAMALERT_CLUSTER);
  const int tableHeight = tableBottom - tableTop;

  tft.fillRect(0, tableTop, 320, tableHeight, tftUiPalette.bg);

  int yPos = 40;
  tft.setTextColor(tftUiPalette.muted);
  tft.setTextSize(1);
  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(191, yPos); tft.print("MHz");
    tft.setCursor(274, yPos); tft.print("MODE");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("MHz");
    tft.setCursor(182, yPos); tft.print("MODE");
    tft.setCursor(212, yPos); tft.print(tr(TR_COUNTRY));
  }
  tft.drawFastHLine(0, yPos + 10, 320, tftUiPalette.muted);
  yPos += enlarged ? 20 : 18;

  int displayCount = 0;
  lockHamalertSpots();
  for (int i = 0; i < hamalertSpotCount && displayCount < maxRows; i++) {
    if (!spotMatchesScreen8Filters(hamalertSpots[i])) {
      continue;
    }
    if (yPos >= (tableBottom - 2)) {
      break;
    }
    if (enlarged) {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 5, 320, 24, tftUiPalette.rowAlt);
      }

      tft.setTextSize(2);

      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      tft.print(formatHamalertTftTime(hamalertSpots[i].time));

      tft.setTextColor(tftUiPalette.fg);
      tft.setCursor(74, yPos);
      String callText = hamalertSpots[i].callsign;
      if (callText.length() > 9) callText = callText.substring(0, 9);
      tft.print(callText);

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(191, yPos);
      tft.print(hamalertSpots[i].frequency, 3);

      tft.setTextColor(tftTableModeColor());
      tft.setCursor(274, yPos);
      String modeText = hamalertSpots[i].mode;
      if (modeText.length() > 4) modeText = modeText.substring(0, 4);
      tft.print(modeText);

      yPos += 27;
    } else {
      if (displayCount % 2 == 0) {
        tft.fillRect(0, yPos - 2, 320, 16, tftUiPalette.rowAlt);
      }

      tft.setTextSize(1);

      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      tft.print(formatHamalertTftTime(hamalertSpots[i].time));

      tft.setTextColor(tftUiPalette.fg);
      tft.setCursor(50, yPos);
      tft.print(hamalertSpots[i].callsign);

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(125, yPos);
      tft.print(hamalertSpots[i].frequency, 3);

      tft.setTextColor(tftTableModeColor());
      tft.setCursor(182, yPos);
      tft.print(hamalertSpots[i].mode);

      tft.setTextColor(tftTableAccentTextColor());
      tft.setCursor(212, yPos);
      String countryText = formatDistanceOrCountry(hamalertSpots[i], COUNTRY_COL_MAX_LEN);
      tft.print(countryText);

      yPos += 17;
    }
    displayCount++;
  }
  unlockHamalertSpots();

  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
}

bool readRawTouchPoint(int16_t &rx, int16_t &ry) {
  if (!touch.touched()) {
    return false;
  }
  TS_Point p = touch.getPoint();
  rx = p.x;
  ry = p.y;
  return true;
}

void mapRawToScreenWithValues(int16_t rx, int16_t ry,
                              int xmin, int xmax, int ymin, int ymax,
                              bool swapXY, bool invertX, bool invertY,
                              uint16_t &x, uint16_t &y) {
  int16_t mx = rx;
  int16_t my = ry;

  if (swapXY) {
    int16_t tmp = mx;
    mx = my;
    my = tmp;
  }
  if (invertX) {
    mx = xmax - (mx - xmin);
  }
  if (invertY) {
    my = ymax - (my - ymin);
  }

  mx = constrain(mx, xmin, xmax);
  my = constrain(my, ymin, ymax);

  int screenW = tft.width();
  int screenH = tft.height();
  x = map(mx, xmin, xmax, 0, screenW - 1);
  y = map(my, ymin, ymax, 0, screenH - 1);
}

void mapRawToScreen(int16_t rx, int16_t ry, uint16_t &x, uint16_t &y) {
  mapRawToScreenWithValues(rx, ry, touchXMin, touchXMax, touchYMin, touchYMax,
                           touchSwapXY, touchInvertX, touchInvertY, x, y);
}

bool readTouchPoint(uint16_t &x, uint16_t &y) {
  int16_t rx = 0;
  int16_t ry = 0;
  if (!readRawTouchPoint(rx, ry)) {
    return false;
  }
  mapRawToScreen(rx, ry, x, y);
  return true;
}

