tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
const int SCREEN_ORDER_COUNT = SCREEN_PAGE_COUNT;

ScreenType normalizeScreenType(uint8_t raw) {
  switch (raw) {
    case SCREEN_HAM_CLOCK:
    case SCREEN_DX_CLUSTER:
    case SCREEN_SUN_SPOTS:
    case SCREEN_BAND_INFO:
    case SCREEN_WEATHER_DSP:
    case SCREEN_WEATHER_FORECAST:
    case SCREEN_LOKALIZACJA:
    case SCREEN_APRS_IS:
    case SCREEN_APRS_RADAR:
    case SCREEN_POTA_CLUSTER:
    case SCREEN_HAMALERT_CLUSTER:
    case SCREEN_MATRIX_CLOCK:
    case SCREEN_UNLIS_HUNTER:
      return (ScreenType)raw;
    default:
      return SCREEN_OFF;
  }
}

const char* screenTypeToCodeStr(ScreenType t) {
  switch (t) {
    case SCREEN_HAM_CLOCK: return "hamclock";
    case SCREEN_DX_CLUSTER: return "dxcluster";
    case SCREEN_APRS_IS: return "aprsis";
    case SCREEN_APRS_RADAR: return "aprsradar";
    case SCREEN_BAND_INFO: return "bandinfo";
    case SCREEN_SUN_SPOTS: return "sunspots";
    case SCREEN_WEATHER_DSP: return "weather";
    case SCREEN_WEATHER_FORECAST: return "weatherforecast";
    case SCREEN_LOKALIZACJA: return "lokalizacja";
    case SCREEN_POTA_CLUSTER: return "pota";
    case SCREEN_HAMALERT_CLUSTER: return "hamalert";
    case SCREEN_MATRIX_CLOCK: return "matrix";
    case SCREEN_UNLIS_HUNTER: return "unlishunter";
    case SCREEN_OFF:
    default:
      return "off";
  }
}

ScreenType screenCodeToType(const String &code) {
  String c = code;
  c.toLowerCase();
  c.trim();
  if (c == "hamclock") return SCREEN_HAM_CLOCK;
  if (c == "dxcluster") return SCREEN_DX_CLUSTER;
  if (c == "aprsis") return SCREEN_APRS_IS;
  if (c == "aprsradar") return SCREEN_APRS_RADAR;
  if (c == "bandinfo") return SCREEN_BAND_INFO;
  if (c == "sunspots") return SCREEN_SUN_SPOTS;
  if (c == "weather") return SCREEN_WEATHER_DSP;
  if (c == "weatherforecast" || c == "forecast") return SCREEN_WEATHER_FORECAST;
  if (c == "lokalizacja" || c == "location" || c == "gps") return SCREEN_LOKALIZACJA;
  if (c == "pota") return SCREEN_POTA_CLUSTER;
  if (c == "hamalert") return SCREEN_HAMALERT_CLUSTER;
  if (c == "matrix") return SCREEN_MATRIX_CLOCK;
  if (c == "unlishunter") return SCREEN_UNLIS_HUNTER;
  return SCREEN_OFF;
}

void loadDefaultScreenOrder() {
  for (int i = 0; i < SCREEN_ORDER_COUNT; i++) {
    screenOrder[i] = DEFAULT_SCREEN_ORDER[i];
  }
}

void ensureScreenOrderValid() {
  bool hasActive = false;
  bool seen[14] = {false}; // indeksy odpowiadają ScreenType wartościom (0..13)
  for (int i = 0; i < SCREEN_ORDER_COUNT; i++) {
    screenOrder[i] = normalizeScreenType(screenOrder[i]);
    ScreenType t = screenOrder[i];
    if (t != SCREEN_OFF) {
      if (t >= 0 && t <= SCREEN_LOKALIZACJA) {
        if (seen[t]) {
          // drugi raz ten sam ekran – usuń duplikat
          screenOrder[i] = SCREEN_OFF;
          continue;
        }
        seen[t] = true;
      }
      hasActive = true;
    }
  }
  if (!hasActive) {
    loadDefaultScreenOrder();
  }
}

int findScreenOrderIndex(ScreenType screenId) {
  for (int i = 0; i < SCREEN_ORDER_COUNT; i++) {
    if (screenOrder[i] == screenId) {
      return i;
    }
  }
  return 0;
}

ScreenType firstActiveScreen() {
  for (int i = 0; i < SCREEN_ORDER_COUNT; i++) {
    if (screenOrder[i] != SCREEN_OFF) {
      return screenOrder[i];
    }
  }
  return SCREEN_HAM_CLOCK;
}

ScreenType getNextScreenId(ScreenType currentId) {
  int idx = findScreenOrderIndex(currentId);
  for (int step = 1; step <= SCREEN_ORDER_COUNT; step++) {
    ScreenType candidate = screenOrder[(idx + step) % SCREEN_ORDER_COUNT];
    if (candidate != SCREEN_OFF) {
      return candidate;
    }
  }
  return SCREEN_HAM_CLOCK;
}

ScreenType getPrevScreenId(ScreenType currentId) {
  int idx = findScreenOrderIndex(currentId);
  for (int step = 1; step <= SCREEN_ORDER_COUNT; step++) {
    int prev = idx - step;
    if (prev < 0) {
      prev += SCREEN_ORDER_COUNT;
    }
    ScreenType candidate = screenOrder[prev];
    if (candidate != SCREEN_OFF) {
      return candidate;
    }
  }
  return SCREEN_HAM_CLOCK;
}

static int normalizeTftAutoSwitchTimeSec(int seconds) {
  if (seconds < 1) return 1;
  if (seconds > 3600) return 3600;
  return seconds;
}

static void applyTftAutoSwitchTimeSec(int seconds) {
  tftAutoSwitchTimeSec = normalizeTftAutoSwitchTimeSec(seconds);
}

static void resetTftAutoSwitchTimer() {
  tftAutoSwitchLastMs = millis();
  tftAutoSwitchLastScreen = currentScreen;
}

void handleTouchNavigation() {
  if (!tftInitialized) {
    return;
  }

  const uint16_t menuHitW = 50;
  const uint16_t menuHitH = 50;

  static bool touchActive = false;
  static unsigned long lastTouchMs = 0;
  static unsigned long touchStartMs = 0;
  static uint16_t touchStartX = 0;
  static uint16_t touchStartY = 0;
  static bool longPressHandled = false;
  static bool matrixGameHoldCandidate = false;
  unsigned long now = millis();

  uint16_t x = 0;
  uint16_t y = 0;
  int16_t rawX = 0;
  int16_t rawY = 0;
  if (readRawTouchPoint(rawX, rawY)) {
    mapRawToScreen(rawX, rawY, x, y);
    bool isNewTap = false;
    if (!touchActive) {
      if ((now - lastTouchMs) <= 150) {
        return;
      }
      touchActive = true;
      lastTouchMs = now;
      touchStartMs = now;
      touchStartX = x;
      touchStartY = y;
      longPressHandled = false;
      matrixGameHoldCandidate = (currentScreen == SCREEN_MATRIX_CLOCK && !inMenu && x >= 240 && y <= 80);
      isNewTap = true;
    }

    if (touchCalActive) {
      handleTouchCalibrationTouch(rawX, rawY, x, y, isNewTap);
      return;
    }

    if (aprsAlertScreenActive) {
      if (isNewTap && isAprsAlertCloseButtonHit(x, y)) {
        dismissAprsAlertScreen();
      }
      return;
    }

    if (!brightnessMenuActive && !longPressHandled && matrixGameHoldCandidate) {
      if (currentScreen == SCREEN_MATRIX_CLOCK && !inMenu && (now - touchStartMs) >= 2000) {
        currentScreen = SCREEN_UNLIS_HUNTER;
        drawScreen(currentScreen);
        resetTftAutoSwitchTimer();
        longPressHandled = true;
        matrixGameHoldCandidate = false;
        return;
      }
    }

    if (!brightnessMenuActive && !longPressHandled) {
      if (now - touchStartMs >= 3000) {
        brightnessMenuPrevScreen = currentScreen;
        brightnessMenuPrevInMenu = inMenu;
        brightnessMenuPrevBacklight = backlightPercent;
        brightnessMenuPrevThemeHue = menuThemeHue;
        brightnessMenuPrevStyleMode = tftStyleMode;
        brightnessMenuActive = true;
        brightnessMenuValue = backlightPercent;
        brightnessMenuOpenedMs = now;
        inMenu = true;
        drawBrightnessMenu();
        longPressHandled = true;
        return;
      }
    }

