tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
    if (brightnessMenuActive) {
      handleBrightnessMenuTouch(x, y, isNewTap);
      return;
    }

    if (!isNewTap) {
      return;
    }

    if (currentScreen == SCREEN_UNLIS_HUNTER) {
      if (x >= UNLIS_EXIT_X && x < (UNLIS_EXIT_X + UNLIS_BTN_SIZE) &&
          y >= UNLIS_EXIT_Y && y < (UNLIS_EXIT_Y + UNLIS_BTN_SIZE)) {
        currentScreen = SCREEN_MATRIX_CLOCK;
        drawScreen(currentScreen);
        resetTftAutoSwitchTimer();
        return;
      }
      if (x >= UNLIS_START_X && x < (UNLIS_START_X + UNLIS_BTN_SIZE) &&
          y >= UNLIS_START_Y && y < (UNLIS_START_Y + UNLIS_BTN_SIZE)) {
        if (unlisRunning && !unlisGameOver) {
          unlisStopGame();
        } else {
          unlisStartResetGame();
        }
        return;
      }
      if (x >= UNLIS_PTT_X && x < (UNLIS_PTT_X + UNLIS_BTN_SIZE) &&
          y >= UNLIS_PTT_Y && y < (UNLIS_PTT_Y + UNLIS_BTN_SIZE)) {
        unlisHandlePttPress(now);
        return;
      }
      return;
    }

    if (inMenu) {
      if (currentScreen == SCREEN_HAM_CLOCK) {
        handleScreen1MenuTouch(x, y);
      }
      if (currentScreen == SCREEN_DX_CLUSTER) {
        handleScreen2MenuTouch(x, y);
      }
      if (currentScreen == SCREEN_POTA_CLUSTER) {
        handleScreen7MenuTouch(x, y);
      }
      if (currentScreen == SCREEN_HAMALERT_CLUSTER) {
        handleScreen8MenuTouch(x, y);
      }
      if (currentScreen == SCREEN_APRS_IS || currentScreen == SCREEN_APRS_RADAR) {
        handleScreen6MenuTouch(x, y);
      }
      return;
    }

    if (currentScreen == SCREEN_DX_CLUSTER) {
      if (x < menuHitW && y < menuHitH) {
          inMenu = true;
          drawDxClusterFilterMenu();
          return;
        }
      }
    if (currentScreen == SCREEN_POTA_CLUSTER) {
        if (x < menuHitW && y < menuHitH) {
          inMenu = true;
          drawPotaFilterMenu();
          return;
        }
      }
    if (currentScreen == SCREEN_HAMALERT_CLUSTER) {
        if (x < menuHitW && y < menuHitH) {
          inMenu = true;
          drawHamalertFilterMenu();
          return;
        }
      }
      if (currentScreen == SCREEN_APRS_IS) {
      if (x < menuHitW && y < menuHitH) {
        inMenu = true;
        screen6MenuBeaconingTemp = aprsBeaconEnabled;
        screen6MenuAprsAlertTemp = aprsAlertEnabled;
        screen6MenuRangeAlertTemp = aprsAlertNearbyEnabled;
        screen6MenuLedAlertTemp = enableLedAlert;
        drawAprsSortMenu();
        return;
      }
    }
      if (currentScreen == SCREEN_APRS_RADAR) {
      if (isScreen6RadarZoomTopHit(x, y)) {
        if ((now - screen6RadarLastZoomTapMs) < SCREEN6_RADAR_ZOOM_TAP_COOLDOWN_MS) {
          return;
        }
        screen6RadarLastZoomTapMs = now;
        float newZoom = min(SCREEN6_RADAR_ZOOM_MAX, screen6RadarZoom + SCREEN6_RADAR_ZOOM_STEP);
        if (newZoom > screen6RadarZoom + 0.0001f) {
          screen6RadarZoom = newZoom;
          triggerScreen6RadarHint();
          drawScreen(SCREEN_APRS_RADAR);
          resetTftAutoSwitchTimer();
        }
        return;
      }
      if (isScreen6RadarZoomBottomHit(x, y)) {
        if ((now - screen6RadarLastZoomTapMs) < SCREEN6_RADAR_ZOOM_TAP_COOLDOWN_MS) {
          return;
        }
        screen6RadarLastZoomTapMs = now;
        float newZoom = max(SCREEN6_RADAR_ZOOM_MIN, screen6RadarZoom - SCREEN6_RADAR_ZOOM_STEP);
        if (newZoom < screen6RadarZoom - 0.0001f) {
          screen6RadarZoom = newZoom;
          triggerScreen6RadarHint();
          drawScreen(SCREEN_APRS_RADAR);
          resetTftAutoSwitchTimer();
        }
        return;
      }
      if (x < menuHitW && y < menuHitH) {
        inMenu = true;
        screen6MenuBeaconingTemp = aprsBeaconEnabled;
        screen6MenuAprsAlertTemp = aprsAlertEnabled;
        screen6MenuRangeAlertTemp = aprsAlertNearbyEnabled;
        screen6MenuLedAlertTemp = enableLedAlert;
        drawAprsSortMenu();
        return;
      }
    }
    if (currentScreen == SCREEN_HAM_CLOCK) {
      if (x > 285 && y < 35) {
        inMenu = true;
        drawHamClockTimeMenu();
        return;
      }
    }

    if (currentScreen == SCREEN_LOKALIZACJA) {
      if (isLokalizacjaSaveButtonHit(x, y)) {
        unsigned long nowGps = millis();
        bool gpsReadyToSave = isGpsUartActive(nowGps) && isGpsFixActive(nowGps) && gpsLocationValid;
        if (gpsReadyToSave) {
          userLat = gpsLatitude;
          userLon = gpsLongitude;
          userLatLonValid = true;
          savePreferences();
          Serial.printf("[GPS] Zapisano pozycje stacji z GPS: LAT=%.6f LON=%.6f\n", userLat, userLon);
        } else {
          Serial.println("[GPS] Nie zapisano pozycji: wymagany aktywny GPS + FIX + poprawne LAT/LON");
        }
        drawLokalizacja();
        resetTftAutoSwitchTimer();
        autoswitchPausedUntilMs = 0;
        return;
      }
    }

    // Nawigacja: dolne obszary dotyku (ok. 80x180)
    const uint16_t cornerY = 60;
    const uint16_t cornerX = 80;
    if (y >= cornerY && x < cornerX) {
      currentScreen = getPrevScreenId(currentScreen);
      drawScreen(currentScreen);
      resetTftAutoSwitchTimer();
      autoswitchPausedUntilMs = 0;
      LOGV_PRINTF("[TOUCH] Ekran zmieniony na: %d (tap left)\n", currentScreen);
    } else if (y >= cornerY && x >= (320 - cornerX)) {
      currentScreen = getNextScreenId(currentScreen);
      drawScreen(currentScreen);
      resetTftAutoSwitchTimer();
      autoswitchPausedUntilMs = 0;
      LOGV_PRINTF("[TOUCH] Ekran zmieniony na: %d (tap right)\n", currentScreen);
    } else if (y >= cornerY && x >= cornerX && x < (320 - cornerX)) {
      // środek ekranu: pauzuj autoswitch na 10 sekund
      autoswitchPausedUntilMs = millis() + 10000UL;
      LOGV_PRINTF("[TOUCH] Autoswitch zapauzowany na 10s (tap center)\n");
    }
  } else {
    touchActive = false;
    longPressHandled = false;
    matrixGameHoldCandidate = false;
    // Reset liczników long-press dla menu jasności po puszczeniu dotyku
    if (brightnessMenuActive) {
      brightnessMenuTouchStartMs = 0;
      brightnessMenuLongPressHandled = false;
    }
  }
}
// Ekran 2: DX Cluster
void drawDxCluster() {
  tft.fillScreen(tftUiPalette.bg);

  // 1. NAGĹĂ“WEK: Belka z menu, nazwÄ… klastra i czasem UTC
  tft.fillRect(0, 0, 320, 32, tftHeaderBgColor());
  tft.setTextColor(tftHeaderTextColor());

// IKONA MENU (3D)
drawHamburgerMenuButton3D(5, 7);

