tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
// Nazwa klastra - przesuniÄ™ta w prawo (x=35 zamiast 5), by zrobiÄ‡ miejsce na menu
tft.setTextSize(2);
tft.setCursor(35, 8);
tft.print(clusterHost);
  
  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuffer[10];
    strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setCursor(315 - timeWidth, 8);
    tft.print(timeBuffer);
  }

  // 2. NAGĹĂ“WKI TABELI
  const bool enlarged = isDxTableEnlarged();
  int yPos = 40;
  tft.setTextColor(tftUiPalette.muted);
  tft.setTextSize(1);

  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(191, yPos); tft.print("MHz");
    tft.setCursor(274, yPos); tft.print("MODE");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("MHz");
    tft.setCursor(182, yPos); tft.print("MODE");
    tft.setCursor(212, yPos); tft.print(tr(TR_COUNTRY));
  }
  tft.drawFastHLine(0, yPos + 10, 320, tftUiPalette.muted);
  yPos += enlarged ? 20 : 18;

  // 3. LISTA SPOTĂ“W
  int maxRows = getDxTableMaxRows();
  int displayCount = 0;
  lockDxSpots();
  for (int i = 0; i < spotCount && displayCount < maxRows; i++) {
    if (!spotMatchesScreen2Filters(spots[i])) {
      continue;
    }
    if (enlarged) {
      if (displayCount % 2 == 0) tft.fillRect(0, yPos - 5, 320, 24, tftUiPalette.rowAlt);
      tft.setTextSize(2);
      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      tft.print(formatSpotUtc(spots[i].time));

      tft.setTextColor(tftUiPalette.fg);
      tft.setCursor(74, yPos);
      String callText = spots[i].callsign;
      if (callText.length() > 9) callText = callText.substring(0, 9);
      tft.print(callText);

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(191, yPos);
      tft.print(spots[i].frequency / 1000.0, 3);

      tft.setTextColor(tftTableModeColor());
      tft.setCursor(274, yPos);
      String modeText = spots[i].mode;
      if (modeText.length() > 4) modeText = modeText.substring(0, 4);
      tft.print(modeText);
      yPos += 27;
    } else {
      if (displayCount % 2 == 0) tft.fillRect(0, yPos - 2, 320, 16, tftUiPalette.rowAlt);

      tft.setTextSize(1);
      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      tft.print(formatSpotUtc(spots[i].time));

      tft.setTextColor(tftUiPalette.fg);
      tft.setCursor(50, yPos);
      tft.print(spots[i].callsign);

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(125, yPos);
      tft.print(spots[i].frequency / 1000.0, 3);

      tft.setTextColor(tftTableModeColor());
      tft.setCursor(182, yPos);
      tft.print(spots[i].mode);

      tft.setTextColor(tftTableAccentTextColor());
      tft.setCursor(212, yPos);
      String countryText = formatDistanceOrCountry(spots[i], COUNTRY_COL_MAX_LEN);
      tft.print(countryText);

      yPos += 17;
    }
    displayCount++;
  }
  unlockDxSpots();

  // 4. Pasek nawigacji widoczny tylko przez 5 sekund od wejścia na ekran
  if (isTableNavFooterVisible(SCREEN_DX_CLUSTER)) {
    drawSwitchScreenFooter();
  }

  if (displayCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR SPOTS...");
  }
}

bool isPointInRect(uint16_t x, uint16_t y, int rx, int ry, int rw, int rh) {
  return (x >= rx && x <= (rx + rw) && y >= ry && y <= (ry + rh));
}

void drawHamburgerMenuButton3D(int x, int y) {
  const int iconW = 20;
  const int iconH = 17;
  const int pad = 3;
  const int btnX = x - pad;
  const int btnY = y - pad;
  const int btnW = iconW + (pad * 2);
  const int btnH = iconH + (pad * 2);
  const uint16_t edgeLight = lerpColor565(TFT_WHITE, TFT_RADIO_ORANGE, 140);
  const uint16_t edgeShadow = lerpColor565(TFT_BLACK, TFT_RADIO_ORANGE, 115);

  tft.fillRoundRect(btnX, btnY, btnW, btnH, 3, TFT_RADIO_ORANGE);
  tft.drawRoundRect(btnX, btnY, btnW, btnH, 3, edgeLight);
  tft.drawLine(btnX + 1, btnY + btnH - 1, btnX + btnW - 2, btnY + btnH - 1, edgeShadow);
  tft.drawLine(btnX + btnW - 1, btnY + 1, btnX + btnW - 1, btnY + btnH - 2, edgeShadow);

  tft.fillRect(x, y, iconW, 3, TFT_BLACK);
  tft.fillRect(x, y + 7, iconW, 3, TFT_BLACK);
  tft.fillRect(x, y + 14, iconW, 3, TFT_BLACK);
}

static void drawScreen6ViewToggleButton3D(int x, int y, Screen6ViewMode mode) {
  const int iconW = 20;
  const int iconH = 17;
  const int pad = 3;
  const int btnX = x - pad;
  const int btnY = y - pad;
  const int btnW = iconW + (pad * 2);
  const int btnH = iconH + (pad * 2);
  const uint16_t edgeLight = lerpColor565(TFT_WHITE, TFT_RADIO_ORANGE, 140);
  const uint16_t edgeShadow = lerpColor565(TFT_BLACK, TFT_RADIO_ORANGE, 115);

  tft.fillRoundRect(btnX, btnY, btnW, btnH, 3, TFT_RADIO_ORANGE);
  tft.drawRoundRect(btnX, btnY, btnW, btnH, 3, edgeLight);
  tft.drawLine(btnX + 1, btnY + btnH - 1, btnX + btnW - 2, btnY + btnH - 1, edgeShadow);
  tft.drawLine(btnX + btnW - 1, btnY + 1, btnX + btnW - 1, btnY + btnH - 2, edgeShadow);

  tft.setTextSize(2);
  tft.setTextColor(TFT_BLACK);
  tft.setCursor(x + 6, y + 1);
  tft.print(mode == APRS_VIEW_RADAR ? "L" : "R");
}

static bool isScreen6ViewToggleHit(uint16_t x, uint16_t y) {
  return (x >= SCREEN6_VIEW_BTN_HIT_X &&
          x <= (SCREEN6_VIEW_BTN_HIT_X + SCREEN6_VIEW_BTN_HIT_W) &&
          y >= SCREEN6_VIEW_BTN_HIT_Y &&
          y <= (SCREEN6_VIEW_BTN_HIT_Y + SCREEN6_VIEW_BTN_HIT_H));
}

static bool isScreen6RadarZoomTopHit(uint16_t x, uint16_t y) {
  if (currentScreen != SCREEN_APRS_RADAR) {
    return false;
  }
  int w = tft.width();
  int h = tft.height();
  int xMin = w / 4;
  int xMax = (3 * w) / 4;
  return (x >= xMin && x <= xMax && y < (h / 2));
}

static bool isScreen6RadarZoomBottomHit(uint16_t x, uint16_t y) {
  if (currentScreen != SCREEN_APRS_RADAR) {
    return false;
  }
  int w = tft.width();
  int h = tft.height();
  int xMin = w / 4;
  int xMax = (3 * w) / 4;
  return (x >= xMin && x <= xMax && y >= (h / 2));
}

