tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
static void triggerScreen6RadarHint() {
  screen6RadarHintUntilMs = millis() + SCREEN6_RADAR_HINT_DURATION_MS;
}

static bool isScreen6RadarHintVisible() {
  return (currentScreen == SCREEN_APRS_RADAR && millis() < screen6RadarHintUntilMs);
}

static void drawScreen6RadarZoomHints() {
  if (!isScreen6RadarHintVisible()) {
    return;
  }

  const bool lightTheme = isTftStyleLight();
  const uint16_t radarBgColor = lightTheme ? TFT_WHITE : TFT_BLACK;
  const uint16_t radarTextColor = lightTheme ? tftUiPalette.fg : TFT_LIGHTGREY;
  const uint16_t hintTextColor = lightTheme ? TFT_NAVY : TFT_YELLOW;

  const int screenW = tft.width();
  const int screenH = tft.height();
  const char *topHint = "ZOOM +";
  const char *bottomHint = "ZOOM -";
  const int topW = (int)strlen(topHint) * 12;
  const int bottomW = (int)strlen(bottomHint) * 12;

  tft.setTextSize(2);
  tft.setTextColor(hintTextColor);
  tft.setCursor((screenW - topW) / 2, 6);
  tft.print(topHint);
  tft.setCursor((screenW - bottomW) / 2, screenH - 20);
  tft.print(bottomHint);

  const uint16_t radarAlertColor = rgb565(70, 130, 190);
  int zoomPercent = (int)(screen6RadarZoom * 100.0f + 0.5f);
  float radarVisibleMaxKm = (screen6RadarZoom > 0.0f)
                              ? ((float)aprsFilterRadius / screen6RadarZoom)
                              : (float)aprsFilterRadius;

  String zoomInfo = String("ZOOM:") + String(zoomPercent) + "%";
  String rmaxInfo = String("Rmax:") + String(radarVisibleMaxKm, 1) + "km";
  String alertInfo = String("ALERT:") + String(aprsAlertDistanceKm, 1) + "km";

  const int infoX = 2;
  const int zoomY = screenH - 29;
  const int rmaxY = screenH - 19;
  const int alertY = screenH - 9;

  tft.setTextSize(1);

  int zoomW = (int)zoomInfo.length() * 6;
  int rmaxW = (int)rmaxInfo.length() * 6;
  int alertW = (int)alertInfo.length() * 6;

  tft.fillRect(infoX - 1, zoomY - 1, zoomW + 2, 10, radarBgColor);
  tft.fillRect(infoX - 1, rmaxY - 1, rmaxW + 2, 10, radarBgColor);
  tft.fillRect(infoX - 1, alertY - 1, alertW + 2, 10, radarBgColor);

  tft.setTextColor(radarTextColor);
  tft.setCursor(infoX, zoomY);
  tft.print(zoomInfo);

  tft.setCursor(infoX, rmaxY);
  tft.print(rmaxInfo);

  tft.setTextColor(radarAlertColor);
  tft.setCursor(infoX, alertY);
  tft.print(alertInfo);
}

static uint16_t getAprsRadarColorForStation(const APRSStation &station) {
  String symbolShort = getAPRSSymbolShort(station);
  if (isTftStyleLight()) {
    return (symbolShort == "CAR") ? TFT_RED : TFT_BLACK;
  }
  if (symbolShort == "CAR") return TFT_RED;
  if (symbolShort == "HOUSE") return TFT_YELLOW;
  if (symbolShort == "HUMAN") return 0x3C1F;
  if (symbolShort == "HAMCLOCK") return TFT_ORANGE;
  return TFT_GREEN;
}

static void drawAprsRadarBody() {
  const int screenW = tft.width();
  const int screenH = tft.height();
  const bool lightTheme = isTftStyleLight();
  const uint16_t radarBgColor = lightTheme ? TFT_WHITE : TFT_BLACK;
  const uint16_t radarMainRingColor = lightTheme ? TFT_BLACK : TFT_WHITE;
  const uint16_t radarTextColor = lightTheme ? tftUiPalette.fg : TFT_LIGHTGREY;
  const uint16_t crossColor = lightTheme ? TFT_DARKGREY : 0x39C7;
  tft.fillRect(0, 0, screenW, screenH, radarBgColor);

  const int centerX = screenW / 2;
  const int centerY = screenH / 2;
  const int pad = 6;
  int baseOuterRadius = min(min(centerX - pad, screenW - centerX - pad),
                            min(centerY - pad, screenH - centerY - pad));
  if (baseOuterRadius < 20) {
    baseOuterRadius = 20;
  }

  int outerRadius = (int)(baseOuterRadius * screen6RadarZoom);
  if (outerRadius < 20) {
    outerRadius = 20;
  }

  const int fixedOuterRadius = baseOuterRadius; // nowy, stały wizualnie pierścień 100%
  const int fixedHalfRadius = max(1, fixedOuterRadius / 2); // nowy, stały wizualnie pierścień 50%

  const float zoomSafe = (screen6RadarZoom > 0.01f) ? screen6RadarZoom : 0.01f;
  const float fixedOuterKm = (aprsFilterRadius > 0)
                              ? ((float)aprsFilterRadius / zoomSafe)
                              : 0.0f;

  const uint16_t radarCircleBgColor = radarBgColor;
  const uint16_t radarAlertColor = rgb565(70, 130, 190);
  const uint16_t ringColor = TFT_DARKGREY;
  const int innerRadius = (aprsFilterRadius > 0)
                            ? (int)((aprsAlertDistanceKm / (float)aprsFilterRadius) * outerRadius)
                            : 0;
  const int clampedInnerRadius = constrain(innerRadius, 1, outerRadius);

  if (outerRadius <= baseOuterRadius + 2) {
    tft.fillCircle(centerX, centerY, outerRadius - 1, radarCircleBgColor);
  }

  // Dodane stałe pierścienie referencyjne na spodzie (stacje są rysowane później, nad nimi)
  tft.drawCircle(centerX, centerY, fixedOuterRadius, ringColor); // 100%
  tft.drawCircle(centerX, centerY, fixedHalfRadius, ringColor);  // 50%

  // Oryginalne okręgi radaru
  tft.drawCircle(centerX, centerY, outerRadius, radarMainRingColor);
  tft.drawCircle(centerX, centerY, clampedInnerRadius, radarAlertColor);

  tft.drawFastVLine(centerX, centerY - outerRadius, outerRadius * 2, crossColor);
  tft.drawFastHLine(centerX - outerRadius, centerY, outerRadius * 2, crossColor);

  auto kmLabel = [](float km) -> String {
    if (km >= 100.0f) return String((int)(km + 0.5f)) + "km";
    if (km >= 10.0f) return String(km, 1) + "km";
    return String(km, 2) + "km";
  };

  tft.setTextSize(1);
  tft.setTextColor(radarTextColor);
  String ring100Text = kmLabel(fixedOuterKm);
  String ring50Text = kmLabel(fixedOuterKm * 0.5f);

  int ringLabelX = centerX + 4;
  int ring100Y = max(0, centerY - fixedOuterRadius + 2);
  int ring50Y = max(0, centerY - fixedHalfRadius + 2);

  tft.fillRect(ringLabelX - 1, ring100Y - 1, (int)ring100Text.length() * 6 + 2, 10, radarCircleBgColor);
  tft.fillRect(ringLabelX - 1, ring50Y - 1, (int)ring50Text.length() * 6 + 2, 10, radarCircleBgColor);
  tft.setCursor(ringLabelX, ring100Y);
  tft.print(ring100Text);
  tft.setCursor(ringLabelX, ring50Y);
  tft.print(ring50Text);

