tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  tft.fillCircle(centerX, centerY, 4, TFT_RADIO_ORANGE);

  int order[MAX_APRS_DISPLAY_LCD];
  int displayCount = 0;
  buildAprsDisplayOrder(order, displayCount);
  int maxRows = min(displayCount, MAX_APRS_DISPLAY_LCD);

  for (int i = 0; i < maxRows; i++) {
    const APRSStation &station = aprsStations[order[i]];
    if (!station.hasLatLon || station.distance <= 0.0f) {
      continue;
    }
    if (aprsFilterRadius <= 0 || station.distance > (float)aprsFilterRadius) {
      continue;
    }

    double radarUserLat = 0.0;
    double radarUserLon = 0.0;
    if (!getServiceCoordinatesForServices(radarUserLat, radarUserLon)) {
      continue;
    }
    float bearingDeg = calculateBearing(radarUserLat, radarUserLon, (double)station.lat, (double)station.lon);
    float angleRad = bearingDeg * (float)M_PI / 180.0f;
    float scaledRadius = (station.distance / (float)aprsFilterRadius) * outerRadius;
    if (scaledRadius > outerRadius) {
      continue;
    }
    int px = centerX + (int)(sin(angleRad) * scaledRadius);
    int py = centerY - (int)(cos(angleRad) * scaledRadius);

    uint16_t color = getAprsRadarColorForStation(station);
    tft.fillCircle(px, py, 3, color);

    String call = station.callsign;
    if (call.length() > 8) {
      call = call.substring(0, 8);
    }
    int tx = px - ((int)call.length() * 3);
    int ty = py - 10;
    if (tx < 1) tx = 1;
    if (tx > screenW - ((int)call.length() * 6) - 1) tx = screenW - ((int)call.length() * 6) - 1;
    if (ty < 2) ty = py + 6;
    if (ty > screenH - 9) ty = screenH - 9;

    uint16_t labelColor = lightTheme ? TFT_NAVY : color;
    tft.setTextColor(labelColor);
    tft.setTextSize(1);
    tft.setCursor(tx, ty);
    tft.print(call);

    if ((i & 0x03) == 0) {
      yield();
    }
  }

}

void drawFilterTile(int x, int y, int w, int h, const char *label, bool active) {
  uint16_t fill = active ? TFT_RADIO_ORANGE : TFT_DARKGREY;
  uint16_t text = active ? TFT_BLACK : TFT_WHITE;
  tft.fillRect(x, y, w, h, fill);
  tft.drawRect(x, y, w, h, TFT_BLACK);
  tft.setTextSize(1);
  tft.setTextColor(text);
  int textW = strlen(label) * 6;
  int textX = x + (w - textW) / 2;
  int textY = y + (h - 8) / 2;
  tft.setCursor(textX, textY);
  tft.print(label);
}

static void drawScreen6MenuCheckButton(int x, int y, const char *label, bool checked) {
  const int boxSize = 18;
  tft.drawRect(x, y, boxSize, boxSize, TFT_WHITE);
  if (checked) {
    tft.fillRect(x + 4, y + 4, boxSize - 8, boxSize - 8, TFT_RADIO_ORANGE);
  } else {
    tft.fillRect(x + 1, y + 1, boxSize - 2, boxSize - 2, TFT_BLACK);
  }

  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(x + boxSize + 10, y + 2);
  tft.print(label);
}

void drawDxClusterFilterMenu() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(10, 6);
  tft.print("FILTERS");

  tft.setTextSize(1);
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 28);
  tft.print("MODE");

  const int modeTileW = 70;
  const int modeTileH = 26;
  const int modeGap = 6;
  const int modeStartX = (320 - (4 * modeTileW + 3 * modeGap)) / 2;
  const int modeY = 40;
  drawFilterTile(modeStartX + 0 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "ALL", isModeFilterTileSelected(screen2FilterModeMask, FILTER_MODE_ALL));
  drawFilterTile(modeStartX + 1 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "CW", isModeFilterTileSelected(screen2FilterModeMask, FILTER_MODE_CW));
  drawFilterTile(modeStartX + 2 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "SSB", isModeFilterTileSelected(screen2FilterModeMask, FILTER_MODE_SSB));
  drawFilterTile(modeStartX + 3 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "DIGI", isModeFilterTileSelected(screen2FilterModeMask, FILTER_MODE_DIGI));

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 82);
  tft.print("BAND");

  const int bandTileW = 72;
  const int bandTileH = 24;
  const int bandGap = 6;
  const int bandStartX = (320 - (4 * bandTileW + 3 * bandGap)) / 2;
  const int bandStartY = 96;
  int bandIdx = 0;
  for (int row = 0; row < 3; row++) {
    for (int col = 0; col < 4; col++) {
      if (bandIdx >= SCREEN8_FILTER_BANDS_COUNT) break;
      int x = bandStartX + col * (bandTileW + bandGap);
      int y = bandStartY + row * (bandTileH + bandGap);
      drawFilterTile(x, y, bandTileW, bandTileH, SCREEN8_FILTER_BANDS[bandIdx], isBandFilterTileSelected(screen2FilterBandMask, bandIdx));
      bandIdx++;
    }
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (320 - closeW) / 2;
  const int closeY = 210;
  drawFilterTile(closeX, closeY, closeW, closeH, "CLOSE", false);
}

void handleScreen2MenuTouch(uint16_t x, uint16_t y) {
  const int modeTileW = 70;
  const int modeTileH = 26;
  const int modeGap = 6;
  const int modeStartX = (320 - (4 * modeTileW + 3 * modeGap)) / 2;
  const int modeY = 40;

  for (int i = 0; i < 4; i++) {
    int rx = modeStartX + i * (modeTileW + modeGap);
    if (isPointInRect(x, y, rx, modeY, modeTileW, modeTileH)) {
      toggleModeFilterSelection(screen2FilterModeMask, i);
      drawDxClusterFilterMenu();
      return;
    }
  }

  const int bandTileW = 72;
  const int bandTileH = 24;
  const int bandGap = 6;
  const int bandStartX = (320 - (4 * bandTileW + 3 * bandGap)) / 2;
  const int bandStartY = 96;
  int bandIdx = 0;
  for (int row = 0; row < 3; row++) {
    for (int col = 0; col < 4; col++) {
      if (bandIdx >= SCREEN8_FILTER_BANDS_COUNT) break;
      int rx = bandStartX + col * (bandTileW + bandGap);
      int ry = bandStartY + row * (bandTileH + bandGap);
      if (isPointInRect(x, y, rx, ry, bandTileW, bandTileH)) {
        toggleBandFilterSelection(screen2FilterBandMask, bandIdx);
        drawDxClusterFilterMenu();
        return;
      }
      bandIdx++;
    }
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (320 - closeW) / 2;
  const int closeY = 210;
  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    savePreferences();
    inMenu = false;
    drawScreen(SCREEN_DX_CLUSTER);
    return;
  }
}

