tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
void drawAprsSortMenu() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(10, 4);
  tft.print("SORT BY:");

  const int tileW = 90;
  const int tileH = 26;
  const int gap = 6;
  const int startX = (320 - (3 * tileW + 2 * gap)) / 2;
  const int tileY = 32;
  drawFilterTile(startX + 0 * (tileW + gap), tileY, tileW, tileH, "TIME", screen6SortMode == APRS_SORT_TIME);
  drawFilterTile(startX + 1 * (tileW + gap), tileY, tileW, tileH, "CALL", screen6SortMode == APRS_SORT_CALLSIGN);
  drawFilterTile(startX + 2 * (tileW + gap), tileY, tileW, tileH, "DIST", screen6SortMode == APRS_SORT_DISTANCE);

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(2);
  tft.setCursor(10, 74);
  tft.print("APRS Setting:");

  const int checkX = 34;
  const int checkRowY0 = 94;
  const int checkRowGap = 28;
  drawScreen6MenuCheckButton(checkX, checkRowY0 + 0 * checkRowGap, "Beaconing", screen6MenuBeaconingTemp);
  drawScreen6MenuCheckButton(checkX, checkRowY0 + 1 * checkRowGap, "APRS Alert", screen6MenuAprsAlertTemp);
  drawScreen6MenuCheckButton(checkX, checkRowY0 + 2 * checkRowGap, "Range Alert", screen6MenuRangeAlertTemp);
  drawScreen6MenuCheckButton(checkX, checkRowY0 + 3 * checkRowGap, "LED / Buzzer", screen6MenuLedAlertTemp);

  const int closeW = 100;
  const int saveW = 100;
  const int closeH = 26;
  const int closeX = 54;
  const int saveX = 166;
  const int closeY = 210;
  drawFilterTile(closeX, closeY, closeW, closeH, "CLOSE", false);
  drawFilterTile(saveX, closeY, saveW, closeH, "SAVE", false);
}

void handleScreen6MenuTouch(uint16_t x, uint16_t y) {
  const int tileW = 90;
  const int tileH = 26;
  const int gap = 6;
  const int startX = (320 - (3 * tileW + 2 * gap)) / 2;
  const int tileY = 32;

  if (isPointInRect(x, y, startX + 0 * (tileW + gap), tileY, tileW, tileH)) {
    screen6SortMode = APRS_SORT_TIME;
    drawAprsSortMenu();
    return;
  }
  if (isPointInRect(x, y, startX + 1 * (tileW + gap), tileY, tileW, tileH)) {
    screen6SortMode = APRS_SORT_CALLSIGN;
    drawAprsSortMenu();
    return;
  }
  if (isPointInRect(x, y, startX + 2 * (tileW + gap), tileY, tileW, tileH)) {
    screen6SortMode = APRS_SORT_DISTANCE;
    drawAprsSortMenu();
    return;
  }

  const int checkX = 34;
  const int checkRowY0 = 94;
  const int checkRowGap = 28;
  const int checkHitW = 250;
  const int checkHitH = 22;

  if (isPointInRect(x, y, checkX, checkRowY0 + 0 * checkRowGap, checkHitW, checkHitH)) {
    screen6MenuBeaconingTemp = !screen6MenuBeaconingTemp;
    drawAprsSortMenu();
    return;
  }
  if (isPointInRect(x, y, checkX, checkRowY0 + 1 * checkRowGap, checkHitW, checkHitH)) {
    screen6MenuAprsAlertTemp = !screen6MenuAprsAlertTemp;
    drawAprsSortMenu();
    return;
  }
  if (isPointInRect(x, y, checkX, checkRowY0 + 2 * checkRowGap, checkHitW, checkHitH)) {
    screen6MenuRangeAlertTemp = !screen6MenuRangeAlertTemp;
    drawAprsSortMenu();
    return;
  }
  if (isPointInRect(x, y, checkX, checkRowY0 + 3 * checkRowGap, checkHitW, checkHitH)) {
    screen6MenuLedAlertTemp = !screen6MenuLedAlertTemp;
    drawAprsSortMenu();
    return;
  }

  const int closeW = 100;
  const int saveW = 100;
  const int closeH = 26;
  const int closeX = 54;
  const int saveX = 166;
  const int closeY = 210;
  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    savePreferences();
    inMenu = false;
    drawScreen(currentScreen);
    return;
  }

  if (isPointInRect(x, y, saveX, closeY, saveW, closeH)) {
    aprsBeaconEnabled = screen6MenuBeaconingTemp;
    aprsAlertEnabled = screen6MenuAprsAlertTemp;
    aprsAlertNearbyEnabled = screen6MenuRangeAlertTemp;
    enableLedAlert = screen6MenuLedAlertTemp;
    savePreferences();
    inMenu = false;
    drawScreen(currentScreen);
    return;
  }
}

void drawPotaFilterMenu() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(10, 6);
  tft.print("POTA FILTERS");

  tft.setTextSize(1);
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 28);
  tft.print("MODE");

  const int modeTileW = 70;
  const int modeTileH = 26;
  const int modeGap = 6;
  const int modeStartX = (320 - (4 * modeTileW + 3 * modeGap)) / 2;
  const int modeY = 40;
  drawFilterTile(modeStartX + 0 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "ALL", isModeFilterTileSelected(screen7FilterModeMask, FILTER_MODE_ALL));
  drawFilterTile(modeStartX + 1 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "CW", isModeFilterTileSelected(screen7FilterModeMask, FILTER_MODE_CW));
  drawFilterTile(modeStartX + 2 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "SSB", isModeFilterTileSelected(screen7FilterModeMask, FILTER_MODE_SSB));
  drawFilterTile(modeStartX + 3 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "DIGI", isModeFilterTileSelected(screen7FilterModeMask, FILTER_MODE_DIGI));

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 82);
  tft.print("BAND");

  const int bandTileW = 90;
  const int bandTileH = 24;
  const int bandGap = 6;
  const int bandStartX = (320 - (3 * bandTileW + 2 * bandGap)) / 2;
  const int bandStartY = 96;
  int bandIdx = 0;
  for (int row = 0; row < 3; row++) {
    for (int col = 0; col < 3; col++) {
      if (bandIdx >= SCREEN2_FILTER_BANDS_COUNT) break;
      int x = bandStartX + col * (bandTileW + bandGap);
      int y = bandStartY + row * (bandTileH + bandGap);
      drawFilterTile(x, y, bandTileW, bandTileH, SCREEN2_FILTER_BANDS[bandIdx], isBandFilterTileSelected(screen7FilterBandMask, bandIdx));
      bandIdx++;
    }
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (320 - closeW) / 2;
  const int closeY = 210;
  drawFilterTile(closeX, closeY, closeW, closeH, "CLOSE", false);
}

void handleScreen7MenuTouch(uint16_t x, uint16_t y) {
  const int modeTileW = 70;
  const int modeTileH = 26;
  const int modeGap = 6;
  const int modeStartX = (320 - (4 * modeTileW + 3 * modeGap)) / 2;
  const int modeY = 40;

  for (int i = 0; i < 4; i++) {
    int rx = modeStartX + i * (modeTileW + modeGap);
    if (isPointInRect(x, y, rx, modeY, modeTileW, modeTileH)) {
      toggleModeFilterSelection(screen7FilterModeMask, i);
      drawPotaFilterMenu();
      return;
    }
  }

  const int bandTileW = 90;
  const int bandTileH = 24;
  const int bandGap = 6;
  const int bandStartX = (320 - (3 * bandTileW + 2 * bandGap)) / 2;
  const int bandStartY = 96;
  int bandIdx = 0;
  for (int row = 0; row < 3; row++) {
    for (int col = 0; col < 3; col++) {
      if (bandIdx >= SCREEN2_FILTER_BANDS_COUNT) break;
      int rx = bandStartX + col * (bandTileW + bandGap);
      int ry = bandStartY + row * (bandTileH + bandGap);
      if (isPointInRect(x, y, rx, ry, bandTileW, bandTileH)) {
        toggleBandFilterSelection(screen7FilterBandMask, bandIdx);
        drawPotaFilterMenu();
        return;
      }
      bandIdx++;
    }
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (320 - closeW) / 2;
  const int closeY = 210;
  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    savePreferences();
    inMenu = false;
    drawScreen(SCREEN_POTA_CLUSTER);
    return;
  }
}

void drawHamalertFilterMenu() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(10, 6);
  tft.print("HAMALERT FILTR");

  tft.setTextSize(1);
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 28);
  tft.print("MODE");

  const int modeTileW = 70;
  const int modeTileH = 26;
  const int modeGap = 6;
  const int modeStartX = (320 - (4 * modeTileW + 3 * modeGap)) / 2;
  const int modeY = 40;
  drawFilterTile(modeStartX + 0 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "ALL", isModeFilterTileSelected(screen8FilterModeMask, FILTER_MODE_ALL));
  drawFilterTile(modeStartX + 1 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "CW", isModeFilterTileSelected(screen8FilterModeMask, FILTER_MODE_CW));
  drawFilterTile(modeStartX + 2 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "SSB", isModeFilterTileSelected(screen8FilterModeMask, FILTER_MODE_SSB));
  drawFilterTile(modeStartX + 3 * (modeTileW + modeGap), modeY, modeTileW, modeTileH, "DIGI", isModeFilterTileSelected(screen8FilterModeMask, FILTER_MODE_DIGI));

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setCursor(10, 82);
  tft.print("BAND");

  const int bandTileW = 72;
  const int bandTileH = 24;
  const int bandGap = 6;
  const int bandStartX = (320 - (4 * bandTileW + 3 * bandGap)) / 2;
  const int bandStartY = 96;
  int bandIdx = 0;
  for (int row = 0; row < 3; row++) {
    for (int col = 0; col < 4; col++) {
      if (bandIdx >= SCREEN8_FILTER_BANDS_COUNT) break;
      int x = bandStartX + col * (bandTileW + bandGap);
      int y = bandStartY + row * (bandTileH + bandGap);
      drawFilterTile(x, y, bandTileW, bandTileH, SCREEN8_FILTER_BANDS[bandIdx], isBandFilterTileSelected(screen8FilterBandMask, bandIdx));
      bandIdx++;
    }
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (320 - closeW) / 2;
  const int closeY = 210;
  drawFilterTile(closeX, closeY, closeW, closeH, "CLOSE", false);
}

