tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
void handleScreen8MenuTouch(uint16_t x, uint16_t y) {
  const int modeTileW = 70;
  const int modeTileH = 26;
  const int modeGap = 6;
  const int modeStartX = (320 - (4 * modeTileW + 3 * modeGap)) / 2;
  const int modeY = 40;

  for (int i = 0; i < 4; i++) {
    int rx = modeStartX + i * (modeTileW + modeGap);
    if (isPointInRect(x, y, rx, modeY, modeTileW, modeTileH)) {
      toggleModeFilterSelection(screen8FilterModeMask, i);
      drawHamalertFilterMenu();
      return;
    }
  }

  const int bandTileW = 72;
  const int bandTileH = 24;
  const int bandGap = 6;
  const int bandStartX = (320 - (4 * bandTileW + 3 * bandGap)) / 2;
  const int bandStartY = 96;
  int bandIdx = 0;
  for (int row = 0; row < 3; row++) {
    for (int col = 0; col < 4; col++) {
      if (bandIdx >= SCREEN8_FILTER_BANDS_COUNT) break;
      int rx = bandStartX + col * (bandTileW + bandGap);
      int ry = bandStartY + row * (bandTileH + bandGap);
      if (isPointInRect(x, y, rx, ry, bandTileW, bandTileH)) {
        toggleBandFilterSelection(screen8FilterBandMask, bandIdx);
        drawHamalertFilterMenu();
        return;
      }
      bandIdx++;
    }
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (320 - closeW) / 2;
  const int closeY = 210;
  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    savePreferences();
    inMenu = false;
    drawScreen(SCREEN_HAMALERT_CLUSTER);
    return;
  }
}

void drawHamClockTimeMenu() {
  tft.fillScreen(TFT_BLACK);
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(2);
  tft.setCursor(10, 6);
  tft.print("TIME MODE");

  const int tileW = 110;
  const int tileH = 28;
  const int gap = 10;
  const int startX = (320 - (2 * tileW + gap)) / 2;
  const int tileY = 60;
  drawFilterTile(startX, tileY, tileW, tileH, "UTC", screen1TimeMode == SCREEN1_TIME_UTC);
  drawFilterTile(startX + tileW + gap, tileY, tileW, tileH, "LOCAL", screen1TimeMode == SCREEN1_TIME_LOCAL);

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (320 - closeW) / 2;
  const int closeY = 210;
  drawFilterTile(closeX, closeY, closeW, closeH, "CLOSE", false);
}

void handleScreen1MenuTouch(uint16_t x, uint16_t y) {
  const int tileW = 110;
  const int tileH = 28;
  const int gap = 10;
  const int startX = (320 - (2 * tileW + gap)) / 2;
  const int tileY = 60;

  if (isPointInRect(x, y, startX, tileY, tileW, tileH)) {
    screen1TimeMode = SCREEN1_TIME_UTC;
    savePreferences();
    drawHamClockTimeMenu();
    return;
  }
  if (isPointInRect(x, y, startX + tileW + gap, tileY, tileW, tileH)) {
    screen1TimeMode = SCREEN1_TIME_LOCAL;
    savePreferences();
    drawHamClockTimeMenu();
    return;
  }

  const int closeW = 100;
  const int closeH = 26;
  const int closeX = (320 - closeW) / 2;
  const int closeY = 210;
  if (isPointInRect(x, y, closeX, closeY, closeW, closeH)) {
    inMenu = false;
    drawScreen(SCREEN_HAM_CLOCK);
    return;
  }
}

void redrawCurrentMenu() {
  if (currentScreen == SCREEN_HAM_CLOCK) {
    drawHamClockTimeMenu();
    return;
  }
  if (currentScreen == SCREEN_DX_CLUSTER) {
    drawDxClusterFilterMenu();
    return;
  }
  if (currentScreen == SCREEN_APRS_IS || currentScreen == SCREEN_APRS_RADAR) {
    drawAprsSortMenu();
    return;
  }
}

void restoreAfterBrightnessMenu() {
  inMenu = brightnessMenuPrevInMenu;
  if (brightnessMenuPrevInMenu) {
    redrawCurrentMenu();
    return;
  }
  currentScreen = brightnessMenuPrevScreen;
  drawScreen(currentScreen);
}

void drawBrightnessSlider() {
  const int sliderX = 40;
  const int sliderY = 90;
  const int sliderW = 240;
  const int sliderH = 12;
  const int knobW = 6;

  // Wyczyść obszar suwaka (z zapasem na pokrętło), żeby nie zostawał ślad
  tft.fillRect(sliderX - knobW, sliderY - 6, sliderW + knobW * 2, sliderH + 12, TFT_BLACK);

  tft.drawRect(sliderX, sliderY, sliderW, sliderH, TFT_WHITE);
  int fillW = (brightnessMenuValue * (sliderW - 2)) / 100;
  tft.fillRect(sliderX + 1, sliderY + 1, sliderW - 2, sliderH - 2, TFT_BLACK);
  tft.fillRect(sliderX + 1, sliderY + 1, fillW, sliderH - 2, TFT_RADIO_ORANGE);

  int knobX = sliderX + (brightnessMenuValue * (sliderW - knobW)) / 100;
  tft.fillRect(knobX, sliderY - 4, knobW, sliderH + 8, TFT_WHITE);

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  tft.setCursor(10, 70);
  tft.print(tr(TR_BRIGHTNESS));
  tft.fillRect(120, 70, 40, 8, TFT_BLACK);
  tft.setCursor(120, 70);
  tft.print(brightnessMenuValue);
  tft.print("%");
}

void drawThemeSlider() {
  const int sliderX = 40;
  const int sliderY = 130;
  const int sliderW = 240;
  const int sliderH = 12;
  const int knobW = 6;

  // Wyczyść obszar suwaka (z zapasem na pokrętło)
  tft.fillRect(sliderX - knobW, sliderY - 6, sliderW + knobW * 2, sliderH + 12, TFT_BLACK);

  for (int i = 0; i < sliderW; i++) {
    uint8_t hue = (uint8_t)((i * 255) / (sliderW - 1));
    tft.drawFastVLine(sliderX + i, sliderY + 1, sliderH - 2, colorWheel(hue));
  }
  tft.drawRect(sliderX, sliderY, sliderW, sliderH, TFT_WHITE);

  int knobX = sliderX + (menuThemeHue * (sliderW - knobW)) / 255;
  tft.fillRect(knobX, sliderY - 4, knobW, sliderH + 8, TFT_WHITE);

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  tft.setCursor(10, 110);
  tft.print(tr(TR_THEME_COLOR));
}

void drawBrightnessMenuHeader() {
  const int themeBtnX = 248;
  const int themeBtnY = 4;
  const int themeBtnW = 68;
  const int themeBtnH = 20;

  tft.fillRect(0, 0, 320, 28, menuThemeColor);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(10, 6);
  tft.print(tr(TR_DISPLAY_SETTINGS));

  uint16_t btnFill = isTftStyleLight() ? TFT_WHITE : TFT_BLACK;
  uint16_t btnBorder = isTftStyleLight() ? TFT_BLACK : TFT_WHITE;
  uint16_t btnText = isTftStyleLight() ? TFT_BLACK : TFT_WHITE;
  const bool isPl = (tftLanguage == TFT_LANG_PL);
  const char *btnLabel = isPl
      ? (isTftStyleLight() ? "JASNY" : "CIEMNY")
      : (isTftStyleLight() ? "LIGHT" : "DARK");
  int textW = strlen(btnLabel) * 6;

  tft.fillRoundRect(themeBtnX, themeBtnY, themeBtnW, themeBtnH, 4, btnFill);
  tft.drawRoundRect(themeBtnX, themeBtnY, themeBtnW, themeBtnH, 4, btnBorder);
  tft.setTextSize(1);
  tft.setTextColor(btnText);
  tft.setCursor(themeBtnX + (themeBtnW - textW) / 2, themeBtnY + 6);
  tft.print(btnLabel);
}

void drawBrightnessMenu() {
  tft.fillScreen(TFT_BLACK);
  drawBrightnessMenuHeader();

