tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  // Podpowiedź: długi tap 3s w dowolnym miejscu uruchamia kalibrację
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  tft.setCursor(10, 40);
  tft.print(tr(TR_TFT_CALIBRATION_HINT));

  drawBrightnessSlider();
  drawThemeSlider();

  const int langLabelY = 150;
  const int langTileW = 70;
  const int langTileH = 22;
  const int langGap = 10;
  const int langStartX = (320 - (2 * langTileW + langGap)) / 2;
  const int langY = 160;

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  tft.setCursor(10, langLabelY);
  tft.print(tr(TR_LANGUAGE));
  drawFilterTile(langStartX, langY, langTileW, langTileH, "PL", tftLanguage == TFT_LANG_PL);
  drawFilterTile(langStartX + langTileW + langGap, langY, langTileW, langTileH, "EN", tftLanguage == TFT_LANG_EN);

  const int btnW = 90;
  const int btnH = 26;
  const int btnY = 190;
  drawFilterTile(10, btnY, btnW, btnH, tr(TR_SAVE), false);
  drawFilterTile(115, btnY, btnW, btnH, tr(TR_DEFAULT), false);
  drawFilterTile(220, btnY, btnW, btnH, tr(TR_CLOSE), false);
}

void drawTouchCalTarget(int cx, int cy, uint16_t color) {
  tft.drawLine(cx - 10, cy, cx + 10, cy, color);
  tft.drawLine(cx, cy - 10, cx, cy + 10, color);
  tft.drawRect(cx - 12, cy - 12, 24, 24, color);
}

void drawTouchCalibrationScreen() {
  tft.fillScreen(TFT_BLACK);

  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(1);
  int centerY = 120;
  
  if (touchCalStep == 0) {
    tft.setCursor(40, centerY);
    tft.print("Touch target 1/4 (top-left)");
    drawTouchCalTarget(20, 20, TFT_RADIO_ORANGE);
  } else if (touchCalStep == 1) {
    tft.setCursor(35, centerY);
    tft.print("Touch target 2/4 (top-right)");
    drawTouchCalTarget(300, 20, TFT_RADIO_ORANGE);
  } else if (touchCalStep == 2) {
    tft.setCursor(30, centerY);
    tft.print("Touch target 3/4 (bottom-right)");
    drawTouchCalTarget(300, 220, TFT_RADIO_ORANGE);
  } else if (touchCalStep == 3) {
    tft.setCursor(35, centerY);
    tft.print("Touch target 4/4 (bottom-left)");
    drawTouchCalTarget(20, 220, TFT_RADIO_ORANGE);
  } else {
    // touchCalStep >= 4 - Review screen
    tft.setCursor(40, centerY);
    tft.print("Calibration complete - Touch to close");
    
    // Narysuj wszystkie 4 targets jako potwierdzenie
    drawTouchCalTarget(20, 20, TFT_DARKGREY);
    drawTouchCalTarget(300, 20, TFT_DARKGREY);
    drawTouchCalTarget(300, 220, TFT_DARKGREY);
    drawTouchCalTarget(20, 220, TFT_DARKGREY);
    
    tft.setTextColor(TFT_LIGHTGREY);
    tft.setCursor(10, 30);
    tft.print("Raw X: ");
    tft.print(touchCalNewXMin);
    tft.print(" - ");
    tft.print(touchCalNewXMax);
    tft.setCursor(10, 45);
    tft.print("Raw Y: ");
    tft.print(touchCalNewYMin);
    tft.print(" - ");
    tft.print(touchCalNewYMax);
    
    tft.setCursor(10, 65);
    tft.print("Detected: Swap:");
    tft.print(touchSwapXY ? "YES" : "NO");
    tft.print(" InvX:");
    tft.print(touchInvertX ? "YES" : "NO");
    tft.setCursor(10, 80);
    tft.print("          InvY:");
    tft.print(touchInvertY ? "YES" : "NO");
    
    // Podpowiedź do ustawienia w WWW
    tft.setTextColor(TFT_YELLOW);
    tft.setCursor(10, 145);
    tft.print("Use WWW panel >");
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(10, 160);
    tft.print(tr(TR_TFT_CALIBRATION_HINT));
    tft.setTextColor(TFT_GREENYELLOW);
    tft.setCursor(10, 180);
    
    // Ustal jaki tryb sugerować
    if (touchSwapXY && touchInvertX && touchInvertY) {
      tft.print("-> SWAP XY + INVERT BOTH");
    } else if (touchSwapXY && touchInvertX) {
      tft.print("-> ");
      tft.print(tr(TR_ROT_90_RIGHT));
    } else if (touchSwapXY && touchInvertY) {
      tft.print("-> ");
      tft.print(tr(TR_ROT_90_LEFT));
    } else if (touchSwapXY) {
      tft.print("-> SWAP XY");
    } else if (touchInvertX && touchInvertY) {
      tft.print("-> INVERT BOTH (180deg)");
    } else if (touchInvertX) {
      tft.print("-> INVERT X");
    } else if (touchInvertY) {
      tft.print("-> INVERT Y");
    } else {
      tft.print("-> NONE (default - OK)");
    }
    
    tft.setTextColor(TFT_LIGHTGREY);
    tft.setCursor(10, 210);
    tft.print("(Touch will NOT save changes)");
  }
}

void startTouchCalibration() {
  touchCalActive = true;
  touchCalStep = 0;
  touchCalRawX1 = 0;
  touchCalRawY1 = 0;
  touchCalRawX2 = 0;
  touchCalRawY2 = 0;
  touchCalRawX3 = 0;
  touchCalRawY3 = 0;
  touchCalRawX4 = 0;
  touchCalRawY4 = 0;
  touchCalNewXMin = touchXMin;
  touchCalNewXMax = touchXMax;
  touchCalNewYMin = touchYMin;
  touchCalNewYMax = touchYMax;
  drawTouchCalibrationScreen();
}

void setBrightnessFromTouch(uint16_t x) {
  const int sliderX = 40;
  const int sliderW = 240;
  int val = (int)((long)(x - sliderX) * 100 / (sliderW - 1));
  if (val < MIN_BACKLIGHT_PERCENT) val = MIN_BACKLIGHT_PERCENT;
  if (val > 100) val = 100;
  if (val != brightnessMenuValue) {
    brightnessMenuValue = val;
    setBacklightPercent(brightnessMenuValue);
    drawBrightnessSlider();
  }
}

void setThemeFromTouch(uint16_t x) {
  const int sliderX = 40;
  const int sliderW = 240;
  int val = (int)((long)(x - sliderX) * 255 / (sliderW - 1));
  if (val < 0) val = 0;
  if (val > 255) val = 255;
  uint8_t hue = (uint8_t)val;
  if (hue != menuThemeHue) {
    menuThemeHue = hue;
    applyMenuThemeFromHue();
    drawBrightnessMenuHeader();
    drawThemeSlider();
    drawBrightnessSlider();
  }
}

void handleTouchCalibrationTouch(int16_t rawX, int16_t rawY, uint16_t x, uint16_t y, bool isNewTap) {
  if (!touchCalActive || !isNewTap) {
    return;
  }

  if (touchCalStep == 0) {
    // Target 1: lewy górny (20, 20)
    touchCalRawX1 = rawX;
    touchCalRawY1 = rawY;
    touchCalStep = 1;
    drawTouchCalibrationScreen();
    return;
  }

  if (touchCalStep == 1) {
    // Target 2: prawy górny (300, 20)
    touchCalRawX2 = rawX;
    touchCalRawY2 = rawY;
    touchCalStep = 2;
    drawTouchCalibrationScreen();
    return;
  }

  if (touchCalStep == 2) {
    // Target 3: prawy dolny (300, 220)
    touchCalRawX3 = rawX;
    touchCalRawY3 = rawY;
    touchCalStep = 3;
    drawTouchCalibrationScreen();
    return;
  }

