tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  if (touchCalStep == 3) {
    // Target 4: lewy dolny (20, 220)
    touchCalRawX4 = rawX;
    touchCalRawY4 = rawY;
    
    // Wszystkie 4 punkty zebrane - oblicz parametry
    // Min/Max ze wszystkich 4 punktów surowych
    touchCalNewXMin = min(min(touchCalRawX1, touchCalRawX2), min(touchCalRawX3, touchCalRawX4));
    touchCalNewXMax = max(max(touchCalRawX1, touchCalRawX2), max(touchCalRawX3, touchCalRawX4));
    touchCalNewYMin = min(min(touchCalRawY1, touchCalRawY2), min(touchCalRawY3, touchCalRawY4));
    touchCalNewYMax = max(max(touchCalRawY1, touchCalRawY2), max(touchCalRawY3, touchCalRawY4));
    
    // Wykryj swap: porównaj rozpiętość surowych wartości
    // Targets rozciągają się w X: 20-300 (280px) i Y: 20-220 (200px)
    // Jeśli deltaRawY > deltaRawX, osie są zamienione
    int deltaRawX = touchCalNewXMax - touchCalNewXMin;
    int deltaRawY = touchCalNewYMax - touchCalNewYMin;
    touchSwapXY = (deltaRawY > deltaRawX);
    
    // Wykryj odwrócenie osi
    // Porównaj punkt 1 (góra-lewo) z punktem 3 (dół-prawo)
    int16_t x1 = touchCalRawX1;
    int16_t y1 = touchCalRawY1;
    int16_t x3 = touchCalRawX3;
    int16_t y3 = touchCalRawY3;
    
    // Jeśli osie są zamienione, swap współrzędne przed sprawdzeniem kierunku
    if (touchSwapXY) {
      int16_t tmp = x1; x1 = y1; y1 = tmp;
      tmp = x3; x3 = y3; y3 = tmp;
    }
    
    // Target 1 (20,20) -> Target 3 (300,220): oczekujemy x3 > x1 i y3 > y1
    touchInvertX = (x3 < x1);
    touchInvertY = (y3 < y1);
    
    touchCalStep = 4;
    drawTouchCalibrationScreen();
    return;
  }

  if (touchCalStep >= 4) {
    // Dowolne dotknięcie zamyka ekran kalibracji bez zapisywania
    // Przywróć poprzednie wartości flag
    touchSwapXY = TOUCH_SWAP_XY;
    touchInvertX = TOUCH_INVERT_X;
    touchInvertY = TOUCH_INVERT_Y;
    touchCalActive = false;
    drawBrightnessMenu();
    return;
  }
}

void handleBrightnessMenuTouch(uint16_t x, uint16_t y, bool isNewTap) {
  unsigned long now = millis();

  const int themeBtnHitX = 205;
  const int themeBtnHitY = 0;
  const int themeBtnHitW = 115;
  const int themeBtnHitH = 44;

  // Przycisk zmiany motywu ma priorytet i działa od razu po otwarciu menu.
  if (isNewTap && isPointInRect(x, y, themeBtnHitX, themeBtnHitY, themeBtnHitW, themeBtnHitH)) {
    tftStyleMode = isTftStyleLight() ? TFT_STYLE_DARK : TFT_STYLE_LIGHT;
    applyTftUiPalette();
    drawBrightnessMenu();
    return;
  }
  
  if (now - brightnessMenuOpenedMs < 1500) {
    return;
  }

  // Zawsze aktualizuj znacznik startu dla bieżącego dotknięcia, zanim obsłużymy kafelki
  if (isNewTap) {
    brightnessMenuTouchStartMs = now;
    brightnessMenuLongPressHandled = false;
  }

  // Długi tap (>=5s) w dowolnym miejscu ekranu jasności uruchamia kalibrację dotyku
  if (!brightnessMenuLongPressHandled && brightnessMenuTouchStartMs > 0 && (now - brightnessMenuTouchStartMs) >= 5000) {
    brightnessMenuLongPressHandled = true;
    startTouchCalibration();
    return;
  }

  const int sliderX = 40;
  const int sliderY = 90;
  const int sliderW = 240;
  const int sliderH = 12;
  const int themeSliderY = 130;
  const int themeSliderH = 12;
  const int langTileW = 70;
  const int langTileH = 22;
  const int langGap = 10;
  const int langStartX = (320 - (2 * langTileW + langGap)) / 2;
  const int langY = 160;

  // Obsługa sliderów
  if (y >= sliderY - 6 && y <= sliderY + sliderH + 6) {
    setBrightnessFromTouch(x);
  }
  if (y >= themeSliderY - 6 && y <= themeSliderY + themeSliderH + 6) {
    setThemeFromTouch(x);
  }

  if (isNewTap) {
    if (isPointInRect(x, y, langStartX, langY, langTileW, langTileH)) {
      tftLanguage = TFT_LANG_PL;
      // Wymuś odświeżenie opisów pogody po zmianie języka
      lastWeatherFetchMs = 0;
      lockWeatherData();
      weatherData.valid = false;
      weatherData.forecast3hValid = false;
      weatherData.forecastNextDayValid = false;
      for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
        weatherData.detailValid[i] = false;
      }
      unlockWeatherData();
      savePreferences();
      drawBrightnessMenu();
      return;
    }
    if (isPointInRect(x, y, langStartX + langTileW + langGap, langY, langTileW, langTileH)) {
      tftLanguage = TFT_LANG_EN;
      // Wymuś odświeżenie opisów pogody po zmianie języka
      lastWeatherFetchMs = 0;
      lockWeatherData();
      weatherData.valid = false;
      weatherData.forecast3hValid = false;
      weatherData.forecastNextDayValid = false;
      for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
        weatherData.detailValid[i] = false;
      }
      unlockWeatherData();
      savePreferences();
      drawBrightnessMenu();
      return;
    }
  }

  if (!isNewTap) {
    return;
  }

  const int btnW = 90;
  const int btnH = 26;
  const int btnY = 190;
  const int saveX = 10;
  const int defaultX = 115;
  const int closeX = 220;

  if (isPointInRect(x, y, saveX, btnY, btnW, btnH)) {
    backlightPercent = brightnessMenuValue;
    savePreferences();
    brightnessMenuActive = false;
    restoreAfterBrightnessMenu();
    return;
  }
  if (isPointInRect(x, y, defaultX, btnY, btnW, btnH)) {
    menuThemeHue = DEFAULT_MENU_THEME_HUE;
    applyMenuThemeFromHue();
    drawBrightnessMenuHeader();
    drawThemeSlider();
    drawBrightnessSlider();
    return;
  }
  if (isPointInRect(x, y, closeX, btnY, btnW, btnH)) {
    backlightPercent = brightnessMenuPrevBacklight;
    setBacklightPercent(backlightPercent);
    menuThemeHue = brightnessMenuPrevThemeHue;
    applyMenuThemeFromHue();
    tftStyleMode = brightnessMenuPrevStyleMode;
    applyTftUiPalette();
    brightnessMenuActive = false;
    restoreAfterBrightnessMenu();
    return;
  }
}

// Ekran 6: APRS-IS
void updateScreen6Clock() {
  if (!tftInitialized || inMenu) {
    return;
  }
  if (currentScreen != SCREEN_APRS_IS && currentScreen != SCREEN_APRS_RADAR) {
    return;
  }

  static char lastDrawnTime[6] = "";
  static bool lastRadarMode = false;

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  bool radarMode = (currentScreen == SCREEN_APRS_RADAR);
  uint16_t topClearColor = radarMode ? (isTftStyleLight() ? tftUiPalette.bg : TFT_BLACK) : tftHeaderBgColor();
  uint16_t timeColor = radarMode ? (isTftStyleLight() ? tftUiPalette.fg : TFT_WHITE) : tftHeaderTextColor();
  int timeY = radarMode ? 5 : 8;

  if (strcmp(lastDrawnTime, timeBuffer) == 0 && lastRadarMode == radarMode) {
    return;
  }

