tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  int timeX = 320 - timeWidth - 4;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, topClearColor);
  tft.setTextColor(timeColor);
  tft.setTextSize(2);
  tft.setCursor(timeX, timeY);
  tft.print(timeBuffer);

  strncpy(lastDrawnTime, timeBuffer, sizeof(lastDrawnTime));
  lastDrawnTime[sizeof(lastDrawnTime) - 1] = '\0';
  lastRadarMode = radarMode;
}

uint32_t computeScreen6Signature() {
  // Prosty hash treĹ›ci tabeli (10 lub 11 stacji APRS zależnie od paska nawigacji)
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  hash ^= (uint32_t)aprsStationCount;
  hash *= fnvPrime;
  hash ^= (uint32_t)screen6SortMode;
  hash *= fnvPrime;
  hash ^= (uint32_t)(screen6RadarZoom * 100.0f);
  hash *= fnvPrime;
  hash ^= isScreen6RadarHintVisible() ? 1u : 0u;
  hash *= fnvPrime;
  hash ^= (uint32_t)dxTableSizeMode;
  hash *= fnvPrime;
  hash ^= isTableNavFooterVisible(SCREEN_APRS_IS) ? 1u : 0u;
  hash *= fnvPrime;

  int order[MAX_APRS_DISPLAY_LCD];
  int displayCount = 0;
  buildAprsDisplayOrder(order, displayCount);
  int maxRows = getAprsTableMaxRows();
  int visibleCount = min(displayCount, maxRows);
  for (int i = 0; i < visibleCount; i++) {
    const APRSStation &s = aprsStations[order[i]];
    for (size_t j = 0; j < s.time.length(); j++) {
      hash ^= (uint8_t)s.time[j];
      hash *= fnvPrime;
    }
    for (size_t j = 0; j < s.callsign.length(); j++) {
      hash ^= (uint8_t)s.callsign[j];
      hash *= fnvPrime;
    }
    hash ^= (uint32_t)(s.lat * 1000);
    hash *= fnvPrime;
    hash ^= (uint32_t)(s.lon * 1000);
    hash *= fnvPrime;
    hash ^= (uint32_t)s.distance;
    hash *= fnvPrime;
    hash ^= (uint32_t)(s.freqMHz * 1000);
    hash *= fnvPrime;
  }

  return hash;
}

void updateScreen6Data() {
  if (!tftInitialized || inMenu) {
    return;
  }
  if (currentScreen != SCREEN_APRS_IS && currentScreen != SCREEN_APRS_RADAR) {
    return;
  }

  // 1) Zaktualizuj czas w nagĹ‚Ăłwku (bez peĹ‚nego odĹ›wieĹĽania)
  updateScreen6Clock();

  // 2) OdĹ›wieĹĽ tabelÄ™ tylko gdy dane siÄ™ zmieniĹ‚y
  static uint32_t lastSig = 0;
  uint32_t currentSig = computeScreen6Signature();
  if (currentSig == lastSig) {
    return;
  }
  lastSig = currentSig;

  if (currentScreen == SCREEN_APRS_RADAR) {
    drawAprsRadar();
    return;
  }

  // 3) Renderuj tabelÄ™ do bufora i wypchnij jednym ruchem (bez migotania)
  const bool navVisible = isTableNavFooterVisible(SCREEN_APRS_IS);
  const bool enlarged = isDxTableEnlarged();
  const int maxRows = getAprsTableMaxRows();
  const int aprsKmXEnlarged = 195;
  const int aprsFreqXEnlarged = 234;
  const int aprsKmXNormal = 197;
  const int aprsFreqXNormal = 255;
  const int tableTop = TFT_TABLE_TOP;
  const int tableBottom = getTableBottomForScreen(SCREEN_APRS_IS);
  const int tableHeight = tableBottom - tableTop;
  TFT_eSprite *tableSprite = (navVisible && ensureSharedTableSprite()) ? &sharedTableSprite : nullptr;

  if (tableSprite != nullptr) {
    tableSprite->fillSprite(tftUiPalette.bg);

    int yPos = 8;
    tableSprite->setTextColor(tftUiPalette.muted);
    tableSprite->setTextSize(1);
    if (enlarged) {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(74, yPos);  tableSprite->print("CALL");
      tableSprite->setCursor(aprsKmXEnlarged, yPos); tableSprite->print("KM");
      tableSprite->setCursor(aprsFreqXEnlarged, yPos); tableSprite->print("FREQ");
    } else {
      tableSprite->setCursor(5, yPos);   tableSprite->print("UTC");
      tableSprite->setCursor(50, yPos);  tableSprite->print("CALLSIGN");
      tableSprite->setCursor(125, yPos); tableSprite->print("SYMBOL");
      tableSprite->setCursor(aprsKmXNormal, yPos); tableSprite->print("KM");
      tableSprite->setCursor(aprsFreqXNormal, yPos); tableSprite->print("FREQ");
    }
    tableSprite->drawFastHLine(0, yPos + 10, 320, tftUiPalette.muted);
    yPos += enlarged ? 20 : 18;

    int order[MAX_APRS_DISPLAY_LCD];
    int displayCount = 0;
    buildAprsDisplayOrder(order, displayCount);
    int visibleCount = min(displayCount, maxRows);
    for (int i = 0; i < visibleCount; i++) {
      if (yPos >= (tableHeight - 2)) {
        break;
      }
      const APRSStation &station = aprsStations[order[i]];
      if (enlarged) {
        if (i % 2 == 0) {
          tableSprite->fillRect(0, yPos - 5, 320, 24, tftUiPalette.rowAlt);
        }

        tableSprite->setTextSize(2);

        tableSprite->setTextColor(tftUiPalette.muted);
        tableSprite->setCursor(5, yPos);
        String timeStr = formatAprsTimeWithTimezone(station.time);
        tableSprite->print(timeStr);

        tableSprite->setTextColor(getAprsCallsignColorForEnlarged(station));
        tableSprite->setCursor(74, yPos);
        String callText = station.callsign;
        if (callText.length() > 9) callText = callText.substring(0, 9);
        tableSprite->print(callText);

        tableSprite->setTextColor(tftTableAccentTextColor());
        tableSprite->setCursor(aprsKmXEnlarged, yPos);
        if (station.hasLatLon && station.distance > 0) {
          tableSprite->print(roundAprsDistanceKm(station.distance));
        } else {
          tableSprite->print("-");
        }

        tableSprite->setTextColor(tftTableFreqColor());
        tableSprite->setCursor(aprsFreqXEnlarged, yPos);
        if (station.freqMHz > 0.0f) {
          tableSprite->print(String(station.freqMHz, 3));
        } else {
          tableSprite->print("-");
        }

        yPos += 27;
      } else {
        if (i % 2 == 0) {
          tableSprite->fillRect(0, yPos - 2, 320, 16, tftUiPalette.rowAlt);
        }

        tableSprite->setTextSize(1);

        tableSprite->setTextColor(tftUiPalette.muted);
        tableSprite->setCursor(5, yPos);
        String timeStr = formatAprsTimeWithTimezone(station.time);
        tableSprite->print(timeStr);

        tableSprite->setTextColor(tftUiPalette.fg);
        tableSprite->setCursor(50, yPos);
        tableSprite->print(station.callsign);

        String symbolShort = getAPRSSymbolShort(station);
        uint16_t symbolColor = TFT_GREEN;
        if (isTftStyleLight()) {
          symbolColor = tftUiPalette.fg;
        } else if (symbolShort == "HUMAN") {
          symbolColor = 0x3C1F;
        } else if (symbolShort == "HOUSE") {
          symbolColor = TFT_YELLOW;
        } else if (symbolShort == "CAR") {
          symbolColor = TFT_RED;
        } else if (symbolShort == "HAMCLOCK") {
          symbolColor = TFT_ORANGE;
        }
        tableSprite->setTextColor(symbolColor);
        tableSprite->setCursor(125, yPos);
        tableSprite->print(symbolShort);

        tableSprite->setTextColor(tftTableAccentTextColor());
        tableSprite->setCursor(aprsKmXNormal, yPos);
        if (station.hasLatLon && station.distance > 0) {
          tableSprite->print(roundAprsDistanceKm(station.distance));
          tableSprite->print(" km");
        } else {
          tableSprite->print("-");
        }

        tableSprite->setTextColor(tftTableFreqColor());
        tableSprite->setCursor(aprsFreqXNormal, yPos);
        if (station.freqMHz > 0.0f) {
          tableSprite->print(String(station.freqMHz, 3));
        } else {
          tableSprite->print("-");
        }

        yPos += 17;
      }
    }

    if (visibleCount == 0) {
      tableSprite->setTextColor(TFT_RED);
      tableSprite->setTextSize(2);
      tableSprite->setCursor(40, 120 - tableTop);
      tableSprite->print("WAITING FOR APRS...");
    }

    tableSprite->pushSprite(0, tableTop);
    return;
  }

  // Fallback bez sprite (np. gdy zabraknie RAM)
  tft.fillRect(0, tableTop, 320, tableHeight, tftUiPalette.bg);

  int yPos = 40;
  tft.setTextColor(tftUiPalette.muted);
  tft.setTextSize(1);
  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(aprsKmXEnlarged, yPos); tft.print("KM");
    tft.setCursor(aprsFreqXEnlarged, yPos); tft.print("FREQ");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("SYMBOL");
    tft.setCursor(aprsKmXNormal, yPos); tft.print("KM");
    tft.setCursor(aprsFreqXNormal, yPos); tft.print("FREQ");
  }
  tft.drawFastHLine(0, yPos + 10, 320, tftUiPalette.muted);
  yPos += enlarged ? 20 : 18;

  int order[MAX_APRS_DISPLAY_LCD];
  int displayCount = 0;
  buildAprsDisplayOrder(order, displayCount);
  int visibleCount = min(displayCount, maxRows);
  for (int i = 0; i < visibleCount; i++) {
    if (yPos >= (tableBottom - 2)) {
      break;
    }
    const APRSStation &station = aprsStations[order[i]];
    if (enlarged) {
      if (i % 2 == 0) {
        tft.fillRect(0, yPos - 5, 320, 24, tftUiPalette.rowAlt);
      }

      tft.setTextSize(2);

      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      String timeStr = formatAprsTimeWithTimezone(station.time);
      tft.print(timeStr);

      tft.setTextColor(getAprsCallsignColorForEnlarged(station));
      tft.setCursor(74, yPos);
      String callText = station.callsign;
      if (callText.length() > 9) callText = callText.substring(0, 9);
      tft.print(callText);

      tft.setTextColor(tftTableAccentTextColor());
      tft.setCursor(aprsKmXEnlarged, yPos);
      if (station.hasLatLon && station.distance > 0) {
        tft.print(roundAprsDistanceKm(station.distance));
      } else {
        tft.print("-");
      }

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(aprsFreqXEnlarged, yPos);
      if (station.freqMHz > 0.0f) {
        tft.print(String(station.freqMHz, 3));
      } else {
        tft.print("-");
      }

      yPos += 27;
    } else {
      if (i % 2 == 0) {
        tft.fillRect(0, yPos - 2, 320, 16, tftUiPalette.rowAlt);
      }

      tft.setTextSize(1);

      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      String timeStr = formatAprsTimeWithTimezone(station.time);
      tft.print(timeStr);

      tft.setTextColor(tftUiPalette.fg);
      tft.setCursor(50, yPos);
      tft.print(station.callsign);

      String symbolShort = getAPRSSymbolShort(station);
      uint16_t symbolColor = TFT_GREEN;
      if (isTftStyleLight()) {
        symbolColor = tftUiPalette.fg;
      } else if (symbolShort == "HUMAN") {
        symbolColor = 0x3C1F;
      } else if (symbolShort == "HOUSE") {
        symbolColor = TFT_YELLOW;
      } else if (symbolShort == "CAR") {
        symbolColor = TFT_RED;
      } else if (symbolShort == "HAMCLOCK") {
        symbolColor = TFT_ORANGE;
      }
      tft.setTextColor(symbolColor);
      tft.setCursor(125, yPos);
      tft.print(symbolShort);

      tft.setTextColor(tftTableAccentTextColor());
      tft.setCursor(aprsKmXNormal, yPos);
      if (station.hasLatLon && station.distance > 0) {
        tft.print(roundAprsDistanceKm(station.distance));
        tft.print(" km");
      } else {
        tft.print("-");
      }

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(aprsFreqXNormal, yPos);
      if (station.freqMHz > 0.0f) {
        tft.print(String(station.freqMHz, 3));
      } else {
        tft.print("-");
      }

      yPos += 17;
    }
  }

  if (visibleCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR APRS...");
  }
}

void drawAprsIs() {
  screen6ViewMode = APRS_VIEW_LIST;
  tft.fillScreen(tftUiPalette.bg);
  const int aprsKmXEnlarged = 195;
  const int aprsFreqXEnlarged = 234;
  const int aprsKmXNormal = 197;
  const int aprsFreqXNormal = 255;

  // 1. NAGĹĂ“WEK: Belka z menu, nazwÄ… serwera i czasem UTC
  tft.fillRect(0, 0, 320, 32, tftHeaderBgColor());
  tft.setTextColor(tftHeaderTextColor());

  // IKONA MENU (3D)
  drawHamburgerMenuButton3D(5, 7);

  // Nazwa serwera APRS-IS - przesuniÄ™ta w prawo (x=35 zamiast 5), by zrobiÄ‡ miejsce na menu
  tft.setTextSize(2);
  tft.setCursor(35, 8);
  if (isUart2AprsTncKissModuleSelected()) {
    tft.print("APRS-TNC-KISS");
  } else if (isUart2AprsUartSourceEnabled()) {
    tft.print("APRS-TNC2-UART");
  } else {
    tft.print("APRS-IS");
  }
  
  struct tm timeinfo;
  if (getTimeWithTimezone(&timeinfo)) {
    char timeBuffer[6];
    strftime(timeBuffer, 6, "%H:%M", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setCursor(320 - timeWidth - 4, 8);
    tft.print(timeBuffer);
  }

  // 2. NAGĹĂ“WKI TABELI
  int yPos = 40;
  const bool enlarged = isDxTableEnlarged();
  tft.setTextColor(tftUiPalette.muted);
  tft.setTextSize(1);
  if (enlarged) {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(74, yPos);  tft.print("CALL");
    tft.setCursor(aprsKmXEnlarged, yPos); tft.print("KM");
    tft.setCursor(aprsFreqXEnlarged, yPos); tft.print("FREQ");
  } else {
    tft.setCursor(5, yPos);   tft.print("UTC");
    tft.setCursor(50, yPos);  tft.print("CALLSIGN");
    tft.setCursor(125, yPos); tft.print("SYMBOL");
    tft.setCursor(aprsKmXNormal, yPos); tft.print("KM");
    tft.setCursor(aprsFreqXNormal, yPos); tft.print("FREQ");
  }
  tft.drawFastHLine(0, yPos + 10, 320, tftUiPalette.muted);
  yPos += enlarged ? 20 : 18;

  // 3. LISTA STACJI APRS (10 z paskiem nawigacji, 11 bez)
  int order[MAX_APRS_DISPLAY_LCD];
  int maxRows = getAprsTableMaxRows();
  int displayCount = 0;
  buildAprsDisplayOrder(order, displayCount);
  int visibleCount = min(displayCount, maxRows);
  for (int i = 0; i < visibleCount; i++) {
    const APRSStation &station = aprsStations[order[i]];
    if (enlarged) {
      if (i % 2 == 0) tft.fillRect(0, yPos - 5, 320, 24, tftUiPalette.rowAlt);

      tft.setTextSize(2);
      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      String timeStr = formatAprsTimeWithTimezone(station.time);
      tft.print(timeStr);

      tft.setTextColor(getAprsCallsignColorForEnlarged(station));
      tft.setCursor(74, yPos);
      String callText = station.callsign;
      if (callText.length() > 9) callText = callText.substring(0, 9);
      tft.print(callText);

      tft.setTextColor(tftTableAccentTextColor());
      tft.setCursor(aprsKmXEnlarged, yPos);
      if (station.hasLatLon && station.distance > 0) {
        tft.print(roundAprsDistanceKm(station.distance));
      } else {
        tft.print("-");
      }

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(aprsFreqXEnlarged, yPos);
      if (station.freqMHz > 0.0f) {
        tft.print(String(station.freqMHz, 3));
      } else {
        tft.print("-");
      }

      yPos += 27;
    } else {
      if (i % 2 == 0) tft.fillRect(0, yPos - 2, 320, 16, tftUiPalette.rowAlt);

      tft.setTextSize(1);
      tft.setTextColor(tftUiPalette.muted);
      tft.setCursor(5, yPos);
      String timeStr = formatAprsTimeWithTimezone(station.time);
      tft.print(timeStr);

      tft.setTextColor(tftUiPalette.fg);
      tft.setCursor(50, yPos);
      tft.print(station.callsign);

      String symbolShort = getAPRSSymbolShort(station);
      uint16_t symbolColor = TFT_GREEN;
      if (isTftStyleLight()) {
        symbolColor = tftUiPalette.fg;
      } else if (symbolShort == "HUMAN") {
        symbolColor = 0x3C1F;
      } else if (symbolShort == "HOUSE") {
        symbolColor = TFT_YELLOW;
      } else if (symbolShort == "CAR") {
        symbolColor = TFT_RED;
      } else if (symbolShort == "HAMCLOCK") {
        symbolColor = TFT_ORANGE;
      }
      tft.setTextColor(symbolColor);
      tft.setCursor(125, yPos);
      tft.print(symbolShort);

      tft.setTextColor(tftTableAccentTextColor());
      tft.setCursor(aprsKmXNormal, yPos);
      if (station.hasLatLon && station.distance > 0) {
        tft.print(roundAprsDistanceKm(station.distance));
        tft.print(" km");
      } else {
        tft.print("-");
      }

      tft.setTextColor(tftTableFreqColor());
      tft.setCursor(aprsFreqXNormal, yPos);
      if (station.freqMHz > 0.0f) {
        tft.print(String(station.freqMHz, 3));
      } else {
        tft.print("-");
      }

      yPos += 17;
    }
  }

  // 4. Pasek nawigacji widoczny tylko przez 5 sekund od wejścia na ekran
  if (isTableNavFooterVisible(SCREEN_APRS_IS)) {
    drawSwitchScreenFooter();
  }

  if (visibleCount == 0) {
    tft.setTextColor(TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(40, 120);
    tft.print("WAITING FOR APRS...");
  }
}

