tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
void drawAprsRadar() {
  screen6ViewMode = APRS_VIEW_RADAR;
  const bool lightTheme = isTftStyleLight();
  const uint16_t radarBgColor = lightTheme ? TFT_WHITE : TFT_BLACK;
  const uint16_t radarTextColor = lightTheme ? tftUiPalette.fg : TFT_WHITE;
  tft.fillScreen(radarBgColor);
  drawAprsRadarBody();

  drawHamburgerMenuButton3D(5, 7);

  tft.setTextColor(radarTextColor);
  tft.setTextSize(2);
  const char *aprsTitleTop = "APRS";
  const char *aprsTitleBottom = "RADAR";
  int aprsTopWidth = strlen(aprsTitleTop) * 12;
  int aprsBottomWidth = strlen(aprsTitleBottom) * 12;
  int aprsTopX = tft.width() - aprsTopWidth - 4;
  int aprsBottomX = tft.width() - aprsBottomWidth - 4;
  tft.setCursor(aprsTopX, tft.height() - 36);
  tft.print(aprsTitleTop);
  tft.setCursor(aprsBottomX, tft.height() - 20);
  tft.print(aprsTitleBottom);

  struct tm timeinfo;
  if (getTimeWithTimezone(&timeinfo)) {
    char timeBuffer[6];
    strftime(timeBuffer, 6, "%H:%M", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setTextColor(radarTextColor);
    tft.setCursor(tft.width() - timeWidth - 4, 5);
    tft.print(timeBuffer);
  }

  drawScreen6RadarZoomHints();
}

static String extractXmlTagValue(const String &xml, const char* tag) {
  String openTag = "<" + String(tag) + ">";
  String closeTag = "</" + String(tag) + ">";
  int start = xml.indexOf(openTag);
  if (start < 0) return "";
  start += openTag.length();
  int end = xml.indexOf(closeTag, start);
  if (end < 0) return "";
  return xml.substring(start, end);
}

static String extractBandCondition(const String &xml, const char* bandName, const char* timeName) {
  String token = "<band name=\"" + String(bandName) + "\" time=\"" + String(timeName) + "\">";
  int start = xml.indexOf(token);
  if (start < 0) return "";
  start += token.length();
  int end = xml.indexOf("</band>", start);
  if (end < 0) return "";
  return xml.substring(start, end);
}

static void setPropagationBandDefaults(PropagationData &out) {
  out.hfBandLabel[0] = "80m-40m";
  out.hfBandFreq[0] = "3.5-7.3 MHz";
  out.hfBandLabel[1] = "30m-20m";
  out.hfBandFreq[1] = "10.1-14.35 MHz";
  out.hfBandLabel[2] = "17m-15m";
  out.hfBandFreq[2] = "18.068-21.45 MHz";
  out.hfBandLabel[3] = "12m-10m";
  out.hfBandFreq[3] = "24.89-29.7 MHz";

  for (int i = 0; i < 4; i++) {
    out.hfBandDay[i] = "--";
    out.hfBandNight[i] = "--";
  }
}

static bool parsePropagationXml(const String &xml, PropagationData &out) {
  setPropagationBandDefaults(out);

  String sfi = extractXmlTagValue(xml, "solarflux");
  String kindex = extractXmlTagValue(xml, "kindex");
  String aindex = extractXmlTagValue(xml, "aindex");
  String muf = extractXmlTagValue(xml, "muf");
  String updated = extractXmlTagValue(xml, "updated");

  sfi.trim();
  kindex.trim();
  aindex.trim();
  muf.trim();
  updated.trim();

  if (sfi.length() == 0 || kindex.length() == 0) {
    return false;
  }

  out.sfi = sfi;
  out.kindex = kindex;
  out.aindex = aindex.length() ? aindex : "--";
  out.muf = muf.length() ? muf : "--";
  out.updated = updated.length() ? updated : "--";
  out.valid = true;
  out.lastError = "";
  out.fetchedAtMs = millis();

  for (int i = 0; i < 4; i++) {
    String day = extractBandCondition(xml, out.hfBandLabel[i].c_str(), "day");
    String night = extractBandCondition(xml, out.hfBandLabel[i].c_str(), "night");
    day.trim();
    night.trim();
    if (day.length() > 0) out.hfBandDay[i] = day;
    if (night.length() > 0) out.hfBandNight[i] = night;
  }

  return true;
}

bool fetchPropagationData() {
  if (WiFi.status() != WL_CONNECTED) {
    propagationData.lastError = "WiFi offline";
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  http.setTimeout(8000);
  if (!http.begin(client, PROPAGATION_URL)) {
    propagationData.lastError = "HTTP begin failed";
    return false;
  }

  int httpCode = http.GET();
  if (httpCode != HTTP_CODE_OK) {
    propagationData.lastError = "HTTP " + String(httpCode);
    http.end();
    return false;
  }

  String payload = http.getString();
  http.end();

  if (!parsePropagationXml(payload, propagationData)) {
    propagationData.lastError = "Parse error";
    propagationData.valid = false;
    return false;
  }

  return true;
}

void updateScreen3Clock() {
  if (!tftInitialized || currentScreen != 3 || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return;
  }

  char timeBuffer[10];
  strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 315 - timeWidth;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
}

uint32_t computeScreen3Signature() {
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  hash ^= (uint32_t)propagationData.valid;
  hash *= fnvPrime;

  const String* fields[] = {
    &propagationData.sfi,
    &propagationData.kindex,
    &propagationData.aindex,
    &propagationData.muf,
    &propagationData.updated,
    &propagationData.lastError
  };
  for (const String* field : fields) {
    for (size_t i = 0; i < field->length(); i++) {
      hash ^= (uint8_t)(*field)[i];
      hash *= fnvPrime;
    }
  }

  return hash;
}

static uint16_t conditionColor(String cond) {
  String up = cond;
  up.toUpperCase();
  if (up.indexOf("GOOD") >= 0) return TFT_GREEN;
  if (up.indexOf("FAIR") >= 0) return TFT_YELLOW;
  if (up.indexOf("POOR") >= 0) return TFT_RED;
  return TFT_LIGHTGREY;
}

void drawSunSpotsBody() {
  const int bodyTop = 32;
  const int bodyBottom = 240;
  tft.fillRect(0, bodyTop, 320, bodyBottom - bodyTop, tftUiPalette.bg);

  String sfiText = propagationData.valid && propagationData.sfi.length() ? propagationData.sfi : "--";
  String kText = propagationData.valid && propagationData.kindex.length() ? propagationData.kindex : "--";
  String aText = propagationData.valid && propagationData.aindex.length() ? propagationData.aindex : "--";
  String mufText = propagationData.valid && propagationData.muf.length() ? propagationData.muf : "--";
  String updatedText = propagationData.valid && propagationData.updated.length() ? propagationData.updated : "--";

  tft.setTextSize(2);
  tft.setTextColor(tftUiPalette.muted);
  tft.setCursor(10, 52);
  tft.print("SFI");

