tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  tft.setTextSize(4);
  tft.setTextColor(isTftStyleLight() ? tftUiPalette.fg : TFT_GREEN);
  int sfiWidth = sfiText.length() * 24;
  tft.setCursor(310 - sfiWidth, 44);
  tft.print(sfiText);

  tft.setTextSize(2);
  tft.setTextColor(tftUiPalette.muted);
  tft.setCursor(10, 97);
  tft.print("K-INDEX");

  float kVal = kText.length() ? kText.toFloat() : -1.0f;
  uint16_t kColor = tftUiPalette.fg;
  if (kVal >= 0.0f) {
    if (!isTftStyleLight()) {
      kColor = (kVal < 4.0f) ? TFT_GREEN : (kVal < 6.0f) ? TFT_ORANGE : TFT_RED;
    }
  }
  tft.setTextSize(4);
  tft.setTextColor(kColor);
  int kWidth = kText.length() * 24;
  tft.setCursor(310 - kWidth, 89);
  tft.print(kText);

  tft.setTextSize(2);
  tft.setTextColor(tftUiPalette.muted);
  tft.setCursor(10, 142);
  tft.print("A-INDEX");

  tft.setTextSize(4);
  tft.setTextColor(isTftStyleLight() ? tftUiPalette.fg : TFT_CYAN);
  int aWidth = aText.length() * 24;
  tft.setCursor(310 - aWidth, 134);
  tft.print(aText);

  tft.setTextSize(2);
  tft.setTextColor(tftUiPalette.muted);
  tft.setCursor(10, 182);
  tft.print("MUF");

  tft.setTextSize(3);
  tft.setTextColor(isTftStyleLight() ? tftUiPalette.fg : TFT_YELLOW);
  int mufWidth = mufText.length() * 18;
  tft.setCursor(310 - mufWidth, 174);
  tft.print(mufText);

  tft.setTextSize(1);
  tft.setTextColor(tftUiPalette.muted);
  tft.setCursor(10, 210);
  tft.print("UPDATED UTC");
  tft.setTextSize(2);
  tft.setTextColor(tftUiPalette.fg);
  tft.setCursor(10, 222);
  tft.print(updatedText);

  if (!propagationData.valid) {
    tft.setTextSize(1);
    tft.setTextColor(isTftStyleLight() ? tftUiPalette.fg : TFT_RED);
    tft.setCursor(10, 196);
    String err = propagationData.lastError.length() ? propagationData.lastError : tr(TR_NO_DATA);
    tft.print(tr(TR_ERROR_PREFIX));
    tft.print(err);
  }
}

void updateScreen3Data() {
  if (!tftInitialized || currentScreen != 3 || inMenu) {
    return;
  }

  updateScreen3Clock();

  static uint32_t lastSig = 0;
  uint32_t currentSig = computeScreen3Signature();
  if (currentSig == lastSig) {
    return;
  }
  lastSig = currentSig;

  drawSunSpotsBody();
}

void drawSunSpots() {
  tft.fillScreen(tftUiPalette.bg);

  tft.fillRect(0, 0, 320, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

  // brak hamburger menu na ekranie Propagation

  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print((tftLanguage == TFT_LANG_EN) ? "PROPAGATION" : "PROPAGACJA");

  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuffer[10];
    strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setCursor(315 - timeWidth, 8);
    tft.print(timeBuffer);
  }

  drawSunSpotsBody();
}

void updateScreen4Clock() {
  if (!tftInitialized || currentScreen != 4 || inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, 1)) {
    return;
  }

  char timeBuffer[10];
  strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 315 - timeWidth;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
}

uint32_t computeScreen4Signature() {
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  hash ^= (uint32_t)propagationData.valid;
  hash *= fnvPrime;

  for (int i = 0; i < 4; i++) {
    const String* fields[] = {
      &propagationData.hfBandLabel[i],
      &propagationData.hfBandFreq[i],
      &propagationData.hfBandDay[i],
      &propagationData.hfBandNight[i]
    };
    for (const String* field : fields) {
      for (size_t j = 0; j < field->length(); j++) {
        hash ^= (uint8_t)(*field)[j];
        hash *= fnvPrime;
      }
    }
  }

  for (size_t j = 0; j < propagationData.updated.length(); j++) {
    hash ^= (uint8_t)propagationData.updated[j];
    hash *= fnvPrime;
  }
  for (size_t j = 0; j < propagationData.lastError.length(); j++) {
    hash ^= (uint8_t)propagationData.lastError[j];
    hash *= fnvPrime;
  }

  return hash;
}

void drawBandInfoBody() {
  const int bodyTop = 32;
  const int bodyBottom = 220;
  tft.fillRect(0, bodyTop, 320, bodyBottom - bodyTop, tftUiPalette.bg);

  int yPos = 40;
  tft.setTextColor(tftUiPalette.muted);
  tft.setTextSize(2);
  tft.setCursor(5, yPos);
  tft.print("BAND");
  tft.setCursor(150, yPos);
  tft.print("DAY");
  tft.setCursor(240, yPos);
  tft.print("NIGHT");
  tft.drawFastHLine(0, yPos + 30, 320, tftUiPalette.muted);
  yPos += 26; //byĹ‚o 16

  for (int i = 0; i < 4; i++) {
    if (i % 2 == 0) {
      tft.fillRect(0, yPos - 2, 320, 28, tftUiPalette.rowAlt);
    }

    tft.setTextSize(2);
    tft.setTextColor(tftUiPalette.fg);
    tft.setCursor(5, yPos);
    tft.print(propagationData.hfBandLabel[i]);

    //tft.setTextColor(TFT_DARKGREY);
    //tft.setCursor(5, yPos + 9);
    //tft.print(propagationData.hfBandFreq[i]);

    tft.setTextSize(2);
    uint16_t dayColor = conditionColor(propagationData.hfBandDay[i]);
    if (isTftStyleLight()) {
      dayColor = tftUiPalette.fg;
    }
    tft.setTextColor(dayColor);
    tft.setCursor(150, yPos - 2);
    tft.print(propagationData.hfBandDay[i]);

    uint16_t nightColor = conditionColor(propagationData.hfBandNight[i]);
    if (isTftStyleLight()) {
      nightColor = tftUiPalette.fg;
    }
    tft.setTextColor(nightColor);
    tft.setCursor(240, yPos - 2);
    tft.print(propagationData.hfBandNight[i]);

    yPos += 30;
  }

  tft.setTextSize(1);
  tft.setTextColor(tftUiPalette.muted);
  tft.setCursor(10, 190);
  tft.print("UPDATED UTC");
  tft.setTextSize(2);
  tft.setTextColor(tftUiPalette.fg);
  tft.setCursor(10, 202);
  tft.print(propagationData.updated.length() ? propagationData.updated : "--");

  if (!propagationData.valid) {
    tft.setTextSize(1);
    tft.setTextColor(isTftStyleLight() ? tftUiPalette.fg : TFT_RED);
    tft.setCursor(10, 176);
    String err = propagationData.lastError.length() ? propagationData.lastError : tr(TR_NO_DATA);
    tft.print(tr(TR_ERROR_PREFIX));
    tft.print(err);
  }
}

void updateScreen4Data() {
  if (!tftInitialized || currentScreen != 4 || inMenu) {
    return;
  }

