tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  updateScreen4Clock();

  static uint32_t lastSig = 0;
  uint32_t currentSig = computeScreen4Signature();
  if (currentSig == lastSig) {
    return;
  }
  lastSig = currentSig;

  drawBandInfoBody();
}

void drawBandInfo() {
  tft.fillScreen(tftUiPalette.bg);

  tft.fillRect(0, 0, 320, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

  int menuX = 8;
  int menuY = 10;
  //tft.fillRect(menuX, menuY, 18, 3, TFT_BLACK);
  //tft.fillRect(menuX, menuY + 6, 18, 3, TFT_BLACK);
  //tft.fillRect(menuX, menuY + 12, 18, 3, TFT_BLACK);

  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print("HF BAND INFO");

  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuffer[10];
    strftime(timeBuffer, 10, "%H:%M Z", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setCursor(315 - timeWidth, 8);
    tft.print(timeBuffer);
  }

  drawBandInfoBody();

  tft.fillTriangle(10, 230, 20, 222, 20, 238, TFT_RADIO_ORANGE);
  tft.fillTriangle(310, 230, 300, 222, 300, 238, TFT_RADIO_ORANGE);
  tft.setTextColor(isTftStyleLight() ? tftUiPalette.fg : 0x52AA);
  tft.setTextSize(1);
  tft.setCursor(125, 226);
  tft.print("SWITCH SCREEN");
}

bool fetchWeatherForecast(double lat, double lon);

bool fetchWeatherData() {
  auto markWeatherError = [&](const String &errorText) {
    lockWeatherData();
    weatherData.lastError = errorText;
    weatherData.valid = false;
    unlockWeatherData();
    return false;
  };

  if (WiFi.status() != WL_CONNECTED) {
    return markWeatherError("WiFi offline");
  }
  if (weatherApiKey.length() == 0) {
    return markWeatherError("No API key");
  }

  double lat = 0.0;
  double lon = 0.0;
  if (!getServiceCoordinatesForServices(lat, lon)) {
    return markWeatherError("No station coordinates");
  }

  // Reset prognoz przed nowym pobraniem
  lockWeatherData();
  weatherData.forecast3hValid = false;
  weatherData.forecastNextDayValid = false;
  weatherData.forecastError = "";
  for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
    weatherData.detailValid[i] = false;
  }
  unlockWeatherData();

  WiFiClientSecure client;
  client.setInsecure();

  String langParam = (tftLanguage == TFT_LANG_EN) ? "en" : "pl";
  String url = "https://api.openweathermap.org/data/2.5/weather?lat=" +
               String(lat, 4) + "&lon=" + String(lon, 4) +
               "&appid=" + weatherApiKey + "&units=metric&lang=" + langParam;

  HTTPClient http;
  http.setTimeout(8000);
  if (!http.begin(client, url)) {
    return markWeatherError("HTTP begin failed");
  }

  int httpCode = http.GET();
  if (httpCode != HTTP_CODE_OK) {
    http.end();
    return markWeatherError("HTTP " + String(httpCode));
  }

  WiFiClient *stream = http.getStreamPtr();

  DynamicJsonDocument filter(512);
  filter["cod"] = true;
  filter["message"] = true;
  filter["name"] = true;
  filter["weather"][0]["description"] = true;
  filter["weather"][0]["icon"] = true;
  filter["weather"][0]["id"] = true;
  filter["main"]["temp"] = true;
  filter["main"]["humidity"] = true;
  filter["main"]["pressure"] = true;
  filter["wind"]["speed"] = true;

  DynamicJsonDocument doc(1536);
  DeserializationError err = deserializeJson(doc, *stream, DeserializationOption::Filter(filter));
  http.end();
  if (err) {
    return markWeatherError("JSON error");
  }

  int cod = doc["cod"] | 0;
  if (cod != 200) {
    String msg = doc["message"] | "";
    return markWeatherError(msg.length() ? msg : "API error");
  }

  String desc = doc["weather"][0]["description"] | "";
  String cityName = doc["name"] | "";
  String icon = doc["weather"][0]["icon"] | ""; // 01d / 01n itp. do wykrycia pory dnia
  int weatherId = doc["weather"][0]["id"] | 800; // pobieranie kodu pogody
  float temp = doc["main"]["temp"] | 0.0f;
  int humidity = doc["main"]["humidity"] | 0;
  int pressure = doc["main"]["pressure"] | 0;
  float wind = doc["wind"]["speed"] | 0.0f;


  if (desc.equalsIgnoreCase("zachmurzenie umiarkowane")) {
    desc = "zachmurzenie";
  }

  lockWeatherData();
  weatherData.description = desc.length() ? desc : "--";
  weatherData.cityName = cityName;
  weatherData.iconCode = icon;
  weatherData.weatherId = weatherId; // kod pogody
  weatherData.tempC = temp;
  weatherData.humidity = humidity;
  weatherData.pressure = pressure;
  weatherData.windMs = wind;

  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuf[6];
    strftime(timeBuf, sizeof(timeBuf), "%H:%M", &timeinfo);
    weatherData.updated = String(timeBuf);
  } else {
    weatherData.updated = "--:--";
  }

  weatherData.valid = true;
  weatherData.lastError = "";
  weatherData.fetchedAtMs = millis();
  unlockWeatherData();

  // Prognozy (3h i jutro)
  fetchWeatherForecast(lat, lon);

  // Pobierz dane o jakoĹ›ci powietrza (PM2.5 i PM10)
  fetchAirPollutionData(lat, lon);

  return true;
}

bool fetchWeatherForecast(double lat, double lon) {
  auto setForecastError = [&](const String &errorText) {
    lockWeatherData();
    weatherData.forecastError = errorText;
    unlockWeatherData();
    return false;
  };

  auto formatForecastHttpError = [&](int code) {
    String msg = "Forecast: HTTP " + String(code);
    if (code < 0) {
      msg += " (";
      msg += HTTPClient::errorToString(code);
      msg += ")";
    }
    return msg;
  };

  if (WiFi.status() != WL_CONNECTED) {
    return setForecastError("Forecast: WiFi offline");
  }
  if (weatherApiKey.length() == 0) {
    return setForecastError("Forecast: No API key");
  }

  String langParam = (tftLanguage == TFT_LANG_EN) ? "en" : "pl";
  String paramsWithLang = "lat=" + String(lat, 4) +
                          "&lon=" + String(lon, 4) +
                          "&appid=" + weatherApiKey +
                          "&units=metric&lang=" + langParam;
  String paramsNoLang = "lat=" + String(lat, 4) +
                        "&lon=" + String(lon, 4) +
                        "&appid=" + weatherApiKey +
                        "&units=metric";

  String urlPrimary = "https://api.openweathermap.org/data/2.5/forecast?" + paramsWithLang + "&cnt=24";
  String urlRetrySecure = "https://api.openweathermap.org/data/2.5/forecast?" + paramsNoLang + "&cnt=12";
  String urlRetryHttp = "http://api.openweathermap.org/data/2.5/forecast?" + paramsNoLang + "&cnt=12";

  HTTPClient http;
  int httpCode = 0;
  String lastTransportError = "Forecast: HTTP begin failed";
  bool requestReady = false;

