tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  WiFiClientSecure secureClient;
  secureClient.setInsecure();
  secureClient.setTimeout(12000);
  WiFiClient plainClient;
  plainClient.setTimeout(12000);

  for (uint8_t attempt = 0; attempt < 3 && !requestReady; attempt++) {
    bool secureAttempt = (attempt < 2);
    String attemptUrl = (attempt == 0) ? urlPrimary : (attempt == 1 ? urlRetrySecure : urlRetryHttp);

    http.setReuse(false);
    http.useHTTP10(true);
    http.setTimeout(attempt == 0 ? 8000 : 12000);

    bool beginOk = secureAttempt ? http.begin(secureClient, attemptUrl)
                                 : http.begin(plainClient, attemptUrl);
    if (!beginOk) {
      lastTransportError = "Forecast: HTTP begin failed";
      continue;
    }

    httpCode = http.GET();
    if (httpCode == HTTP_CODE_OK) {
      requestReady = true;
      break;
    }

    lastTransportError = formatForecastHttpError(httpCode);
    http.end();
  }

  if (!requestReady) {
    return setForecastError(lastTransportError);
  }

  WiFiClient *stream = http.getStreamPtr();

  DynamicJsonDocument doc(28672);
  DeserializationError err = deserializeJson(doc, *stream);
  http.end();
  if (err) {
    return setForecastError("Forecast: JSON " + String(err.c_str()));
  }

  String cod = doc["cod"] | "";
  if (cod.length() > 0 && cod != "200") {
    String msg = doc["message"] | "";
    if (msg.length() == 0) {
      msg = "API error";
    }
    return setForecastError("Forecast: " + msg);
  }

  JsonArray list = doc["list"].as<JsonArray>();
  if (list.isNull() || list.size() == 0) {
    int cntApi = doc["cnt"] | -1;
    if (cntApi >= 0) {
      return setForecastError("Forecast: No data in API (cnt=" + String(cntApi) + ")");
    }
    return setForecastError("Forecast: No data in API");
  }

  bool stormPossible = false;
  int nearestStormEtaMinutes = 0;
  bool windPossible = false;
  float maxWindMsNext6h = 0.0f;
  float maxWindGustMsNext6h = 0.0f;
  long nowUnixForAlerts = (long)time(nullptr);
  if (nowUnixForAlerts > 100000L) {
    for (JsonObject entry : list) {
      long dt = entry["dt"] | 0L;
      if (dt <= 0L) {
        continue;
      }

      long deltaSec = dt - nowUnixForAlerts;
      if (deltaSec < 0L || deltaSec > (6L * 3600L)) {
        continue;
      }

      float windMs = entry["wind"]["speed"] | 0.0f;
      float windGustMs = entry["wind"]["gust"] | 0.0f;
      if (windMs > maxWindMsNext6h) {
        maxWindMsNext6h = windMs;
      }
      if (windGustMs > maxWindGustMsNext6h) {
        maxWindGustMsNext6h = windGustMs;
      }

      int weatherId = entry["weather"][0]["id"] | 800;
      if (weatherId >= 200 && weatherId < 300) {
        int etaMinutes = (int)(deltaSec / 60L);
        if ((deltaSec % 60L) != 0L) {
          etaMinutes++;
        }
        if (etaMinutes < 1) {
          etaMinutes = 1;
        }
        if (!stormPossible || etaMinutes < nearestStormEtaMinutes) {
          stormPossible = true;
          nearestStormEtaMinutes = etaMinutes;
        }
      }
    }

    windPossible = (maxWindMsNext6h >= weatherAlertWindThresholdMs) ||
             (maxWindGustMsNext6h >= weatherAlertWindGustThresholdMs());
  }

  updateWeatherAlertForecastState(stormPossible,
                                  nearestStormEtaMinutes,
                                  windPossible,
                                  maxWindMsNext6h,
                                  maxWindGustMsNext6h);

  lockWeatherData();
  if (weatherData.cityName.length() == 0) {
    String cityFromForecast = doc["city"]["name"] | "";
    if (cityFromForecast.length() > 0) {
      weatherData.cityName = cityFromForecast;
    }
  }

  const long nowUnix = (long)time(nullptr);
  const long targetOffsetsSec[WeatherData::DETAIL_COLS] = {
    3L * 3600L,
    6L * 3600L,
    24L * 3600L,
    48L * 3600L,
    72L * 3600L
  };
  const int fallbackIdx[WeatherData::DETAIL_COLS] = {0, 1, 7, 15, 23};
  const long timezoneOffsetSec = (long)(timezoneHours * 3600.0f);
  const long nowLocalUnix = nowUnix + timezoneOffsetSec;
  const long baseLocalDayStart = (nowLocalUnix / 86400L) * 86400L;

  weatherData.nightTempValid[0] = false;
  weatherData.nightTempValid[1] = false;

  auto assignSlot = [&](uint8_t slot, JsonObject entry) {
    weatherData.detailTempC[slot] = entry["main"]["temp"] | 0.0f;
    weatherData.detailHumidity[slot] = entry["main"]["humidity"] | 0;
    weatherData.detailWindMs[slot] = entry["wind"]["speed"] | 0.0f;
    weatherData.detailWeatherId[slot] = entry["weather"][0]["id"] | 800;
    weatherData.detailIconCode[slot] = String((const char *)(entry["weather"][0]["icon"] | ""));
    weatherData.detailValid[slot] = true;
  };

  for (uint8_t slot = 0; slot < WeatherData::DETAIL_COLS; slot++) {
    int chosenIdx = -1;

    if (slot >= 2 && nowUnix > 100000L) {
      const long targetDayStartLocal = baseLocalDayStart + (long)(slot - 1) * 86400L;
      const long targetNoonLocal = targetDayStartLocal + 12L * 3600L;
      long bestScore = 0x7FFFFFFF;

      for (uint16_t i = 0; i < list.size(); i++) {
        JsonObject entry = list[i];
        long dt = entry["dt"] | 0L;
        if (dt <= 0L) {
          continue;
        }

        long dtLocal = dt + timezoneOffsetSec;
        long entryDayStartLocal = (dtLocal / 86400L) * 86400L;
        if (entryDayStartLocal != targetDayStartLocal) {
          continue;
        }

        int localHour = (int)((dtLocal % 86400L) / 3600L);
        bool isDayHour = (localHour >= 9 && localHour <= 18);
        String iconCode = String((const char *)(entry["weather"][0]["icon"] | ""));
        bool iconIsDay = iconCode.endsWith("d");
        bool isDayCandidate = isDayHour || iconIsDay;

        long score = labs(dtLocal - targetNoonLocal);
        if (!isDayCandidate) {
          score += 12L * 3600L;
        }

        if (score < bestScore) {
          bestScore = score;
          chosenIdx = (int)i;
        }
      }
    }

    if (chosenIdx < 0 && nowUnix > 100000L) {
      long target = nowUnix + targetOffsetsSec[slot];
      long bestDiff = 0x7FFFFFFF;

      for (uint16_t i = 0; i < list.size(); i++) {
        JsonObject entry = list[i];
        long dt = entry["dt"] | 0L;
        if (dt <= 0L) {
          continue;
        }
        long diff = labs(dt - target);
        if (diff < bestDiff) {
          bestDiff = diff;
          chosenIdx = (int)i;
        }
      }
    }

