tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
    if (chosenIdx < 0) {
      int idx = fallbackIdx[slot];
      if (idx >= (int)list.size()) {
        idx = (int)list.size() - 1;
      }
      chosenIdx = idx;
    }

    if (chosenIdx >= 0 && chosenIdx < (int)list.size()) {
      assignSlot(slot, list[chosenIdx]);
    }
  }

  for (uint8_t daySlot = 0; daySlot < 2; daySlot++) {
    const long targetDayStartLocal = baseLocalDayStart + (long)(daySlot + 1) * 86400L;
    int bestNightIdx = -1;
    long bestNightScore = 0x7FFFFFFF;
    int bestAnyIdx = -1;
    float bestAnyTemp = 1000.0f;

    for (uint16_t i = 0; i < list.size(); i++) {
      JsonObject entry = list[i];
      long dt = entry["dt"] | 0L;
      if (dt <= 0L) {
        continue;
      }

      long dtLocal = dt + timezoneOffsetSec;
      long entryDayStartLocal = (dtLocal / 86400L) * 86400L;
      if (entryDayStartLocal != targetDayStartLocal) {
        continue;
      }

      float temp = entry["main"]["temp"] | 0.0f;
      if (bestAnyIdx < 0 || temp < bestAnyTemp) {
        bestAnyTemp = temp;
        bestAnyIdx = (int)i;
      }

      int localHour = (int)((dtLocal % 86400L) / 3600L);
      bool isNightHour = (localHour <= 6 || localHour >= 21);
      if (!isNightHour) {
        continue;
      }

      int refHour = (localHour >= 21) ? 24 + localHour : localHour;
      int refTarget = 26; // 02:00 w oknie 21..30
      long score = labs((long)refHour - (long)refTarget);
      if (score < bestNightScore) {
        bestNightScore = score;
        bestNightIdx = (int)i;
      }
    }

    int chosenNightIdx = (bestNightIdx >= 0) ? bestNightIdx : bestAnyIdx;
    if (chosenNightIdx >= 0 && chosenNightIdx < (int)list.size()) {
      JsonObject entry = list[chosenNightIdx];
      weatherData.nightTempC[daySlot] = entry["main"]["temp"] | 0.0f;
      weatherData.nightTempValid[daySlot] = true;
    }
  }

  if (weatherData.detailValid[0]) {
    weatherData.forecast3hTempC = weatherData.detailTempC[0];
    weatherData.forecast3hWindMs = weatherData.detailWindMs[0];
    weatherData.forecast3hDesc = "--";
    weatherData.forecast3hValid = true;
  }

  if (weatherData.detailValid[2]) {
    weatherData.forecastNextDayTempC = weatherData.detailTempC[2];
    weatherData.forecastNextDayWindMs = weatherData.detailWindMs[2];
    weatherData.forecastNextDayDesc = "--";
    weatherData.forecastNextDayValid = true;
  }

  bool anyDetailValid = false;
  for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
    if (weatherData.detailValid[i]) {
      anyDetailValid = true;
      break;
    }
  }

  if (!anyDetailValid) {
    weatherData.forecastError = "Forecast: No usable entries";
  }

  if (anyDetailValid) {
    weatherData.forecastError = "";
  }

  unlockWeatherData();
  return anyDetailValid;
}

bool fetchAirPollutionData(double lat, double lon) {
  if (WiFi.status() != WL_CONNECTED || weatherApiKey.length() == 0) {
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();

  String url = "https://api.openweathermap.org/data/2.5/air_pollution?lat=" +
               String(lat, 4) + "&lon=" + String(lon, 4) +
               "&appid=" + weatherApiKey;

  HTTPClient http;
  http.setTimeout(8000);
  if (!http.begin(client, url)) {
    return false;
  }

  int httpCode = http.GET();
  if (httpCode != HTTP_CODE_OK) {
    http.end();
    return false;
  }

  WiFiClient *stream = http.getStreamPtr();

  DynamicJsonDocument filter(256);
  filter["list"][0]["components"]["pm2_5"] = true;
  filter["list"][0]["components"]["pm10"] = true;

  DynamicJsonDocument doc(768);
  DeserializationError err = deserializeJson(doc, *stream, DeserializationOption::Filter(filter));
  http.end();
  if (err) {
    return false;
  }

  // Pobierz wartoĹ›ci PM2.5 i PM10 z komponentĂłw
  JsonArray list = doc["list"].as<JsonArray>();
  if (list.isNull() || list.size() == 0) {
    return false;
  }

  JsonObject listItem = list[0];
  JsonObject components = listItem["components"].as<JsonObject>();
  if (components.isNull()) {
    return false;
  }

  lockWeatherData();
  weatherData.pm25 = components["pm2_5"] | 0.0f;
  weatherData.pm10 = components["pm10"] | 0.0f;
  unlockWeatherData();
  return true;
}

// Funkcja okreĹ›lajÄ…ca kolor na podstawie wartoĹ›ci PM2.5
uint16_t getPM25Color(float pm25) {
  if (pm25 <= 12) return TFT_GREEN;      // Dobra
  if (pm25 <= 35) return TFT_YELLOW;     // Umiarkowana
  if (pm25 <= 55) return TFT_ORANGE;     // Niezdrowa dla wraĹĽliwych
  if (pm25 <= 150) return TFT_RED;       // Niezdrowa
  return 0xF800; // Ciemny czerwony - Bardzo niezdrowa
}

// Funkcja okreĹ›lajÄ…ca kolor na podstawie wartoĹ›ci PM10
uint16_t getPM10Color(float pm10) {
  if (pm10 <= 20) return TFT_GREEN;      // Dobra
  if (pm10 <= 50) return TFT_YELLOW;     // Umiarkowana
  if (pm10 <= 100) return TFT_ORANGE;   // Niezdrowa dla wraĹĽliwych
  if (pm10 <= 200) return TFT_RED;      // Niezdrowa
  return 0xF800; // Ciemny czerwony - Bardzo niezdrowa
}

void updateScreen5Clock() {
  if (!tftInitialized ||
      (currentScreen != SCREEN_WEATHER_DSP && currentScreen != SCREEN_WEATHER_FORECAST) ||
      inMenu) {
    return;
  }

  struct tm timeinfo;
  if (!getTimeWithTimezone(&timeinfo)) {
    return;
  }

  char timeBuffer[6];
  strftime(timeBuffer, 6, "%H:%M", &timeinfo);
  int timeWidth = strlen(timeBuffer) * 12;
  int timeX = 315 - timeWidth;

  tft.fillRect(timeX - 2, 4, timeWidth + 6, 24, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(timeX, 8);
  tft.print(timeBuffer);
}

uint32_t computeScreen5Signature() {
  const uint32_t fnvPrime = 16777619u;
  uint32_t hash = 2166136261u;

  hash ^= (uint32_t)weatherData.valid;
  hash *= fnvPrime;
  bool footerVisible = (currentScreen == SCREEN_WEATHER_FORECAST)
                       ? isTableNavFooterVisible(SCREEN_WEATHER_FORECAST)
                       : isTableNavFooterVisible(SCREEN_WEATHER_DSP);
  hash ^= footerVisible ? 1u : 0u;
  hash *= fnvPrime;

  const String* fields[] = {
    &weatherData.cityName,
    &weatherData.description,
    &weatherData.updated,
    &weatherData.lastError,
    &weatherData.forecastError
  };
  for (const String* field : fields) {
    for (size_t j = 0; j < field->length(); j++) {
      hash ^= (uint8_t)(*field)[j];
      hash *= fnvPrime;
    }
  }
  hash ^= (uint32_t)(weatherData.tempC * 10);
  hash *= fnvPrime;
  hash ^= (uint32_t)weatherData.humidity;
  hash *= fnvPrime;
  hash ^= (uint32_t)weatherData.pressure;
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.windMs * 10);
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.pm25 * 10);
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.pm10 * 10);
  hash *= fnvPrime;

