tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  // Prognozy
  hash ^= (uint32_t)weatherData.forecast3hValid;
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.forecast3hTempC * 10);
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.forecast3hWindMs * 10);
  hash *= fnvPrime;
  for (size_t j = 0; j < weatherData.forecast3hDesc.length(); j++) {
    hash ^= (uint8_t)weatherData.forecast3hDesc[j];
    hash *= fnvPrime;
  }

  hash ^= (uint32_t)weatherData.forecastNextDayValid;
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.forecastNextDayTempC * 10);
  hash *= fnvPrime;
  hash ^= (uint32_t)(weatherData.forecastNextDayWindMs * 10);
  hash *= fnvPrime;
  for (size_t j = 0; j < weatherData.forecastNextDayDesc.length(); j++) {
    hash ^= (uint8_t)weatherData.forecastNextDayDesc[j];
    hash *= fnvPrime;
  }

  for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
    hash ^= (uint32_t)weatherData.detailValid[i];
    hash *= fnvPrime;
    hash ^= (uint32_t)(weatherData.detailTempC[i] * 10);
    hash *= fnvPrime;
    hash ^= (uint32_t)weatherData.detailHumidity[i];
    hash *= fnvPrime;
    hash ^= (uint32_t)(weatherData.detailWindMs[i] * 10);
    hash *= fnvPrime;
    hash ^= (uint32_t)weatherData.detailWeatherId[i];
    hash *= fnvPrime;
    for (size_t j = 0; j < weatherData.detailIconCode[i].length(); j++) {
      hash ^= (uint8_t)weatherData.detailIconCode[i][j];
      hash *= fnvPrime;
    }
  }

  return hash;
}

// Funkcja pomocnicza: Kolor wiatru zaleĹĽny od prÄ™dkoĹ›ci (m/s)
uint16_t getWindColor(float speed) {
  if (speed < 5.0)  return TFT_GREEN;       // Bezpiecznie
  if (speed < 10.0) return TFT_YELLOW;      // Umiarkowanie
  if (speed < 15.0) return 0xFBE0;          // Silny (Orange)
  return TFT_RED;                           // Niebezpieczny dla anten
}

// Mapowanie kodu OWM na plik ikony (zgodnie z przygotowaną listą)
String weatherIconPathForId(int id, bool isNight) {
  const String base = "/icon50/";

  // 2xx burza
  if (id >= 200 && id <= 232) return base + "200.bmp";

  // 3xx mżawka
  if (id >= 300 && id <= 321) return base + "300.bmp";

  // 5xx deszcz
  if (id >= 500 && id <= 531) {
    if (id == 500 || id == 501) return base + "500.bmp";
    if (id == 502 || id == 503) return base + "502.bmp";
    if (id == 511 || id == 531) return base + "511.bmp";
    return base + "520.bmp";
  }

  // 6xx śnieg
  if (id >= 600 && id <= 622) {
    if (id == 600 || id == 601 || id == 602 || id == 620 || id == 621 || id == 622) return base + "600.bmp";
    // 611..616 (także 613/615/616) -> 611
    return base + "611.bmp";
  }

  // 7xx atmosfera
  if (id >= 700 && id <= 781) return base + "700.bmp";

  // 800 clear (dzień/noc)
  if (id == 800) return base + (isNight ? "800n.bmp" : "800.bmp");

  // 80x chmury
  if (id == 801 || id == 802) return base + (isNight ? "801n.bmp" : "801.bmp");
  if (id == 803 || id == 804) return base + "803.bmp";

  return base + "unknown.bmp";
}

static String weatherIconPathWithLightSuffix(const String &iconPath) {
  int dotIdx = iconPath.lastIndexOf('.');
  if (dotIdx <= 0) {
    return iconPath + "w";
  }
  return iconPath.substring(0, dotIdx) + "w" + iconPath.substring(dotIdx);
}

// Funkcja pomocnicza: Rysowanie ikon pogodowych (priorytet: id -> plik BMP, fallback: opis)
void drawWeatherIcon(int x, int y, int weatherId, String desc) {
  desc.toLowerCase();
  const bool lightTheme = isTftStyleLight();

  // Dzień/noc z ikony OWM (np. 10d/10n). Jeśli brak, fallback na czas lokalny.
  bool isNight = false;
  if (weatherData.iconCode.endsWith("n")) {
    isNight = true;
  } else if (weatherData.iconCode.endsWith("d")) {
    isNight = false;
  } else {
    struct tm timeinfo;
    if (getLocalTime(&timeinfo, 1)) {
      isNight = (timeinfo.tm_hour < 6 || timeinfo.tm_hour >= 18);
    }
  }

  String iconFile = weatherIconPathForId(weatherId, isNight);

  if (lightTheme) {
    String iconFileLight = weatherIconPathWithLightSuffix(iconFile);
    if (drawBmpFromFS(iconFileLight, x - 25, y - 25)) {
      return;
    }
  }

  // Najpierw próbujemy gotową ikonę BMP
  if (drawBmpFromFS(iconFile, x - 25, y - 25)) {
    return;
  }

  // Fallback: stare ikonki rysowane na podstawie opisu (gdy brak pliku)
  if (desc.indexOf("slon") >= 0 || desc.indexOf("clear") >= 0 || desc.indexOf("pogod") >= 0) {
    tft.fillCircle(x, y, 18, TFT_YELLOW); // Słonce
    for(int i=0; i<360; i+=45) {
       float rad = i * 0.01745;
       tft.drawLine(x+cos(rad)*22, y+sin(rad)*22, x+cos(rad)*32, y+sin(rad)*32, TFT_YELLOW);
    }
  } 
  else if (desc.indexOf("burz") >= 0 || desc.indexOf("thunder") >= 0) {
    tft.fillCircle(x, y-5, 12, TFT_DARKGREY); // Chmura burzowa
    tft.fillTriangle(x+2, y+8, x+10, y+8, x+4, y+22, TFT_YELLOW); // Błysk
  }
  else if (desc.indexOf("mza") >= 0 || desc.indexOf("drizzle") >= 0) {
    tft.fillCircle(x-10, y+5, 12, TFT_LIGHTGREY); // Chmura + mżawka
    tft.fillCircle(x+10, y+5, 12, TFT_LIGHTGREY);
    tft.fillCircle(x, y-5, 15, TFT_LIGHTGREY);
    tft.drawLine(x-6, y+10, x-8, y+16, TFT_CYAN);
    tft.drawLine(x+2, y+10, x, y+16, TFT_CYAN);
  }
  else if (desc.indexOf("snieg") >= 0 || desc.indexOf("snow") >= 0) {
    tft.fillCircle(x, y-5, 12, TFT_LIGHTGREY); // Chmura + śnieg
    tft.drawLine(x-6, y+12, x-2, y+16, TFT_WHITE);
    tft.drawLine(x-2, y+12, x-6, y+16, TFT_WHITE);
    tft.drawLine(x+2, y+12, x+6, y+16, TFT_WHITE);
    tft.drawLine(x+6, y+12, x+2, y+16, TFT_WHITE);
  }
  else if (desc.indexOf("mg") >= 0 || desc.indexOf("mist") >= 0 || desc.indexOf("fog") >= 0 || desc.indexOf("haze") >= 0) {
    tft.drawLine(x-18, y-2, x+18, y-2, TFT_LIGHTGREY); // Mgła
    tft.drawLine(x-20, y+4, x+20, y+4, TFT_LIGHTGREY);
    tft.drawLine(x-16, y+10, x+16, y+10, TFT_LIGHTGREY);
  }
  else if (desc.indexOf("sleet") >= 0 || desc.indexOf("deszcz ze sniegiem") >= 0) {
    tft.fillCircle(x, y-5, 12, TFT_LIGHTGREY); // Deszcz ze śniegiem
    tft.drawLine(x-6, y+10, x-8, y+18, TFT_CYAN);
    tft.drawLine(x+2, y+10, x, y+18, TFT_CYAN);
    tft.drawLine(x+6, y+12, x+2, y+16, TFT_WHITE);
    tft.drawLine(x+2, y+12, x+6, y+16, TFT_WHITE);
  }
  else if (desc.indexOf("zachmur") >= 0 || desc.indexOf("cloud") >= 0 || desc.indexOf("pochmurnie") >= 0) {
    tft.fillCircle(x-10, y+5, 12, TFT_LIGHTGREY); // Chmura
    tft.fillCircle(x+10, y+5, 12, TFT_LIGHTGREY);
    tft.fillCircle(x, y-5, 15, TFT_LIGHTGREY);
  }
  else if (desc.indexOf("deszcz") >= 0 || desc.indexOf("rain") >= 0) {
    tft.fillCircle(x, y-5, 12, TFT_DARKGREY); // Chmura deszczowa
    tft.drawLine(x-5, y+10, x-8, y+20, TFT_CYAN);
    tft.drawLine(x+5, y+10, x+2, y+20, TFT_CYAN);
    tft.drawLine(x, y+12, x-3, y+22, TFT_CYAN);
  } else {
    tft.drawCircle(x, y, 15, TFT_WHITE); // Ikona domyślna (okrąg)
  }
}

// GĹ‚Ăłwna funkcja ciaĹ‚a ekranu pogodowego
void drawWeatherBody() {
  const int bodyTop = 32;
  const int bodyBottom = 220;
  const bool lightTheme = isTftStyleLight();
  const uint16_t bodyBg = lightTheme ? TFT_WHITE : TFT_BLACK;
  const uint16_t bodyText = lightTheme ? TFT_BLACK : TFT_WHITE;
  const uint16_t bodyMuted = lightTheme ? TFT_BLACK : TFT_DARKGREY;
  const uint16_t bodySecondary = lightTheme ? TFT_BLACK : TFT_LIGHTGREY;
  
