tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  // Czyszczenie obszaru roboczego
  tft.fillRect(0, bodyTop, 320, bodyBottom - bodyTop, bodyBg);

  if (!weatherData.valid) {
    tft.setTextColor(lightTheme ? TFT_BLACK : TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(50, 110);
    tft.print("WAITING FOR DATA...");
    return;
  }

  // 1. IKONA I OPIS (Prawa strona)
  drawWeatherIcon(240, 70, weatherData.weatherId, weatherData.description);

  // Priorytet: smooth font (VLW) dla polskich znaków, fallback ASCII gdy mało pamięci.
  int descY = 105; // shifted up by 10px
  int descX = 240; // shifted left by 10px
  bool smoothFontUsed = false;
  if (tryLoadSmoothFont(ROBOTO_FONT12_NAME, ROBOTO_FONT12_FILE)) {
    smoothFontUsed = true;
    tft.setTextColor(bodySecondary);
    tft.setTextDatum(MC_DATUM);
    tft.drawString(weatherData.description, descX, descY);
    tft.setTextDatum(TL_DATUM);

    tft.setCursor(15, 120);
    tft.print(tr(TR_HUMIDITY));
    tft.setCursor(15, 144);
    tft.print(tr(TR_PRESSURE));
    tft.setCursor(15, 168);
    tft.print(tr(TR_WIND));
    tft.unloadFont();
  }

  if (!smoothFontUsed) {
    tft.setTextSize(1);
    tft.setTextColor(bodySecondary);
    String descAscii = sanitizePolishToAscii(weatherData.description);
    int fallbackX = descX - (descAscii.length() * 3);
    tft.setCursor(fallbackX, descY);
    tft.print(descAscii);

    tft.setTextSize(1);
    tft.setTextColor(bodyMuted);
    tft.setCursor(15, 120);
    tft.print(tr(TR_HUMIDITY));
    tft.setCursor(15, 145);
    tft.print(tr(TR_PRESSURE));
    tft.setCursor(15, 170);
    tft.print(tr(TR_WIND));
  }

  // 2. TEMPERATURA (Lewa strona)
  tft.setTextSize(2);
  tft.setTextColor(bodyMuted);
  tft.setCursor(15, 45);
  tft.print(tr(TR_TEMPERATURE));

  tft.setTextSize(5);
  tft.setTextColor(lightTheme ? TFT_BLACK : TFT_CYAN);
  tft.setCursor(15, 70);
  tft.print(String(weatherData.tempC, 1));
  tft.setTextSize(2);
  tft.print(" C");

  // 3. PARAMETRY SZCZEGĂ“ĹOWE
  int startY = 120; // PrzesuniÄ™te w dĂłĹ‚ o 5px
  
  // WILGOTNOĹšÄ† (z paskiem postÄ™pu)
  tft.setTextSize(1);
  tft.setTextColor(bodyMuted);
  //tft.setCursor(15, startY);
  //tft.print("WILGOTNOSC");
  tft.setTextSize(2);
  tft.setTextColor(bodyText);
  tft.setCursor(110, startY - 5);
  tft.print(String(weatherData.humidity) + "%");
  
  // Pasek wilgotnoĹ›ci
  //tft.drawRect(200, startY - 3, 100, 12, TFT_DARKGREY);
  //int humBar = map(weatherData.humidity, 0, 100, 0, 100);
  //tft.fillRect(200, startY - 3, humBar, 12, TFT_BLUE);

  // CIĹšNIENIE
  tft.setTextSize(1);
  tft.setTextColor(bodyMuted);
  //tft.setCursor(15, startY + 25);
  //tft.print("CIŚNIENIE");
  tft.setTextSize(2);
  tft.setTextColor(bodyText);
  tft.setCursor(110, startY + 20);
  tft.print(String(weatherData.pressure) + " hPa");

  // WIATR (Dynamiczny kolor bez paska)
  tft.setTextSize(1);
  tft.setTextColor(bodyMuted);
  //tft.setCursor(15, startY + 50);
  //tft.print("WIATR");
  tft.setTextSize(2);
  tft.setTextColor(lightTheme ? TFT_BLACK : getWindColor(weatherData.windMs));
  tft.setCursor(110, startY + 45);
  tft.print(String(weatherData.windMs, 1) + " m/s");

  // PM2.5 i PM10 (w jednej linii, taka sama czcionka jak pomiar)
  tft.setTextSize(2);
  
  // PM2.5
  tft.setTextColor(bodyText);
  tft.setCursor(15, startY + 70);
  tft.print("PM2.5: ");
  uint16_t pm25Color = getPM25Color(weatherData.pm25);
  tft.setTextColor(lightTheme ? TFT_BLACK : pm25Color);
  tft.print(String(weatherData.pm25, 1));
  
  // Przerwa i PM10
  tft.setTextColor(bodyText);
  tft.print("  PM10: ");
  uint16_t pm10Color = getPM10Color(weatherData.pm10);
  tft.setTextColor(lightTheme ? TFT_BLACK : pm10Color);
  tft.print(String(weatherData.pm10, 1));

}

static void drawWeatherDetailIconCell(int x, int y, int weatherId, const String &iconCode) {
  const bool lightTheme = isTftStyleLight();
  bool isNight = false;
  if (iconCode.endsWith("n")) {
    isNight = true;
  } else if (iconCode.endsWith("d")) {
    isNight = false;
  } else {
    struct tm timeinfo;
    if (getLocalTime(&timeinfo, 1)) {
      isNight = (timeinfo.tm_hour < 6 || timeinfo.tm_hour >= 18);
    }
  }

  String iconFile = weatherIconPathForId(weatherId, isNight);
  if (lightTheme) {
    String iconFileLight = weatherIconPathWithLightSuffix(iconFile);
    if (drawBmpFromFS(iconFileLight, x - 14, y - 14)) {
      return;
    }
  }
  if (!drawBmpFromFS(iconFile, x - 14, y - 14)) {
    tft.drawCircle(x, y, 10, lightTheme ? TFT_BLACK : TFT_LIGHTGREY);
  }
}

static void buildWeatherDetailHeaders(String headers[WeatherData::DETAIL_COLS]) {
  headers[0] = (tftLanguage == TFT_LANG_EN) ? "+3h" : "+3godz";
  headers[1] = (tftLanguage == TFT_LANG_EN) ? "+6h" : "+6godz";

  struct tm timeinfo;
  if (getTimeWithTimezone(&timeinfo)) {
    static const char *daysPl[7] = {"Nd", "Pn", "Wt", "Śr", "Czw", "Pt", "Sob"};
    static const char *daysEn[7] = {"Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"};
    const char **days = (tftLanguage == TFT_LANG_EN) ? daysEn : daysPl;

    for (uint8_t i = 0; i < 3; i++) {
      int dayIdx = (timeinfo.tm_wday + 1 + i) % 7;
      headers[i + 2] = String(days[dayIdx]);
    }
  } else {
    headers[2] = "D+1";
    headers[3] = "D+2";
    headers[4] = "D+3";
  }
}

void drawWeatherDetailPage() {
  const int bodyTop = 32;
  const int bodyBottom = 220;
  const int bodyLeft = 2;
  const int bodyRight = 318;
  const int colCount = WeatherData::DETAIL_COLS - 1;
  const int colW = (bodyRight - bodyLeft + 1) / colCount;
  const bool lightTheme = isTftStyleLight();
  const uint16_t bodyBg = lightTheme ? TFT_WHITE : TFT_BLACK;
  const uint16_t bodyText = lightTheme ? TFT_BLACK : TFT_WHITE;
  const uint16_t bodySecondary = lightTheme ? TFT_BLACK : TFT_LIGHTGREY;
  const uint16_t bodyMuted = lightTheme ? TFT_BLACK : TFT_DARKGREY;
  const uint16_t rowBg = lightTheme ? 0xDEFB : TFT_TABLE_ALT_ROW_COLOR;

  tft.fillRect(0, bodyTop, 320, bodyBottom - bodyTop, bodyBg);

  if (!weatherData.valid) {
    tft.setTextColor(lightTheme ? TFT_BLACK : TFT_RED);
    tft.setTextSize(2);
    tft.setCursor(12, 96);
    tft.print(weatherData.lastError.length() ? weatherData.lastError : tr(TR_NO_DATA));
    return;
  }

  bool anyDetailValid = false;
  for (uint8_t i = 0; i < WeatherData::DETAIL_COLS; i++) {
    if (weatherData.detailValid[i]) {
      anyDetailValid = true;
      break;
    }
  }

