tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  if (!anyDetailValid) {
    tft.setTextColor(lightTheme ? TFT_BLACK : TFT_YELLOW);
    tft.setTextSize(2);
    tft.setCursor(12, 84);
    tft.print((tftLanguage == TFT_LANG_EN) ? "No forecast" : "Brak prognozy");

    String err = weatherData.forecastError;
    if (err.length() == 0) {
      err = (tftLanguage == TFT_LANG_EN) ? "Forecast: no data from API" : "Prognoza: brak danych z API";
    }
    const int maxChars = 42;
    if ((int)err.length() > maxChars) {
      err = err.substring(0, maxChars - 3) + "...";
    }

    tft.setTextColor(bodySecondary);
    tft.setTextSize(1);
    tft.setCursor(12, 110);
    tft.print(err);
    return;
  }

  String headers[WeatherData::DETAIL_COLS];
  buildWeatherDetailHeaders(headers);

  const int yHeader = 38;
  const int yTemp = 78;
  const int yNight = 98;
  const int yHum = 121;
  const int yWind = 152;
  const int yIcon = 183;

  tft.fillRect(bodyLeft, bodyTop + 2, bodyRight - bodyLeft + 1, 31, rowBg);

  for (int i = 1; i < colCount; i++) {
    int vx = bodyLeft + i * colW;
    tft.drawFastVLine(vx, bodyTop + 2, bodyBottom - bodyTop - 4, bodyMuted);
  }

  for (int i = 0; i < colCount; i++) {
    int colX = bodyLeft + i * colW;
    int cx = colX + (colW / 2);

    String hdr = sanitizePolishToAscii(headers[i]);
    tft.setTextSize(2);
    int hdrW = hdr.length() * 12;
    tft.setTextColor(bodySecondary);
    tft.setCursor(cx - hdrW / 2, yHeader);
    tft.print(hdr);

    tft.setTextSize(1);

    if (!weatherData.detailValid[i]) {
      tft.setTextColor(bodyMuted);
      tft.setCursor(cx - 6, yTemp);
      tft.print("--");
      tft.setCursor(cx - 6, yNight);
      tft.print("--");
      tft.setCursor(cx - 6, yHum);
      tft.print("--");
      tft.setCursor(cx - 6, yWind);
      tft.print("--");
      continue;
    }

    String tempText = String(weatherData.detailTempC[i], 1);
    String humText = String(weatherData.detailHumidity[i]) + "%";
    String windText = String(weatherData.detailWindMs[i], 1) + "m/s";

    tft.setTextSize(2);
    tft.setTextColor(lightTheme ? TFT_BLACK : TFT_CYAN);
    int tempX = cx - ((int)tempText.length() * 6);
    tft.setCursor(tempX, yTemp);
    tft.print(tempText);
    tft.drawCircle(tempX + ((int)tempText.length() * 12) + 3, yTemp + 3, 2, lightTheme ? TFT_BLACK : TFT_CYAN);

    tft.setTextSize(1);
    tft.setTextColor(bodySecondary);
    String nightText = "--";
    if (i >= 2 && i <= 3 && weatherData.nightTempValid[i - 2]) {
      nightText = String(weatherData.nightTempC[i - 2], 1) + "C";
    }
    tft.setCursor(cx - ((int)nightText.length() * 3), yNight);
    tft.print(nightText);

    tft.setTextSize(2);
  tft.setTextColor(bodyText);
    tft.setCursor(cx - ((int)humText.length() * 6), yHum);
    tft.print(humText);

    tft.setTextSize(1);
  tft.setTextColor(lightTheme ? TFT_BLACK : getWindColor(weatherData.detailWindMs[i]));
    tft.setCursor(cx - ((int)windText.length() * 3), yWind);
    tft.print(windText);

    drawWeatherDetailIconCell(cx - 10, yIcon, weatherData.detailWeatherId[i], weatherData.detailIconCode[i]);
  }
}

static void drawWeatherFooterArea(ScreenType screenId) {
  const bool lightTheme = isTftStyleLight();
  tft.fillRect(0, 220, 320, 20, lightTheme ? TFT_WHITE : TFT_BLACK);

  if (isTableNavFooterVisible(screenId)) {
    drawSwitchScreenFooter();
    return;
  }

  String cityLabel = weatherData.cityName;
  cityLabel.trim();
  if (cityLabel.length() == 0) {
    cityLabel = "--";
  }
  cityLabel = sanitizePolishToAscii(cityLabel);

  const String prefix = (tftLanguage == TFT_LANG_EN)
                        ? "Weather for location: "
                        : "Pogoda dla lokalizacji: ";
  const int maxChars = 52; // 320px width at text size 1 (6px/char) with small margins
  int maxCityChars = maxChars - (int)prefix.length();
  if (maxCityChars < 3) {
    maxCityChars = 3;
  }
  if ((int)cityLabel.length() > maxCityChars) {
    cityLabel = cityLabel.substring(0, maxCityChars - 3) + "...";
  }
  String footerLabel = prefix + cityLabel;

  tft.setTextColor(lightTheme ? TFT_BLACK : 0x52AA);
  tft.setTextSize(1);
  int footerWidth = footerLabel.length() * 6;
  int footerX = (320 - footerWidth) / 2;
  if (footerX < 2) {
    footerX = 2;
  }
  tft.setCursor(footerX, 226);
  tft.print(footerLabel);
}

void updateScreen5Data() {
  if (!tftInitialized ||
      (currentScreen != SCREEN_WEATHER_DSP && currentScreen != SCREEN_WEATHER_FORECAST) ||
      inMenu) {
    return;
  }

  updateScreen5Clock();

  static uint32_t lastWeatherSig = 0;
  static uint32_t lastForecastSig = 0;

  lockWeatherData();
  uint32_t currentSig = computeScreen5Signature();

  if (currentScreen == SCREEN_WEATHER_FORECAST) {
    if (currentSig == lastForecastSig) {
      unlockWeatherData();
      return;
    }
    lastForecastSig = currentSig;
    drawWeatherDetailPage();
    drawWeatherFooterArea(SCREEN_WEATHER_FORECAST);
    unlockWeatherData();
    return;
  }

  if (currentSig == lastWeatherSig) {
    unlockWeatherData();
    return;
  }
  lastWeatherSig = currentSig;

  drawWeatherBody();
  drawWeatherFooterArea(SCREEN_WEATHER_DSP);
  unlockWeatherData();
}

void drawWeather() {
  tft.fillScreen(isTftStyleLight() ? TFT_WHITE : TFT_BLACK);

  tft.fillRect(0, 0, 320, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print(tr(TR_WEATHER));

  struct tm timeinfo;
  if (getTimeWithTimezone(&timeinfo)) {
    char timeBuffer[6];
    strftime(timeBuffer, 6, "%H:%M", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setCursor(315 - timeWidth, 8);
    tft.print(timeBuffer);
  }

  lockWeatherData();
  drawWeatherBody();
  drawWeatherFooterArea(SCREEN_WEATHER_DSP);
  unlockWeatherData();
}

void drawWeatherForecast() {
  tft.fillScreen(isTftStyleLight() ? TFT_WHITE : TFT_BLACK);

  tft.fillRect(0, 0, 320, 32, TFT_RADIO_ORANGE);
  tft.setTextColor(TFT_BLACK);

  const char *detailHeader = (tftLanguage == TFT_LANG_EN) ? "Weather forecast" : "Prognoza pogody";
  tft.setTextSize(2);
  tft.setCursor(35, 8);
  tft.print(detailHeader);

  struct tm timeinfo;
  if (getTimeWithTimezone(&timeinfo)) {
    char timeBuffer[6];
    strftime(timeBuffer, 6, "%H:%M", &timeinfo);
    int timeWidth = strlen(timeBuffer) * 12;
    tft.setCursor(315 - timeWidth, 8);
    tft.print(timeBuffer);
  }

  lockWeatherData();
  drawWeatherDetailPage();
  drawWeatherFooterArea(SCREEN_WEATHER_FORECAST);
  unlockWeatherData();
}

