tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
void setupMatrix() {
  for (int i = 0; i < numDrops; i++) {
    drops[i].x = i * MATRIX_COL_SPACING; // Rozstawienie kolumn
    resetMatrixDropRandom(i);
  }
  matrixInitialized = true;
}

void drawMatrixBackground(int bodyTop, int bodyBottom) {
  const int charStep = 8; // wysokość znaku przy setTextSize(1)
  const int charW = 6;    // szerokość znaku przy setTextSize(1)
  bool anyIntroActive = false;
  for (int i = 0; i < numDrops; i++) {
    int drawX = drops[i].x;
    int drawY = bodyTop + drops[i].y;
    bool dropIntroActive = (matrixIntroActive && drops[i].introActive);

    if (matrixIntroActive && !dropIntroActive && !drops[i].introParticipates) {
      continue;
    }

    if (dropIntroActive) {
      unsigned long introElapsed = millis() - matrixIntroStartMs;
      if (introElapsed >= (unsigned long)drops[i].introDelayMs) {
        unsigned long activeMs = introElapsed;
        float relY = (float)drops[i].introStartY +
                     ((float)((int)activeMs - drops[i].introDelayMs) * drops[i].introSpeedPxPerMs);
        drawY = bodyTop + (int)relY;
      } else {
        drawY = bodyTop + drops[i].introStartY;
      }

      int bodyRelY = drawY - bodyTop;
      if (bodyRelY > (bodyBottom - bodyTop)) {
        drops[i].introActive = false;
        dropIntroActive = false;
        resetMatrixDropRandom(i);
        drawY = bodyTop + drops[i].y;
      } else {
        anyIntroActive = true;
      }
    }

    if (drawX < 0 || drawX > (320 - 6)) {
      if (!dropIntroActive) {
        drops[i].y += drops[i].speed;
        if (drops[i].y > (bodyBottom - bodyTop)) {
          resetMatrixDropRandom(i);
        }
      }
      continue;
    }
    tft.setTextSize(1);
    for (int j = 0; j < drops[i].len; j++) {
      int charY = drawY + (j * charStep);
      if (charY >= bodyTop && charY < bodyBottom) {
        // Blokuj znak tła, jeśli jego prostokąt przecina obszar maski zegara.
        if (drawX < (clockMaskX + clockMaskW) && (drawX + charW) > clockMaskX &&
            charY < (clockMaskY + clockMaskH) && (charY + charStep) > clockMaskY) {
          continue;
        }
        int denom = (drops[i].len > 1) ? (drops[i].len - 1) : 1;
        uint8_t t = (uint8_t)((255 * j) / denom); // 0 (ciemno) -> 255 (jasno)
        // Najniższa litera (głowa) ma być wyraźnie jaśniejsza od drugiej.
        if (j == drops[i].len - 1) {
          t = 255;
        } else if (drops[i].len > 1 && j == drops[i].len - 2) {
          t = min<uint8_t>(t, 135);
        }
        uint16_t color = (j == drops[i].len - 1)
               ? TFT_WHITE
               : lerpColor565(TFT_BLACK, MATRIX_BRIGHTGREEN, t);
        tft.setTextColor(color);
        tft.setCursor(drawX, charY);
        char ch = (j == drops[i].len - 1) ? drops[i].headChar : (char)random(33, 126);
        tft.print(ch);
      }
    }

    if (!dropIntroActive) {
      drops[i].y += drops[i].speed;

      // Reset kropli, gdy wypadnie poza obszar
      if (drops[i].y > (bodyBottom - bodyTop)) {
        resetMatrixDropRandom(i);
      }
    }
  }

  matrixIntroActive = anyIntroActive;
}

void clearMatrixArea(int bodyTop, int bodyBottom) {
  int bodyH = bodyBottom - bodyTop;
  if (clockMaskW <= 0 || clockMaskH <= 0) {
    tft.fillRect(0, bodyTop, SCREEN10_WIDTH, bodyH, TFT_BLACK);
    return;
  }

  int leftW = clockMaskX;
  int rightX = clockMaskX + clockMaskW;
  int rightW = SCREEN10_WIDTH - rightX;
  int topH = clockMaskY - bodyTop;
  int bottomY = clockMaskY + clockMaskH;
  int bottomH = bodyBottom - bottomY;

  if (topH > 0) {
    tft.fillRect(0, bodyTop, SCREEN10_WIDTH, topH, TFT_BLACK);
  }
  if (bottomH > 0) {
    tft.fillRect(0, bottomY, SCREEN10_WIDTH, bottomH, TFT_BLACK);
  }
  if (leftW > 0) {
    tft.fillRect(0, clockMaskY, leftW, clockMaskH, TFT_BLACK);
  }
  if (rightW > 0) {
    tft.fillRect(rightX, clockMaskY, rightW, clockMaskH, TFT_BLACK);
  }
}

void drawMatrixStatic() {
  //tft.fillRect(0, 0, 320, SCREEN10_HEADER_H, TFT_RADIO_ORANGE);
  //tft.setTextColor(TFT_BLACK);
  //tft.setTextSize(2);
 // tft.setCursor(10, 8);
  //tft.print("ZEGAR");

  // StrzaĹ‚ki nawigacyjne na dole ekranu
  //tft.fillTriangle(10, 230, 20, 222, 20, 238, TFT_RADIO_ORANGE);
  //tft.fillTriangle(310, 230, 300, 222, 300, 238, TFT_RADIO_ORANGE);
  //tft.setTextColor(0x52AA); // Ciemny szary
  //tft.setTextSize(1);
  //tft.setCursor(125, 226);
  //tft.print("SWITCH SCREEN");
}

void drawMatrixFrame() {
  String timeLocal = getTimezoneTimeString("%H:%M:%S", 9);
  int timeWidth = timeLocal.length() * CLOCK_CHAR_W * CLOCK_TEXT_SIZE;
  int timeHeight = CLOCK_CHAR_H * CLOCK_TEXT_SIZE;
  const int maskPadX = 3;
  const int maskPadTop = 3;
  const int maskPadBottom = 0; // dolny margines zmniejszony o 3 px
  int timeX = (SCREEN10_WIDTH - timeWidth) / 2;
  int timeY = 20;
  clockMaskX = max(0, timeX - maskPadX);
  clockMaskY = max(0, timeY - maskPadTop);
  clockMaskW = min(SCREEN10_WIDTH - clockMaskX, timeWidth + (2 * maskPadX) + 2);
  clockMaskH = min(SCREEN10_BODY_BOTTOM - clockMaskY,
                   timeHeight + maskPadTop + maskPadBottom + 2);

  clearMatrixArea(SCREEN10_BODY_TOP, SCREEN10_BODY_BOTTOM);
  drawMatrixBackground(SCREEN10_BODY_TOP, SCREEN10_BODY_BOTTOM);

  if (clockNeedsRedraw || timeLocal != lastClockText) {
    tft.fillRect(clockMaskX, clockMaskY, clockMaskW, clockMaskH, TFT_BLACK);
    tft.setTextSize(CLOCK_TEXT_SIZE);

    // PoĹ›wiata
    tft.setTextColor(MATRIX_DARKGREEN);
    tft.setCursor(timeX + 2, timeY + 2);
    tft.print(timeLocal);

    // GĹ‚Ăłwny tekst
    tft.setTextColor(MATRIX_BRIGHTGREEN);
    tft.setCursor(timeX, timeY);
    tft.print(timeLocal);

    lastClockText = timeLocal;
    clockNeedsRedraw = false;
  }

  // Data pod zegarem
 

  // Znak wywoĹ‚awczy
  //tft.setTextSize(2);
  //tft.setTextColor(MATRIX_BRIGHTGREEN);
  //String call = "OP: " + String(userCallsign);
  //call.toUpperCase();
  //tft.setCursor(10, 190);
  //tft.print(call);

  // IP Status

}

// Ekran 10: Zegar z animowanym tĹ‚em
void drawMatrixClock() {
  if (!matrixInitialized) {
    setupMatrix();
  }
  drawMatrixStatic();
  screen10NeedsRedraw = false;
  lastScreen10UpdateMs = millis();
  lastMatrixUpdateMs = 0;
  clockNeedsRedraw = true;
  drawMatrixFrame();
}

void updateScreen10() {
  if (!tftInitialized || currentScreen != SCREEN_MATRIX_CLOCK || inMenu) {
    return;
  }

  unsigned long now = millis();
  if (now - lastScreen10UpdateMs < MATRIX_UPDATE_INTERVAL_MS) {
    return;
  }
  lastScreen10UpdateMs = now;

  if (screen10NeedsRedraw) {
    drawMatrixStatic();
    screen10NeedsRedraw = false;
    clockNeedsRedraw = true;
  }
  drawMatrixFrame();
}

