tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
// ========== Ekran 11: UnlisHunter ==========

bool unlisRunning = false;
bool unlisGameOver = false;
bool unlisIntroVisible = true;
bool unlisIntroNeedsRedraw = true;
bool unlisGameOverNeedsRedraw = false;
bool unlisRunningUiNeedsRedraw = false;
int unlisCaught = 0;
int unlisMissed = 0;
unsigned long unlisGameStartMs = 0;
unsigned long unlisLastFrameMs = 0;
unsigned long unlisElapsedSecFrozen = 0;
float unlisScanAngleDeg = 0.0f;
float unlisPrevScanAngleDeg = 0.0f;
bool unlisArrowPrevValid = false;

bool unlisTargetActive = false;
bool unlisTargetOuter = true;
float unlisTargetAngleDeg = 0.0f;
unsigned long unlisTargetShownMs = 0;
unsigned long unlisNextSpawnMs = 0;

bool unlisSecondTargetActive = false;
bool unlisSecondTargetOuter = true;
float unlisSecondTargetAngleDeg = 0.0f;
unsigned long unlisSecondTargetShownMs = 0;
unsigned long unlisSecondTargetNextSpawnMs = 0;

bool unlisGreenStationActive = false;
bool unlisGreenStationOuter = true;
float unlisGreenStationAngleDeg = 0.0f;
unsigned long unlisGreenStationShownMs = 0;
unsigned long unlisGreenStationNextSpawnMs = 0;

bool unlisOuterEdgeNeedsClean = false;
unsigned long unlisLastPttPressMs = 0;
bool unlisUiNeedsRefreshOnTargetChange = true;
unsigned long unlisLastTimerSecDrawn = 0;
bool unlisTimerDrawnValid = false;

static inline float normalizeDeg360(float a) {
  while (a >= 360.0f) a -= 360.0f;
  while (a < 0.0f) a += 360.0f;
  return a;
}

static float unlisCurrentScanDegPerSec() {
  // Up to 60s: +5% per catch, after 60s: +3% per catch.
  unsigned long elapsedMs = 0;
  if (unlisRunning || unlisGameOver) {
    elapsedMs = millis() - unlisGameStartMs;
  }
  float accelPerCatch = (elapsedMs >= 60000UL) ? UNLIS_ACCEL_PER_CATCH_LATE : UNLIS_ACCEL_PER_CATCH_EARLY;
  return UNLIS_BASE_SCAN_DEG_PER_SEC * (1.0f + ((float)unlisCaught * accelPerCatch));
}

static unsigned long unlisCurrentTargetLifeMs() {
  float degPerSec = unlisCurrentScanDegPerSec();
  float fullRotationSec = 360.0f / degPerSec;
  return (unsigned long)(fullRotationSec * UNLIS_TARGET_LIFE_ROTATIONS * 1000.0f + 0.5f);
}

static unsigned long unlisCurrentPttCooldownMs() {
  float degPerSec = unlisCurrentScanDegPerSec();
  float fullRotationSec = 360.0f / degPerSec;
  return (unsigned long)(fullRotationSec * 0.25f * 1000.0f + 0.5f);
}

static void unlisResetPttCooldown(unsigned long nowMs) {
  unlisLastPttPressMs = nowMs - unlisCurrentPttCooldownMs();
}

static bool unlisPointInButton(int x, int y) {
  if (x >= UNLIS_START_X && x < (UNLIS_START_X + UNLIS_BTN_SIZE) &&
      y >= UNLIS_START_Y && y < (UNLIS_START_Y + UNLIS_BTN_SIZE)) {
    return true;
  }
  if (x >= UNLIS_PTT_X && x < (UNLIS_PTT_X + UNLIS_BTN_SIZE) &&
      y >= UNLIS_PTT_Y && y < (UNLIS_PTT_Y + UNLIS_BTN_SIZE)) {
    return true;
  }
  if (x >= UNLIS_EXIT_X && x < (UNLIS_EXIT_X + UNLIS_BTN_SIZE) &&
      y >= UNLIS_EXIT_Y && y < (UNLIS_EXIT_Y + UNLIS_BTN_SIZE)) {
    return true;
  }
  return false;
}

static void unlisGenerateRandomTarget(bool &targetOuter, float &targetAngleDeg) {
  bool foundVisibleSpot = false;
  bool outer = true;
  float angle = 0.0f;

  for (int i = 0; i < 24; i++) {
    bool candidateOuter = (random(0, 2) == 0);
    float candidateAngle = (float)random(0, 360);
    float a = candidateAngle * (float)M_PI / 180.0f;
    int r = candidateOuter ? UNLIS_OUTER_R : UNLIS_INNER_R;
    int tx = UNLIS_CENTER_X + (int)(sinf(a) * (float)r);
    int ty = UNLIS_CENTER_Y - (int)(cosf(a) * (float)r);
    if (!unlisPointInButton(tx, ty)) {
      outer = candidateOuter;
      angle = candidateAngle;
      foundVisibleSpot = true;
      break;
    }
  }

  if (!foundVisibleSpot) {
    outer = (random(0, 2) == 0);
    angle = (float)random(0, 360);
  }

  targetOuter = outer;
  targetAngleDeg = angle;
}

static bool unlisArrowHitsTarget(bool targetOuter, float targetAngleDeg, int hitPx) {
  float arrowDeg = targetOuter ? unlisScanAngleDeg : normalizeDeg360(unlisScanAngleDeg + 180.0f);
  int ringR = targetOuter ? UNLIS_OUTER_R : UNLIS_INNER_R;
  float arrowA = arrowDeg * (float)M_PI / 180.0f;
  float targetA = targetAngleDeg * (float)M_PI / 180.0f;
  int arrowX = UNLIS_CENTER_X + (int)(sinf(arrowA) * (float)ringR);
  int arrowY = UNLIS_CENTER_Y - (int)(cosf(arrowA) * (float)ringR);
  int targetX = UNLIS_CENTER_X + (int)(sinf(targetA) * (float)ringR);
  int targetY = UNLIS_CENTER_Y - (int)(cosf(targetA) * (float)ringR);
  int dx = arrowX - targetX;
  int dy = arrowY - targetY;
  return (dx * dx + dy * dy) <= (hitPx * hitPx);
}

static void drawUnlisButton(int x, int y, const char* label) {
  const int drawW = UNLIS_DRAW_BTN_SIZE;
  const int drawH = UNLIS_DRAW_BTN_SIZE;
  int drawX = x + 10;
  int drawY = y + 10;

  // Keep visual buttons closer to screen corners (~10 px margin).
  if (x == UNLIS_PTT_X) {
    drawX = x + (UNLIS_BTN_SIZE - drawW - 10);
  }
  if (y == UNLIS_START_Y) {
    drawY = y;
  }
  if (y == UNLIS_PTT_Y || y == UNLIS_EXIT_Y) {
    drawY = y + (UNLIS_BTN_SIZE - drawH);
  }
  const int r = 10;

  // Czarny przycisk z lekkim efektem wypuklosci.
  tft.fillRoundRect(drawX, drawY, drawW, drawH, r, TFT_BLACK);
  tft.drawRoundRect(drawX, drawY, drawW, drawH, r, TFT_LIGHTGREY);
  tft.drawFastHLine(drawX + 8, drawY + 4, drawW - 16, TFT_WHITE);
  tft.drawFastVLine(drawX + 4, drawY + 8, drawH - 16, TFT_WHITE);
  tft.drawFastHLine(drawX + 8, drawY + drawH - 5, drawW - 16, TFT_DARKGREY);
  tft.drawFastVLine(drawX + drawW - 5, drawY + 8, drawH - 16, TFT_DARKGREY);

  tft.setTextSize(2);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  int labelW = (int)strlen(label) * 12;
  tft.setCursor(drawX + (drawW - labelW) / 2, drawY + 18);
  tft.print(label);
}

static void drawUnlisButtons() {
  const char* startLabel = unlisRunning ? "STOP" : "START";
  drawUnlisButton(UNLIS_START_X, UNLIS_START_Y, startLabel);
  drawUnlisButton(UNLIS_PTT_X, UNLIS_PTT_Y, "PTT");
  drawUnlisButton(UNLIS_EXIT_X, UNLIS_EXIT_Y, "EXIT");
}

static void drawUnlisScoreAndMissMarkers() {
  tft.fillRect(2, 52, 84, 96, TFT_BLACK);

  String scoreText = String(unlisCaught);
  while (scoreText.length() < 3) {
    scoreText = "0" + scoreText;
  }

  tft.setTextSize(2);
  tft.setTextColor(TFT_GREEN, TFT_BLACK);
  tft.setCursor(4, 56);
  tft.print(scoreText);

  const int markerX = 12;
  const int markerMidY = 120;
  const int markerStepY = 18;
  const int markerR = 5;
  for (int i = 0; i < 3; i++) {
    int markerY = markerMidY + ((i - 1) * markerStepY);
    bool missed = (unlisMissed > i);
    if (missed) {
      tft.fillCircle(markerX, markerY, markerR, TFT_RED);
      tft.drawCircle(markerX, markerY, markerR, TFT_RED);
    } else {
      tft.fillCircle(markerX, markerY, markerR, TFT_BLACK);
      tft.drawCircle(markerX, markerY, markerR, TFT_DARKGREY);
    }
  }
}

static void drawUnlisBandLegend() {
  tft.setTextSize(1);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setCursor(286, 96);
  tft.print("BAND:");
  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.setCursor(292, 108);
  tft.print("2m");
  tft.setTextColor(TFT_BLUE, TFT_BLACK);
  tft.setCursor(286, 120);
  tft.print("70cm");
}

static void drawUnlisTimerValue(unsigned long elapsedSec) {
  String timerText = String(elapsedSec) + "s";
  int tw = timerText.length() * 12;
  tft.fillRect(236, 2, 82, 20, TFT_BLACK);
  tft.setTextSize(2);
  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setCursor(316 - tw, 6);
  tft.print(timerText);
}

static void drawUnlisHud() {
  drawUnlisButtons();
  
  unsigned long elapsedSec = 0;
  if (unlisRunning) {
    elapsedSec = (millis() - unlisGameStartMs) / 1000UL;
  } else if (unlisGameOver) {
    elapsedSec = unlisElapsedSecFrozen;
  }

  drawUnlisScoreAndMissMarkers();
  drawUnlisBandLegend();
  drawUnlisTimerValue(elapsedSec);
}

static void drawUnlisStatsOnly() {

  unsigned long elapsedSec = 0;
  if (unlisRunning) {
    elapsedSec = (millis() - unlisGameStartMs) / 1000UL;
  } else if (unlisGameOver) {
    elapsedSec = unlisElapsedSecFrozen;
  }

  drawUnlisScoreAndMissMarkers();
  drawUnlisTimerValue(elapsedSec);
}

static void drawUnlisIntroText() {
  tft.fillRect(40, 72, 240, 92, TFT_BLACK);
  tft.drawRect(40, 72, 240, 92, TFT_DARKGREY);

  tft.setTextColor(TFT_YELLOW, TFT_BLACK);
  tft.setTextSize(2);
  tft.setCursor(52, 82);
  tft.print("UNLIS HUNTER GAME");

  tft.setTextColor(TFT_WHITE, TFT_BLACK);
  tft.setTextSize(1);
  tft.setCursor(52, 114);
  tft.print("Use a Yagi antenna to catch and");
  tft.setCursor(52, 130);
  tft.print("jam its signal by pressing PTT on it.");
  tft.setCursor(52, 146);
  tft.print("* Unlis = Unlicensed");
}

static void drawUnlisRadarBase() {
  tft.drawCircle(UNLIS_CENTER_X, UNLIS_CENTER_Y, UNLIS_INNER_R, TFT_BLUE);
  tft.fillCircle(UNLIS_CENTER_X, UNLIS_CENTER_Y, 3, TFT_GREEN);
}

