tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
static volatile bool uiPendingScreen1Redraw = false;
static volatile bool uiPendingScreen2Redraw = false;
static volatile bool uiPendingScreen6Redraw = false;
static volatile bool uiPendingScreen7Redraw = false;
static volatile bool uiPendingAnyScreenRedraw = false;
static volatile uint8_t uiPendingAnyScreenId = SCREEN_HAM_CLOCK;
static portMUX_TYPE uiPendingRedrawMux = portMUX_INITIALIZER_UNLOCKED;

static void requestUiScreenRedraw(uint8_t pendingScreenId) {
  portENTER_CRITICAL(&uiPendingRedrawMux);
  uiPendingAnyScreenId = pendingScreenId;
  uiPendingAnyScreenRedraw = true;
  switch (pendingScreenId) {
    case SCREEN_HAM_CLOCK:
      uiPendingScreen1Redraw = true;
      break;
    case SCREEN_DX_CLUSTER:
      uiPendingScreen2Redraw = true;
      break;
    case SCREEN_APRS_IS:
    case SCREEN_APRS_RADAR:
      uiPendingScreen6Redraw = true;
      break;
    case SCREEN_POTA_CLUSTER:
      uiPendingScreen7Redraw = true;
      break;
    default:
      break;
  }
  portEXIT_CRITICAL(&uiPendingRedrawMux);
}

// Aktualizuj ekran 2 (DX Cluster) - wywoływane gdy przyjdą nowe spoty
void updateScreen2() {
  if (currentScreen == SCREEN_DX_CLUSTER && !inMenu && !aprsAlertScreenActive) {
    requestUiScreenRedraw(SCREEN_DX_CLUSTER);
  }
}

void updateScreen7() {
  if (currentScreen == SCREEN_POTA_CLUSTER && !inMenu && !aprsAlertScreenActive) {
    requestUiScreenRedraw(SCREEN_POTA_CLUSTER);
  }
}

void updateScreen6() {
  if ((currentScreen == SCREEN_APRS_IS || currentScreen == SCREEN_APRS_RADAR) && !inMenu && !aprsAlertScreenActive) {
    requestUiScreenRedraw(currentScreen);
  }
}

// Aktualizuj ekran 1 (Info) - wywoływane gdy zmieni się IP
void updateScreen1() {
  if (bootSequenceActive) {
    return;
  }
  if (currentScreen == SCREEN_HAM_CLOCK && !inMenu && !aprsAlertScreenActive) {
    requestUiScreenRedraw(SCREEN_HAM_CLOCK);
  }
}
#endif

void bootLogLine(const String &line) {
  Serial.println(line);
#ifdef ENABLE_TFT_DISPLAY
  if (tftInitialized) {
    tftBootPrintLine(line);
  }
#endif
  if (bootSequenceActive) {
    delay(500);
  }
}

// ========== FUNKCJE POMOCNICZE ==========
static uint16_t readBmp16(fs::File &f) {
  uint16_t result;
  ((uint8_t *)&result)[0] = f.read(); // LSB
  ((uint8_t *)&result)[1] = f.read(); // MSB
  return result;
}

static uint32_t readBmp32(fs::File &f) {
  uint32_t result;
  ((uint8_t *)&result)[0] = f.read();
  ((uint8_t *)&result)[1] = f.read();
  ((uint8_t *)&result)[2] = f.read();
  ((uint8_t *)&result)[3] = f.read();
  return result;
}

static bool drawBmpFromFS(const String &filename, int16_t x, int16_t y) {
  bool oldSwap = false;
  bool swapChanged = false;
  try {
  if (!littleFsReady) {
    return false;
  }
  if ((x >= tft.width()) || (y >= tft.height())) {
    return false;
  }
  // Nie sprawdzaj exists() osobno: to robi dodatkowe fopen() i bywa niestabilne
  // po update frameworku; bezpieczniej jest od razu próbować open().
  fs::File bmpFS = LittleFS.open(filename.c_str(), "r");
  if (!bmpFS) {
    return false;
  }

  uint32_t seekOffset;
  int32_t w, h;
  if (readBmp16(bmpFS) != 0x4D42) {
    bmpFS.close();
    return false;
  }

  readBmp32(bmpFS);
  readBmp32(bmpFS);
  seekOffset = readBmp32(bmpFS);
  readBmp32(bmpFS);
  w = readBmp32(bmpFS);
  h = readBmp32(bmpFS);

  uint16_t planes = readBmp16(bmpFS);
  uint16_t bpp = readBmp16(bmpFS);
  uint32_t compression = readBmp32(bmpFS);

  // Support classic 24-bit BMP (weather icons) and 32-bit BMP (e.g. startup logo).
  bool bmp24 = (bpp == 24 && compression == 0);
  bool bmp32 = (bpp == 32 && (compression == 0 || compression == 3));
  if (planes != 1 || (!bmp24 && !bmp32) || w <= 0 || h == 0) {
    bmpFS.close();
    return false;
  }

  int32_t absH = (h > 0) ? h : -h;
  // Twarde limity dla ikon/tła na tym TFT, by nie ryzykować uszkodzenia stosu.
  if (w > 320 || absH > 320) {
    bmpFS.close();
    return false;
  }

  bool bottomUp = (h > 0);
  if (bottomUp) {
    y += (int16_t)(absH - 1);
  }

  oldSwap = tft.getSwapBytes();
  tft.setSwapBytes(true);
  swapChanged = true;
  bmpFS.seek(seekOffset);

  const uint8_t bytesPerPixel = bmp32 ? 4 : 3;
  uint16_t padding = (4 - (((uint32_t)w * bytesPerPixel) & 3)) & 3;
  uint32_t rowSize = (uint32_t)w * bytesPerPixel + padding;
  if (rowSize == 0 || rowSize > 2048) {
    tft.setSwapBytes(oldSwap);
    bmpFS.close();
    return false;
  }
  static uint8_t lineBuffer[2048];

  for (int32_t row = 0; row < absH; row++) {
    if (bmpFS.read(lineBuffer, rowSize) != (int)rowSize) {
      tft.setSwapBytes(oldSwap);
      bmpFS.close();
      return false;
    }
    uint8_t *bptr = lineBuffer;
    uint16_t *tptr = (uint16_t *)lineBuffer;
    for (int32_t col = 0; col < w; col++) {
      uint8_t b = *bptr++;
      uint8_t g = *bptr++;
      uint8_t r = *bptr++;
      if (bmp32) {
        bptr++; // Skip alpha/extra byte.
      }
      *tptr++ = ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
    }
    if (bottomUp) {
      tft.pushImage(x, y--, (uint16_t)w, 1, (uint16_t *)lineBuffer);
    } else {
      tft.pushImage(x, y + (int16_t)row, (uint16_t)w, 1, (uint16_t *)lineBuffer);
    }
  }

  tft.setSwapBytes(oldSwap);
  swapChanged = false;
  bmpFS.close();
  return true;
  } catch (...) {
    if (swapChanged) {
      tft.setSwapBytes(oldSwap);
    }
    Serial.println("[BMP] Wyjatek podczas odczytu ikony BMP - pomijam rysowanie");
    return false;
  }
}

// ZwrĂłÄ‡ surowy symbol APRS jako 2 znaki (table + code)
String getAPRSSymbolRaw(const APRSStation &station) {
  if (station.symbolTable.length() > 0 && station.symbol.length() > 0) {
    return station.symbolTable + station.symbol;
  }
  if (station.symbol.length() > 0) {
    return station.symbol;
  }
  return "-";
}

// ZwrĂłÄ‡ krĂłtki opis symbolu (<=10 znakĂłw) zgodny z tabelÄ… APRS
String getAPRSSymbolShort(const APRSStation &station) {
  String raw = getAPRSSymbolRaw(station);
  if (raw == "/-") return "HOUSE";
  if (raw == "/>") return "CAR";
  if (raw == "/#") return "DIGI";
  if (raw == "/r") return "REPEATER";
  if (raw == "/[") return "HUMAN";
  if (raw == "/l") return "LAPTOP";
  if (raw == "/L") return "LOGIN";
  if (raw == "/_") return "WX";
  if (raw == "/s") return "SHIP";
  if (raw == "/a") return "AMBUL";
  if (raw == "/b") return "BIKE";
  if (raw == "/c") return "ICP";
  if (raw == "/d") return "FIRE";
  if (raw == "/f") return "FIRETRK";
  if (raw == "/h") return "HOSP";
  if (raw == "/y") return "YAGI";
  if (raw == "/g") return "GLIDER";
  if (raw == "/k") return "TRUCK";
  if (raw == "/u") return "TRUCK";
  if (raw == "/v") return "VAN";
  if (raw == "/V") return "HAMCLOCK";
  if (raw == "/p") return "ROVER";
  if (raw == "/o") return "EOC";
  if (raw == "/t") return "TRKSTOP";
  if (raw == "/m") return "MICERPT";
  if (raw == "/n") return "NODE";
  if (raw == "/q") return "GRID";
  if (raw == "La" || raw == "L_" ) return "LORA";
  if (raw == "L#" || raw == "L&") return "LORA";
  return raw;
}

static String getAprsAlertSymbolDescription(const APRSStation &station) {
  String symbolShort = getAPRSSymbolShort(station);
  if (symbolShort == "HOUSE") return "Home station";
  if (symbolShort == "CAR") return "CAR";
  if (symbolShort == "DIGI") return "Digipeater";
  if (symbolShort == "REPEATER") return "Repeater";
  if (symbolShort == "HUMAN") return "Pedestrian";
  if (symbolShort == "LAPTOP") return "Mobile station";
  if (symbolShort == "LOGIN") return "Login point";
  if (symbolShort == "WX") return "Weather station";
  if (symbolShort == "SHIP") return "Ship";
  if (symbolShort == "AMBUL") return "Ambulans";
  if (symbolShort == "BIKE") return "Bicycle";
  if (symbolShort == "FIRE") return "Fire";
  if (symbolShort == "FIRETRK") return "Fire truck";
  if (symbolShort == "HOSP") return "Hospital";
  if (symbolShort == "GLIDER") return "Glider";
  if (symbolShort == "TRUCK") return "Truck";
  if (symbolShort == "VAN") return "Van";
  if (symbolShort == "ROVER") return "Rover";
  if (symbolShort == "NODE") return "Node";
  if (symbolShort == "LORA") return "LoRa";
  return String("Symbol: ") + symbolShort;
}

static bool isAprsWeatherStationSymbol(const APRSStation &station) {
  if (station.symbol == "_") {
    return true;
  }
  String symbolShort = getAPRSSymbolShort(station);
  if (symbolShort == "WX") {
    return true;
  }
  String rawSymbol = getAPRSSymbolRaw(station);
  return rawSymbol.length() >= 2 && rawSymbol.charAt(rawSymbol.length() - 1) == '_';
}

struct AprsWxDecoded {
  bool hasAny = false;
  bool hasWindDir = false;
  int windDirDeg = 0;
  bool hasWindSpeed = false;
  float windSpeedKmh = 0.0f;
  bool hasTempC = false;
  float tempC = 0.0f;
  bool hasHumidity = false;
  int humidityPct = 0;
  bool hasPressure = false;
  float pressureHpa = 0.0f;
};

static bool aprsWxReadDigits(const String &text, int start, int len, int &valueOut) {
  if (start < 0 || len <= 0 || (start + len) > text.length()) {
    return false;
  }
  int value = 0;
  for (int i = 0; i < len; i++) {
    char c = text.charAt(start + i);
    if (!isDigit(c)) {
      return false;
    }
    value = (value * 10) + (c - '0');
  }
  valueOut = value;
  return true;
}

static bool decodeAprsWxFromComment(const String &commentRaw, AprsWxDecoded &wx) {
  wx = AprsWxDecoded();

  String text = commentRaw;
  text.trim();
  if (text.length() == 0) {
    return false;
  }

  int dirDeg = 0;
  int speedMph = 0;
  if (text.length() >= 7 &&
      aprsWxReadDigits(text, 0, 3, dirDeg) &&
      text.charAt(3) == '/' &&
      aprsWxReadDigits(text, 4, 3, speedMph)) {
    wx.hasWindDir = true;
    wx.windDirDeg = dirDeg % 360;
    wx.hasWindSpeed = true;
    wx.windSpeedKmh = speedMph * 1.60934f;
  }

