tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  for (int i = 0; i < text.length(); i++) {
    char tag = text.charAt(i);
    int digits = 0;
    switch (tag) {
      case 'c':
      case 's':
      case 'g':
      case 't':
      case 'r':
      case 'p':
      case 'P':
        digits = 3;
        break;
      case 'h':
        digits = 2;
        break;
      case 'b':
        digits = 5;
        break;
      default:
        break;
    }

    if (digits == 0) {
      continue;
    }

    int value = 0;
    if (!aprsWxReadDigits(text, i + 1, digits, value)) {
      continue;
    }

    if (tag == 'c') {
      wx.hasWindDir = true;
      wx.windDirDeg = value % 360;
    } else if (tag == 's' || (tag == 'g' && !wx.hasWindSpeed)) {
      wx.hasWindSpeed = true;
      wx.windSpeedKmh = value * 1.60934f;
    } else if (tag == 't') {
      wx.hasTempC = true;
      wx.tempC = (value - 32.0f) * (5.0f / 9.0f);
    } else if (tag == 'h') {
      wx.hasHumidity = true;
      wx.humidityPct = (value == 0) ? 100 : value;
      if (wx.humidityPct > 100) {
        wx.humidityPct = 100;
      }
    } else if (tag == 'b') {
      wx.hasPressure = true;
      wx.pressureHpa = value / 10.0f;
    }
  }

  wx.hasAny = wx.hasWindDir || wx.hasWindSpeed || wx.hasTempC || wx.hasHumidity || wx.hasPressure;
  return wx.hasAny;
}

static bool isAprsWxPayloadValidForAlert(const APRSStation &station) {
  if (!isAprsWeatherStationSymbol(station)) {
    return false;
  }

  AprsWxDecoded wx;
  if (!decodeAprsWxFromComment(station.comment, wx)) {
    return false;
  }

  // Minimalny warunek poprawnej ramki WX do alertu: temperatura + wilgotnosc.
  return wx.hasTempC && wx.hasHumidity;
}

static void drawAprsAlertWrappedComment(const String &comment, int x, int y, int widthPx, int maxLines, int textSize) {
  String text = comment;
  text.trim();
  if (text.length() == 0) {
    text = "-";
  }

  const int safeTextSize = (textSize < 1) ? 1 : textSize;
  const int charWidth = 6 * safeTextSize;
  const int lineHeight = (8 * safeTextSize) + 2;
  const int maxCharsPerLine = (charWidth > 0) ? (widthPx / charWidth) : widthPx;
  int cursor = 0;
  int line = 0;

  while (cursor < text.length() && line < maxLines) {
    int end = cursor + maxCharsPerLine;
    if (end >= text.length()) {
      end = text.length();
    } else {
      int split = end;
      while (split > cursor && text.charAt(split) != ' ') {
        split--;
      }
      if (split > cursor) {
        end = split;
      }
    }

    String lineText = text.substring(cursor, end);
    lineText.trim();
    if (lineText.length() > 0) {
      tft.setCursor(x, y + line * lineHeight);
      tft.print(lineText);
      line++;
    }

    cursor = end;
    while (cursor < text.length() && text.charAt(cursor) == ' ') {
      cursor++;
    }
  }
}

static void drawAprsAlertCarIcon(int centerX, int topY, uint16_t color) {
  const int bodyW = 60;
  const int bodyH = 14;
  const int roofW = 33;
  const int roofH = 9;

  const int bodyX = centerX - (bodyW / 2);
  const int roofX = centerX - (roofW / 2);
  const int roofY = topY;
  const int bodyY = topY + 9;

  tft.fillRoundRect(bodyX, bodyY, bodyW, bodyH, 2, color);
  tft.fillRoundRect(roofX, roofY, roofW, roofH, 2, color);

  tft.fillCircle(bodyX + 13, bodyY + bodyH, 6, TFT_DARKGREY);
  tft.fillCircle(bodyX + bodyW - 13, bodyY + bodyH, 6, TFT_DARKGREY);
  tft.fillCircle(bodyX + 13, bodyY + bodyH, 3, TFT_LIGHTGREY);
  tft.fillCircle(bodyX + bodyW - 13, bodyY + bodyH, 3, TFT_LIGHTGREY);
  tft.fillCircle(bodyX + 3, bodyY + 3, 2, TFT_YELLOW);
  tft.fillCircle(bodyX + 3, bodyY + 8, 2, TFT_YELLOW);
}

static void drawAprsAlertHouseIcon(int centerX, int topY) {
  const int bodyW = 39;
  const int bodyH = 24;
  const int bodyX = centerX - (bodyW / 2);
  const int bodyY = topY + 10;

  // Ściany domu (żółte)
  tft.fillRect(bodyX, bodyY, bodyW, bodyH, TFT_YELLOW);

  // Dach dwuspadowy (brązowy)
  const uint16_t roofColor = TFT_GREEN;
  int roofTopY = topY;
  tft.fillTriangle(centerX, roofTopY, bodyX - 3, bodyY + 1, bodyX + bodyW + 3, bodyY + 1, roofColor);

  // Drzwi i okna dla czytelności
  tft.fillRect(centerX - 4, bodyY + 12, 8, 12, TFT_DARKGREY);
  tft.fillRect(bodyX + 4, bodyY + 6, 6, 6, TFT_LIGHTGREY);
  tft.fillRect(bodyX + bodyW - 10, bodyY + 6, 6, 6, TFT_LIGHTGREY);
}

static void drawAprsAlertHumanIcon(int centerX, int topY) {
  const uint16_t bodyColor = TFT_RED;
  const uint16_t headColor = TFT_BLUE;
  int headX = centerX;
  int headY = topY + 5;

  // Głowa
  tft.fillCircle(headX, headY, 4, headColor);

  // Tułów (lekko pochylony)
  tft.drawLine(headX, headY + 4, headX + 2, headY + 18, bodyColor);
  tft.drawLine(headX + 1, headY + 4, headX + 3, headY + 18, bodyColor);
  tft.drawLine(headX + 2, headY + 4, headX + 4, headY + 18, bodyColor);
  tft.drawLine(headX + 3, headY + 4, headX + 5, headY + 18, bodyColor);

  // Ręce (ruch spaceru)
  tft.drawLine(headX + 1, headY + 8, headX - 6, headY + 12, bodyColor);
  tft.drawLine(headX + 3, headY + 8, headX + 10, headY + 11, bodyColor);
  tft.drawLine(headX + 2, headY + 9, headX - 5, headY + 13, bodyColor);
  tft.drawLine(headX + 4, headY + 9, headX + 11, headY + 12, bodyColor);
  tft.drawLine(headX + 3, headY + 10, headX - 4, headY + 14, bodyColor);
  tft.drawLine(headX + 5, headY + 10, headX + 12, headY + 13, bodyColor);

  // Nogi (jedna do przodu, druga do tyłu)
  tft.drawLine(headX + 3, headY + 18, headX - 4, headY + 28, bodyColor);
  tft.drawLine(headX + 3, headY + 18, headX + 12, headY + 27, bodyColor);
  tft.drawLine(headX + 4, headY + 18, headX - 3, headY + 28, bodyColor);
  tft.drawLine(headX + 4, headY + 18, headX + 13, headY + 27, bodyColor);
  tft.drawLine(headX + 5, headY + 18, headX - 2, headY + 28, bodyColor);
  tft.drawLine(headX + 5, headY + 18, headX + 14, headY + 27, bodyColor);
}

static void drawAprsAlertCompass(int centerX, int centerY, int radius, bool hasBearing, float bearingDeg) {
  tft.drawCircle(centerX, centerY, radius, TFT_DARKGREY);
  tft.drawCircle(centerX, centerY, radius - 1, TFT_DARKGREY);

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  tft.setCursor(centerX - 3, centerY - radius - 9);
  tft.print("N");

  tft.drawFastVLine(centerX, centerY - radius + 2, 4, TFT_DARKGREY);
  tft.drawFastVLine(centerX, centerY + radius - 5, 4, TFT_DARKGREY);
  tft.drawFastHLine(centerX - radius + 2, centerY, 4, TFT_DARKGREY);
  tft.drawFastHLine(centerX + radius - 5, centerY, 4, TFT_DARKGREY);

  if (!hasBearing) {
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(centerX - 6, centerY + radius + 2);
    tft.print("---");
    return;
  }

  float angleRad = bearingDeg * M_PI / 180.0f;
  int tipX = centerX + (int)(sin(angleRad) * (radius - 3));
  int tipY = centerY - (int)(cos(angleRad) * (radius - 3));

