tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  int perpX = (int)round(cos(angleRad));
  int perpY = (int)round(sin(angleRad));
  tft.drawLine(centerX, centerY, tipX, tipY, TFT_CYAN);
  tft.drawLine(centerX + perpX, centerY + perpY, tipX + perpX, tipY + perpY, TFT_CYAN);
  tft.fillCircle(tipX, tipY, 2, TFT_CYAN);
  tft.fillCircle(centerX, centerY, 1, TFT_CYAN);

  String bearingTxt = String((int)(bearingDeg + 0.5f)) + "d";
  int txtX = centerX - (bearingTxt.length() * 3);
  tft.setTextColor(TFT_WHITE);
  tft.setCursor(txtX, centerY + radius + 2);
  tft.print(bearingTxt);
}

static void drawAprsAlertFrame(bool pulseOn) {
  const int frameX = 10;
  const int frameY = 50;
  const int frameW = 300;
  const int frameH = 185;
  const int frameR = 8;
  uint16_t frameColor = pulseOn ? TFT_WHITE : TFT_LIGHTGREY;

  tft.drawRoundRect(frameX - 3, frameY - 3, frameW + 6, frameH + 6, frameR + 3, TFT_BLACK);
  tft.drawRoundRect(frameX - 1, frameY - 1, frameW + 2, frameH + 2, frameR + 1, TFT_BLACK);
  tft.drawRoundRect(frameX - 2, frameY - 2, frameW + 4, frameH + 4, frameR + 2, TFT_BLACK);
  tft.drawRoundRect(frameX, frameY, frameW, frameH, frameR, TFT_BLACK);
  tft.drawRoundRect(frameX, frameY, frameW, frameH, frameR, frameColor);
  if (pulseOn) {
    tft.drawRoundRect(frameX - 3, frameY - 3, frameW + 6, frameH + 6, frameR + 3, frameColor);
    tft.drawRoundRect(frameX - 1, frameY - 1, frameW + 2, frameH + 2, frameR + 1, frameColor);
    tft.drawRoundRect(frameX - 2, frameY - 2, frameW + 4, frameH + 4, frameR + 2, frameColor);
  }
}

static void drawAprsAlertCloseButton() {
  tft.fillRoundRect(APRS_ALERT_CLOSE_BTN_X, APRS_ALERT_CLOSE_BTN_Y, APRS_ALERT_CLOSE_BTN_W, APRS_ALERT_CLOSE_BTN_H, 5, TFT_RADIO_ORANGE);
  tft.drawRoundRect(APRS_ALERT_CLOSE_BTN_X, APRS_ALERT_CLOSE_BTN_Y, APRS_ALERT_CLOSE_BTN_W, APRS_ALERT_CLOSE_BTN_H, 5, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + 7, APRS_ALERT_CLOSE_BTN_Y + 7,
               APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 8, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 8, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 8, APRS_ALERT_CLOSE_BTN_Y + 7,
               APRS_ALERT_CLOSE_BTN_X + 7, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 8, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + 8, APRS_ALERT_CLOSE_BTN_Y + 7,
               APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 7, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 8, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + 7, APRS_ALERT_CLOSE_BTN_Y + 8,
               APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 8, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 7, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 7, APRS_ALERT_CLOSE_BTN_Y + 7,
               APRS_ALERT_CLOSE_BTN_X + 8, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 8, TFT_BLACK);
  tft.drawLine(APRS_ALERT_CLOSE_BTN_X + APRS_ALERT_CLOSE_BTN_W - 8, APRS_ALERT_CLOSE_BTN_Y + 8,
               APRS_ALERT_CLOSE_BTN_X + 7, APRS_ALERT_CLOSE_BTN_Y + APRS_ALERT_CLOSE_BTN_H - 7, TFT_BLACK);
}

static bool isAprsAlertCloseButtonHit(uint16_t x, uint16_t y) {
  int hitX = APRS_ALERT_CLOSE_BTN_X + ((APRS_ALERT_CLOSE_BTN_W - APRS_ALERT_CLOSE_HIT_W) / 2);
  int hitY = APRS_ALERT_CLOSE_BTN_Y + ((APRS_ALERT_CLOSE_BTN_H - APRS_ALERT_CLOSE_HIT_H) / 2);
  if (hitX < 0) hitX = 0;
  if (hitY < 0) hitY = 0;

  int hitRight = hitX + APRS_ALERT_CLOSE_HIT_W;
  int hitBottom = hitY + APRS_ALERT_CLOSE_HIT_H;
  if (hitRight > 320) hitRight = 320;
  if (hitBottom > 240) hitBottom = 240;

  return x >= hitX && x < hitRight && y >= hitY && y < hitBottom;
}

static void dismissAprsAlertScreen() {
  if (!aprsAlertScreenActive) {
    return;
  }
  aprsAlertScreenActive = false;
  activeAlertScreenKind = ALERT_SCREEN_NONE;
  drawScreen(currentScreen);
  if (currentScreen == SCREEN_HAM_CLOCK) {
    updateScreen1();
  }
}

static void setRgbLedChannel(uint8_t pin, bool on) {
  digitalWrite(pin, on ? LOW : HIGH);
}

static void applyRgbLedState(bool redOn, bool greenOn, bool blueOn) {
  setRgbLedChannel(RGB_LED_RED_PIN, redOn);
  setRgbLedChannel(RGB_LED_GREEN_PIN, greenOn);
  setRgbLedChannel(RGB_LED_BLUE_PIN, blueOn);
}

static void initStatusRgbLed() {
  pinMode(RGB_LED_RED_PIN, OUTPUT);
  pinMode(RGB_LED_GREEN_PIN, OUTPUT);
  pinMode(RGB_LED_BLUE_PIN, OUTPUT);

  rgbLedPrevWifiConnected = false;
  rgbRedBlinkLastToggleMs = millis();
  rgbRedBlinkStateOn = false;
  rgbBlueAprsAlertActive = false;
  rgbBlueAprsAlertUntilMs = 0;
  rgbBlueAprsLastToggleMs = 0;
  rgbBlueAprsStateOn = false;

  applyRgbLedState(false, false, false);
}


static int normalizeLedAlertDurationMs(int durationMs) {
  if (durationMs < 100) return 100;
  if (durationMs > 60000) return 60000;
  return durationMs;
}

static void applyLedAlertDurationMs(int durationMs) {
  ledAlertDurationMs = normalizeLedAlertDurationMs(durationMs);
}

static int normalizeLedAlertBlinkMs(int blinkMs) {
  if (blinkMs < 50) return 50;
  if (blinkMs > 5000) return 5000;
  return blinkMs;
}

static void applyLedAlertBlinkMs(int blinkMs) {
  ledAlertBlinkMs = normalizeLedAlertBlinkMs(blinkMs);
}

static void triggerAprsRgbLedAlert() {
  if (!enableLedAlert) {
    return;
  }

  unsigned long nowMs = millis();
  rgbBlueAprsAlertActive = true;
  rgbBlueAprsAlertUntilMs = nowMs + (unsigned long)ledAlertDurationMs;
  rgbBlueAprsLastToggleMs = nowMs;
  rgbBlueAprsStateOn = true;
  applyRgbLedState(false, false, true);
}

static void updateStatusRgbLed() {
  unsigned long nowMs = millis();

  if (rgbBlueAprsAlertActive) {
    if ((long)(nowMs - rgbBlueAprsAlertUntilMs) >= 0) {
      rgbBlueAprsAlertActive = false;
      rgbBlueAprsStateOn = false;
    } else if (nowMs - rgbBlueAprsLastToggleMs >= (unsigned long)ledAlertBlinkMs) {
      rgbBlueAprsLastToggleMs = nowMs;
      rgbBlueAprsStateOn = !rgbBlueAprsStateOn;
    }

    if (rgbBlueAprsAlertActive) {
      applyRgbLedState(false, false, rgbBlueAprsStateOn);
      return;
    }
  }

  applyRgbLedState(false, false, false);
}

void ALERT_Screen(const APRSStation &station) {
  if (!tftInitialized) {
    return;
  }

