tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  aprsAlertScreenStation = station;
  aprsAlertScreenActive = true;
  activeAlertScreenKind = ALERT_SCREEN_APRS;
  aprsAlertScreenUntilMs = millis() + ((unsigned long)aprsAlertScreenSeconds * 1000UL);
  aprsAlertFrameLastToggleMs = millis();
  aprsAlertFramePulseOn = true;

  tft.fillScreen(TFT_BLACK);
  tft.fillRect(0, 0, 320, 40, TFT_RADIO_ORANGE);
  tft.drawFastHLine(0, 39, 320, 0x8410);

  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  const String headerText = "APRS ALERT";
  const int headerX = (320 - ((int)headerText.length() * 12)) / 2;
  tft.setCursor(headerX, 12);
  tft.print(headerText);
  tft.setCursor(headerX + 1, 12);
  tft.print(headerText);
  drawAprsAlertCloseButton();

  drawAprsAlertFrame(aprsAlertFramePulseOn);

  String callsign = station.callsign;
  callsign.toUpperCase();
  if (callsign.length() == 0) {
    callsign = "-";
  }

  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(4);
  int callX = (320 - (callsign.length() * 24)) / 2;
  if (callX < 15) {
    callX = 15;
  }
  callX += 20;
  tft.setCursor(callX, 65);
  tft.print(callsign);

  String freqText = "-";
  if (station.freqMHz > 0.0f) {
    freqText = String(station.freqMHz, 3) + " MHz";
  }
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(2);
  int freqX = (320 - (freqText.length() * 12)) / 2;
  freqX += 20;
  if (freqX < 12) {
    freqX = 12;
  }
  tft.setCursor(freqX, 106);
  tft.print(freqText);

  String distanceText = "- km";
  if (station.hasLatLon && station.distance > 0.0f) {
    distanceText = String(station.distance, 1) + " km";
  }
  const int compassX = 46;
  const int compassY = 91;
  const int compassR = 24;
  bool hasBearing = false;
  float bearingDeg = 0.0f;
  double userLatForBearing = 0.0;
  double userLonForBearing = 0.0;
  if (station.hasLatLon && getServiceCoordinatesForServices(userLatForBearing, userLonForBearing)) {
    hasBearing = true;
    bearingDeg = calculateBearing(userLatForBearing, userLonForBearing, (double)station.lat, (double)station.lon);
  }
  drawAprsAlertCompass(compassX, compassY, compassR, hasBearing, bearingDeg);

  tft.setTextColor(TFT_RADIO_ORANGE);
  tft.setTextSize(2);
  int distX = compassX - ((int)distanceText.length() * 12) / 2;
  distX += 22;
  if (distX < 12) {
    distX = 12;
  }
  tft.setCursor(distX, compassY + compassR + 18);
  tft.print(distanceText);

  bool weatherAlert = isAprsWeatherStationSymbol(station);
  String iconDescription = getAprsAlertSymbolDescription(station);
  String iconShort = getAPRSSymbolShort(station);
  uint16_t iconColor = TFT_WHITE;
  if (iconShort == "CAR") {
    iconColor = TFT_RED;
  } else if (iconShort == "HOUSE") {
    iconColor = TFT_YELLOW;
  } else if (iconShort == "HUMAN") {
    iconColor = TFT_BLUE;
  }
  if (weatherAlert) {
    const String weatherTitle = (tftLanguage == TFT_LANG_EN) ? "Weather:" : "Pogoda:";
    tft.setTextColor(TFT_CYAN);
    tft.setTextSize(2);
    int weatherTitleX = (320 - ((int)weatherTitle.length() * 12)) / 2;
    if (weatherTitleX < 15) {
      weatherTitleX = 15;
    }
    weatherTitleX += 50;
    if (weatherTitleX > 300) {
      weatherTitleX = 300;
    }
    tft.setCursor(weatherTitleX, 133);
    tft.print(weatherTitle);

    AprsWxDecoded wx;
    decodeAprsWxFromComment(station.comment, wx);

    const String labelTemp = "TEMP";
    const String labelHumidity = (tftLanguage == TFT_LANG_EN) ? "HUMIDITY" : "WILGOTNOŚĆ";
    const String labelPressure = (tftLanguage == TFT_LANG_EN) ? "PRESSURE" : "CISNIENIE";
    const String labelWind = "WIATR";
    const String labelTempWithColon = labelTemp + ":";
    const String labelHumidityWithColon = labelHumidity + ":";
    const String labelPressureWithColon = labelPressure + ":";
    const String labelWindWithColon = labelWind + ":";

    String tempValue = wx.hasTempC ? (String(wx.tempC, 1) + " C") : "--";
    String humidityValue = wx.hasHumidity ? (String(wx.humidityPct) + "%") : "--";
    String pressureValue = wx.hasPressure ? (String(wx.pressureHpa, 1) + " hPa") : "--";
    String windValue = "--";
    if (wx.hasWindSpeed && wx.hasWindDir) {
      windValue = String(wx.windDirDeg) + " deg " + String(wx.windSpeedKmh, 1) + " km/h";
    } else if (wx.hasWindSpeed) {
      windValue = String(wx.windSpeedKmh, 1) + " km/h";
    } else if (wx.hasWindDir) {
      windValue = String(wx.windDirDeg) + " deg";
    }

    const int leftColX = 20;
    const int rightColX = 170;
    const int topRowY = 184;
    const int bottomRowY = 212;
    const int weatherTopRowY = topRowY - 20;
    const int weatherLabelRowY = weatherTopRowY + 5;
    const int humidityLabelX = rightColX - 20;
    const int tempValueShiftX = 20;
    const int humidityValueShiftX = 20;

    int tempLabelW = (int)labelTempWithColon.length() * 6;
    int humidityLabelW = (int)labelHumidityWithColon.length() * 6;
    if (tryLoadSmoothFont(ROBOTO_FONT12_NAME, ROBOTO_FONT12_FILE)) {
      tft.setTextDatum(TL_DATUM);
      tft.setTextColor(TFT_WHITE);
      tft.drawString(labelTempWithColon, leftColX, weatherLabelRowY);
      tempLabelW = tft.textWidth(labelTempWithColon);
      tft.drawString(labelHumidityWithColon, humidityLabelX, weatherLabelRowY);
      humidityLabelW = tft.textWidth(labelHumidityWithColon);
      tft.unloadFont();

      // Wartosc wieksza (+1) obok etykiety.
      tft.setTextSize(2);
      tft.setTextColor(TFT_BLUE);
      tft.setCursor(leftColX + tempLabelW + 2 + tempValueShiftX, weatherTopRowY + 2);
      tft.print(tempValue);

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(humidityLabelX + humidityLabelW + 2 + humidityValueShiftX, weatherTopRowY + 2);
      tft.print(humidityValue);
    } else {
      // Fallback gdy SmoothFont nie jest dostepny.
      tft.setTextColor(TFT_WHITE);
      tft.setTextSize(1);
      tft.setCursor(leftColX, weatherLabelRowY);
      tft.print(labelTempWithColon);
      tft.setCursor(humidityLabelX, weatherLabelRowY);
      tft.print(labelHumidityWithColon);

      tft.setTextSize(2);
      tft.setTextColor(TFT_BLUE);
      tft.setCursor(leftColX + tempLabelW + 2 + tempValueShiftX, weatherTopRowY + 2);
      tft.print(tempValue);

      tft.setTextColor(TFT_WHITE);
      tft.setCursor(humidityLabelX + humidityLabelW + 2 + humidityValueShiftX, weatherTopRowY + 2);
      tft.print(humidityValue);
    }

    tft.setTextSize(1);

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(leftColX, bottomRowY);
    tft.print(labelPressureWithColon);
    tft.print(" ");
    tft.setTextColor(TFT_WHITE);
    tft.print(pressureValue);

    tft.setTextColor(TFT_WHITE);
    tft.setCursor(rightColX, bottomRowY);
    tft.print(labelWindWithColon);
    tft.print(" ");
    tft.setTextColor(TFT_GREEN);
    tft.print(windValue);
  } else {
    tft.setTextColor(iconColor);
    tft.setTextSize(iconDescription.length() > 26 ? 1 : 2);
    int iconCharW = (iconDescription.length() > 26) ? 6 : 12;
    int iconX = (320 - (iconDescription.length() * iconCharW)) / 2;
    if (iconX < 15) {
      iconX = 15;
    }
    if (iconShort == "CAR") {
      drawAprsAlertCarIcon(160, 140, iconColor);
    } else if (iconShort == "HOUSE") {
      drawAprsAlertHouseIcon(160, 136);
    } else if (iconShort == "HUMAN") {
      drawAprsAlertHumanIcon(160, 136);
    } else {
      tft.setCursor(iconX, 153);
      tft.print(iconDescription);
    }

