tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
    tft.setTextColor(TFT_CYAN);
    tft.setTextSize(1);
    tft.setCursor(20, 172);
    tft.print("Comment:");
    tft.setTextColor(TFT_LIGHTGREY);
    tft.setTextSize(2);
    drawAprsAlertWrappedComment(station.comment, 20, 184, 280, 2, 2);
  }
}

void APRS_BEACONING_Screen(const String &txCallsign, const String &positionInfo, const String &pathInfo, const String &frameInfo) {
  if (!tftInitialized || brightnessMenuActive) {
    return;
  }

  aprsAlertScreenActive = true;
  activeAlertScreenKind = ALERT_SCREEN_BEACONING;
  aprsAlertScreenUntilMs = millis() + APRS_BEACONING_SCREEN_MS;
  aprsAlertFrameLastToggleMs = millis();
  aprsAlertFramePulseOn = true;

  tft.fillScreen(TFT_BLACK);
  tft.fillRect(0, 0, 320, 40, TFT_RADIO_ORANGE);
  tft.drawFastHLine(0, 39, 320, 0x8410);

  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  const String headerText = "APRS BECONING...";
  int headerX = (320 - ((int)headerText.length() * 12)) / 2;
  if (headerX < 4) {
    headerX = 4;
  }
  tft.setCursor(headerX, 12);
  tft.print(headerText);
  tft.setCursor(headerX + 1, 12);
  tft.print(headerText);
  drawAprsAlertCloseButton();

  drawAprsAlertFrame(aprsAlertFramePulseOn);

  String callsign = txCallsign;
  callsign.toUpperCase();
  if (callsign.length() == 0) {
    callsign = "-";
  }

  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(3);
  int callX = (320 - ((int)callsign.length() * 18)) / 2;
  if (callX < 14) {
    callX = 14;
  }
  tft.setCursor(callX, 62);
  tft.print(callsign);

  tft.setTextColor(TFT_CYAN);
  tft.setTextSize(2);
  int posX = (320 - ((int)positionInfo.length() * 12)) / 2;
  if (posX < 12) {
    posX = 12;
  }
  tft.setCursor(posX, 96);
  tft.print(positionInfo);

  String pathLine = "PATH: " + pathInfo;
  tft.setTextColor(TFT_RADIO_ORANGE);
  tft.setTextSize(2);
  int pathX = (320 - ((int)pathLine.length() * 12)) / 2;
  if (pathX < 12) {
    pathX = 12;
  }
  tft.setCursor(pathX, 122);
  tft.print(pathLine);

  tft.setTextColor(TFT_CYAN);
  tft.setTextSize(1);
  tft.setCursor(20, 148);
  tft.print("Frame:");
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  drawAprsAlertWrappedComment(frameInfo, 20, 160, 280, 6, 1);
}

void WEATHER_ALERT_Screen(const WeatherAlertInfo &info) {
  if (!tftInitialized) {
    return;
  }

  weatherAlertScreenInfo = info;
  aprsAlertScreenActive = true;
  activeAlertScreenKind = ALERT_SCREEN_WEATHER;
  aprsAlertScreenUntilMs = millis() + ((unsigned long)aprsAlertScreenSeconds * 1000UL);
  aprsAlertFrameLastToggleMs = millis();
  aprsAlertFramePulseOn = true;

  tft.fillScreen(TFT_BLACK);
  tft.fillRect(0, 0, 320, 40, TFT_RADIO_ORANGE);
  tft.drawFastHLine(0, 39, 320, 0x8410);

  tft.setTextColor(TFT_BLACK);
  tft.setTextSize(2);
  String headerText = (tftLanguage == TFT_LANG_EN) ? "WEATHER ALERT" : "ALERT POGODOWY";
  int headerX = (320 - ((int)headerText.length() * 12)) / 2;
  if (headerX < 6) {
    headerX = 6;
  }
  tft.setCursor(headerX, 12);
  tft.print(headerText);
  tft.setCursor(headerX + 1, 12);
  tft.print(headerText);
  drawAprsAlertCloseButton();

  drawAprsAlertFrame(aprsAlertFramePulseOn);

  const String iconPath = info.stormPossible ? "/icon50/200.bmp" : "/icon50/wind.bmp";
  drawBmpFromFS(iconPath, 18, 78);

  int line2Y = 104;
  tft.setTextColor(TFT_WHITE);
  tft.setTextSize(3);
  if (info.stormPossible) {
    String stormLine1 = (tftLanguage == TFT_LANG_EN) ? "POSSIBLE" : "MOZLIWA";
    String stormLine2 = (tftLanguage == TFT_LANG_EN) ? "STORM" : "BURZA";

    int stormX1 = (320 - ((int)stormLine1.length() * 18)) / 2;
    int stormX2 = (320 - ((int)stormLine2.length() * 18)) / 2;
    if (stormX1 < 72) {
      stormX1 = 72;
    }
    if (stormX2 < 72) {
      stormX2 = 72;
    }
    tft.setCursor(stormX1, 62);
    tft.print(stormLine1);
    tft.setCursor(stormX2, 90);
    tft.print(stormLine2);
    line2Y = 120;
  } else {
    String mainLine = (tftLanguage == TFT_LANG_EN) ? "STRONG WIND" : "SILNY WIATR";
    int mainX = (320 - ((int)mainLine.length() * 18)) / 2;
    if (mainX < 72) {
      mainX = 72;
    }
    tft.setCursor(mainX, 68);
    tft.print(mainLine);
  }

  String line2;
  if (info.stormPossible) {
    if (info.stormNow) {
      line2 = (tftLanguage == TFT_LANG_EN) ? "STORM NOW" : "BURZA TERAZ";
    } else {
      line2 = (tftLanguage == TFT_LANG_EN)
                ? ("ETA<=" + String(info.stormEtaHours) + " h")
                : ("ETA<= " + String(info.stormEtaHours) + "godz");
    }
  } else {
    line2 = (tftLanguage == TFT_LANG_EN) ? "Forecast <= 6h" : "Prognoza <= 6h";
  }
  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(2);
  int line2X = (320 - ((int)line2.length() * 12)) / 2;
  if (line2X < 72) {
    line2X = 72;
  }
  tft.setCursor(line2X, line2Y);
  tft.print(line2);

  int detailY = info.stormPossible ? 156 : 142;
  tft.setTextSize(2);
  if (info.stormPossible) {
    uint8_t repeatMin = info.stormEtaHours;
    if (repeatMin < 1) repeatMin = 1;
    if (repeatMin > 6) repeatMin = 6;
    String repeatLine = (tftLanguage == TFT_LANG_EN)
                          ? ("Repeat: " + String(repeatMin) + " min")
                          : ("Powtorz: " + String(repeatMin) + " min");
    tft.setTextColor(TFT_CYAN);
    tft.setCursor(74, detailY);
    tft.print(repeatLine);
    detailY += 24;
  }

  if (info.windPossible) {
    String windLabel = (tftLanguage == TFT_LANG_EN) ? "Wind: " : "Wiatr: ";
    String gustLabel = (tftLanguage == TFT_LANG_EN) ? "Gust: " : "MAX: ";
    String windLine = windLabel + String(info.maxWindMs, 1) + " m/s";
    tft.setTextColor(TFT_YELLOW);
    tft.setCursor(74, detailY);
    tft.print(windLine);
    detailY += 22;

    if (info.maxWindGustMs > 0.0f) {
      String gustLine = gustLabel + String(info.maxWindGustMs, 1) + " m/s";
      tft.setCursor(74, detailY);
      tft.print(gustLine);
      detailY += 22;
    }
  }

  tft.setTextColor(TFT_LIGHTGREY);
  tft.setTextSize(1);
  String footer = (tftLanguage == TFT_LANG_EN)
                    ? "Based on OpenWeather forecast"
                    : "Na podstawie prognozy OpenWeather";
  tft.setCursor(20, 220);
  tft.print(footer);
}

