tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
void updateAlertScreenTimeout() {
  if (!aprsAlertScreenActive) {
    return;
  }

  unsigned long nowMs = millis();
  if (nowMs - aprsAlertFrameLastToggleMs >= APRS_ALERT_FRAME_PULSE_MS) {
    aprsAlertFrameLastToggleMs = nowMs;
    aprsAlertFramePulseOn = !aprsAlertFramePulseOn;
    drawAprsAlertFrame(aprsAlertFramePulseOn);
  }

  if ((long)(millis() - aprsAlertScreenUntilMs) < 0) {
    return;
  }

  dismissAprsAlertScreen();
}

// WyciÄ…gnij czÄ™stotliwoĹ›Ä‡ z komentarza APRS (MHz)
bool extractAPRSFrequencyMHz(const String &text, float &outMHz) {
  const int len = text.length();
  for (int i = 0; i < len; i++) {
    char c = text.charAt(i);
    if (isDigit(c) && (i == 0 || !isDigit(text.charAt(i - 1)))) {
      int j = i;
      bool hasDot = false;
      while (j < len) {
        char cj = text.charAt(j);
        if (cj == '.') {
          if (hasDot) break;
          hasDot = true;
          j++;
          continue;
        }
        if (!isDigit(cj)) break;
        j++;
      }
      if (j <= i) continue;

      String numStr = text.substring(i, j);
      float value = numStr.toFloat();
      if (value <= 0.0f) continue;

      int k = j;
      while (k < len && (text.charAt(k) == ' ' || text.charAt(k) == '\t')) {
        k++;
      }
      if (k + 2 < len) {
        char m1 = text.charAt(k);
        char m2 = text.charAt(k + 1);
        char m3 = text.charAt(k + 2);
        if ((m1 == 'M' || m1 == 'm') && (m2 == 'H' || m2 == 'h') && (m3 == 'Z' || m3 == 'z')) {
          outMHz = value;
          return true;
        }
      }

      // Bez jednostki: akceptuj tylko liczby dziesiÄ™tne w paĹ›mie VHF/UHF
      if (hasDot && value >= 30.0f && value <= 1000.0f) {
        outMHz = value;
        return true;
      }
    }
  }
  return false;
}

// Konwersja Maidenhead Locator do wspĂłĹ‚rzÄ™dnych geograficznych
void locatorToLatLon(String locator, double &lat, double &lon) {
  if (locator.length() < 4) {
    lat = 0;
    lon = 0;
    return;
  }
  
  // Pierwsze 2 znaki - kwadrat (field)
  char c1 = toupper(locator.charAt(0));
  char c2 = toupper(locator.charAt(1));
  lon = (c1 - 'A') * 20 - 180;
  lat = (c2 - 'A') * 10 - 90;
  
  // NastÄ™pne 2 znaki - kwadrat (square)
  if (locator.length() >= 4) {
    int n1 = locator.charAt(2) - '0';
    int n2 = locator.charAt(3) - '0';
    lon += n1 * 2;
    lat += n2 * 1;
  }
  
  // Ĺšrodek kwadratu
  lon += 1;
  lat += 0.5;
}

void updateUserLatLonFromLocator() {
  if (userLocator.length() >= 4) {
    locatorToLatLon(userLocator, userLat, userLon);
    userLatLonValid = true;
  } else {
    userLat = 0.0;
    userLon = 0.0;
    userLatLonValid = false;
  }
}

// SprawdĹş czy tekst wspĂłĹ‚rzÄ™dnych ma tylko cyfry i kropkÄ™ (nie obsĹ‚ugujemy formatĂłw skompresowanych)
static bool isAprsNumeric(const String &raw_aprs) {
    if (raw_aprs.length() == 0) {
        return false;
    }
    int dotCount = 0;
    for (size_t i = 0; i < raw_aprs.length(); i++) {
        char c = raw_aprs.charAt(i);
        if (c == '.') {
            dotCount++;
            if (dotCount > 1) {
                return false;
            }
        } else if (!isDigit(c)) {
            return false;
        }
    }
    return true;
}

// Konwersja surowej pozycji APRS na stopnie dziesiÄ™tne
// Konwersja formatu APRS (DDMM.mmN lub DDDMM.mmE) na stopnie dziesiÄ™tne
// Format APRS: DDMM.mm dla szerokoĹ›ci, DDDMM.mm dla dĹ‚ugoĹ›ci
float convertToDecimal(String raw_aprs, char direction) {
    if (raw_aprs.length() < 4) {
        LOGV_PRINTF("[APRS] convertToDecimal: za krĂłtki string: %s\n", raw_aprs.c_str());
        return NAN;
    }
    if (!isAprsNumeric(raw_aprs)) {
        LOGV_PRINTF("[APRS] convertToDecimal: nie-numeryczny format: %s\n", raw_aprs.c_str());
        return NAN;
    }

    double degrees = 0.0;
    double minutes = 0.0;

    if (direction == 'N' || direction == 'S') {
        // SzerokoĹ›Ä‡ (Latitude): pierwsze 2 znaki to stopnie (DDMM.mm)
        // PrzykĹ‚ad: "5202.40" -> degrees=52, minutes=02.40
        if (raw_aprs.length() >= 2) {
            String degStr = raw_aprs.substring(0, 2);
            degrees = degStr.toDouble();
        }
        if (raw_aprs.length() > 2) {
            String minStr = raw_aprs.substring(2);
            minutes = minStr.toDouble();
        }
    } else if (direction == 'E' || direction == 'W') {
        // DĹ‚ugoĹ›Ä‡ (Longitude): pierwsze 3 znaki to stopnie (DDDMM.mm)
        // PrzykĹ‚ad: "01655.12" -> degrees=016, minutes=55.12
        if (raw_aprs.length() >= 3) {
            String degStr = raw_aprs.substring(0, 3);
            degrees = degStr.toDouble();
        }
        if (raw_aprs.length() > 3) {
            String minStr = raw_aprs.substring(3);
            minutes = minStr.toDouble();
        }
    } else {
        LOGV_PRINTF("[APRS] convertToDecimal: nieznany kierunek: %c\n", direction);
        return NAN;
    }

    // Walidacja zakresĂłw
    if (direction == 'N' || direction == 'S') {
        if (degrees < 0 || degrees > 90 || minutes < 0 || minutes >= 60) {
            LOGV_PRINTF("[APRS] convertToDecimal: nieprawidĹ‚owa szerokoĹ›Ä‡: %s%c (deg=%.1f, min=%.2f)\n", 
                       raw_aprs.c_str(), direction, degrees, minutes);
            return NAN;
        }
    } else {
        if (degrees < 0 || degrees > 180 || minutes < 0 || minutes >= 60) {
            LOGV_PRINTF("[APRS] convertToDecimal: nieprawidĹ‚owa dĹ‚ugoĹ›Ä‡: %s%c (deg=%.1f, min=%.2f)\n", 
                       raw_aprs.c_str(), direction, degrees, minutes);
            return NAN;
        }
    }

    double decimal = degrees + (minutes / 60.0);

    // JeĹ›li PoĹ‚udnie (S) lub ZachĂłd (W), wynik musi byÄ‡ ujemny
    if (direction == 'S' || direction == 'W') {
        decimal = -decimal;
    }

    LOGV_PRINTF("[APRS] convertToDecimal: %s%c -> %.6f (deg=%.0f, min=%.2f)\n", 
               raw_aprs.c_str(), direction, decimal, degrees, minutes);

    return (float)decimal;
}

// ===== APRS Mic-E / Compressed / Uncompressed decoding (ported from ESP32APRS_Audio) =====
static bool validSymTableCompressed(char c) {
    return (c == '/' || c == '\\' || (c >= 0x41 && c <= 0x5A) || (c >= 0x61 && c <= 0x6A)); // [\/\\A-Za-j]
}

static bool validSymTableUncompressed(char c) {
    return (c == '/' || c == '\\' || (c >= 0x41 && c <= 0x5A) || (c >= 0x30 && c <= 0x39)); // [\/\\A-Z0-9]
}

static bool parseFixedUnsigned(const char *src, int offset, int digits, unsigned int &out) {
  out = 0;
  for (int i = 0; i < digits; i++) {
    char c = src[offset + i];
    if (c < '0' || c > '9') {
      return false;
    }
    out = out * 10U + (unsigned int)(c - '0');
  }
  return true;
}

static int aprsMicECommentBodyOffset(const unsigned char *body, size_t len) {
  const size_t kMicEFixedLen = 8; // lon(3) + spd/crs(3) + sym(2)
  if (!body || len <= kMicEFixedLen) {
    return (int)kMicEFixedLen;
  }

  size_t idx = kMicEFixedLen;
  unsigned char marker = body[idx];

  // Optional Mic-E telemetry may start with '`', '\'', 0x1C or 0x1D.
  if (marker == 0x60 || marker == 0x27 || marker == 0x1C || marker == 0x1D) {
    size_t probe = idx + 1;
    size_t telemetryLen = 0;
    while (probe < len && telemetryLen < 10) {
      unsigned char c = body[probe];
      if (c < 0x21 || c > 0x7B) {
        break;
      }
      telemetryLen++;
      probe++;
    }

