tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
    // Skip telemetry only when it looks like a valid telemetry block.
    if (telemetryLen >= 2) {
      idx = probe;
    }
  }

  return (int)idx;
}

  static bool aprsLatLonInRange(float lat, float lon) {
    if (isnan(lat) || isnan(lon)) return false;
    if (lat < -90.0f || lat > 90.0f) return false;
    if (lon < -180.0f || lon > 180.0f) return false;
    // APRS parser conventions: 0,0 is treated as invalid/no position.
    if (fabsf(lat) < 0.0001f && fabsf(lon) < 0.0001f) return false;
    return true;
  }

  static String normalizeAprsParsedComment(const String &rawComment) {
    String out;
    out.reserve(rawComment.length());
    for (size_t i = 0; i < rawComment.length(); i++) {
      char c = rawComment.charAt(i);
      if (c == '\r' || c == '\n') {
        out += ' ';
        continue;
      }
      if ((unsigned char)c >= 32 || c == '\t') {
        out += c;
      }
    }
    out.trim();
    return out;
  }

static bool parseAprsUncompressed(const char *body, size_t len, float &lat, float &lon, char &symTable, char &symCode) {
    if (len < 19) {
        return false;
    }
    char posbuf[20];
    memcpy(posbuf, body, 19);
    posbuf[19] = 0;

    // Position ambiguity handling
    if (posbuf[2] == ' ') posbuf[2] = '3';
    if (posbuf[3] == ' ') posbuf[3] = '5';
    if (posbuf[5] == ' ') posbuf[5] = '5';
    if (posbuf[6] == ' ') posbuf[6] = '5';
    if (posbuf[12] == ' ') posbuf[12] = '3';
    if (posbuf[13] == ' ') posbuf[13] = '5';
    if (posbuf[15] == ' ') posbuf[15] = '5';
    if (posbuf[16] == ' ') posbuf[16] = '5';

    if (posbuf[4] != '.' || posbuf[14] != '.') {
      return false;
    }

    unsigned int latDeg = 0, latMin = 0, latMinFrag = 0;
    unsigned int lonDeg = 0, lonMin = 0, lonMinFrag = 0;
    if (!parseFixedUnsigned(posbuf, 0, 2, latDeg) ||
      !parseFixedUnsigned(posbuf, 2, 2, latMin) ||
      !parseFixedUnsigned(posbuf, 5, 2, latMinFrag) ||
      !parseFixedUnsigned(posbuf, 9, 3, lonDeg) ||
      !parseFixedUnsigned(posbuf, 12, 2, lonMin) ||
      !parseFixedUnsigned(posbuf, 15, 2, lonMinFrag)) {
        return false;
    }

    char latHemi = posbuf[7];
    symTable = posbuf[8];
    char lonHemi = posbuf[17];
    symCode = posbuf[18];

    if (!validSymTableUncompressed(symTable)) {
        symTable = 0;
    }

    bool isSouth = (latHemi == 'S' || latHemi == 's');
    bool isWest = (lonHemi == 'W' || lonHemi == 'w');
    if (!isSouth && latHemi != 'N' && latHemi != 'n') return false;
    if (!isWest && lonHemi != 'E' && lonHemi != 'e') return false;
    if (latDeg > 90 || lonDeg > 180) return false;
    if (latMin >= 60 || lonMin >= 60) return false;

    lat = (float)latDeg + (float)latMin / 60.0f + (float)latMinFrag / 6000.0f;
    lon = (float)lonDeg + (float)lonMin / 60.0f + (float)lonMinFrag / 6000.0f;
    if (isSouth) lat = -lat;
    if (isWest) lon = -lon;
    return aprsLatLonInRange(lat, lon);
}

static bool parseAprsCompressed(const char *body, size_t len, float &lat, float &lon, char &symTable, char &symCode) {
    if (len < 13) {
        return false;
    }
    symTable = body[0];
    symCode = body[9];
    if (!validSymTableCompressed(symTable)) return false;
    for (int i = 1; i <= 8; i++) {
        if (body[i] < 0x21 || body[i] > 0x7b) return false;
    }

    int lat1 = (body[1] - 33);
    int lat2 = (body[2] - 33);
    int lat3 = (body[3] - 33);
    int lat4 = (body[4] - 33);
    lat1 = ((((lat1 * 91) + lat2) * 91) + lat3) * 91 + lat4;

    int lon1 = (body[5] - 33);
    int lon2 = (body[6] - 33);
    int lon3 = (body[7] - 33);
    int lon4 = (body[8] - 33);
    lon1 = ((((lon1 * 91) + lon2) * 91) + lon3) * 91 + lon4;

    lat = 90.0f - ((float)(lat1) / 380926.0f);
    lon = -180.0f + ((float)(lon1) / 190463.0f);

    if (symTable >= 'a' && symTable <= 'j') {
        symTable -= 81; // a-j -> 0-9
    }
    return aprsLatLonInRange(lat, lon);
}

static bool parseAprsMicE(const char *dstcall, const unsigned char *body, size_t len,
                          float &lat, float &lon, char &symTable, char &symCode) {
    if (!dstcall || strlen(dstcall) != 6) return false;
    if (len < 8) return false;

    // Validate destination callsign format
    for (int i = 0; i < 3; i++) {
        if (!((dstcall[i] >= '0' && dstcall[i] <= '9') ||
              (dstcall[i] >= 'A' && dstcall[i] <= 'L') ||
              (dstcall[i] >= 'P' && dstcall[i] <= 'Z'))) {
            return false;
        }
    }
    for (int i = 3; i < 6; i++) {
        if (!((dstcall[i] >= '0' && dstcall[i] <= '9') ||
              (dstcall[i] == 'L') ||
              (dstcall[i] >= 'P' && dstcall[i] <= 'Z'))) {
            return false;
        }
    }

    // Validate info field
    if (body[0] < 0x26 || body[0] > 0x7f) return false;
    if (body[1] < 0x26 || body[1] > 0x61) return false;
    if (body[2] < 0x1c || body[2] > 0x7f) return false;
    if (body[3] < 0x1c || body[3] > 0x7f) return false;
    if (body[4] < 0x1c || body[4] > 0x7d) return false;
    if (body[5] < 0x1c || body[5] > 0x7f) return false;
    if ((body[6] < 0x21 || body[6] > 0x7b) && body[6] != 0x7d) return false;
    if (body[7] != '/' && body[7] != '\\') return false;

    char dst[7];
    strncpy(dst, dstcall, 6);
    dst[6] = 0;

    for (char *p = dst; *p; p++) {
        if (*p >= 'A' && *p <= 'J') *p -= 'A' - '0';
        else if (*p >= 'P' && *p <= 'Y') *p -= 'P' - '0';
        else if (*p == 'K' || *p == 'L' || *p == 'Z') *p = '_';
    }

    int posAmbiguity = 0;
    if (dst[5] == '_') { dst[5] = '5'; posAmbiguity = 1; }
    if (dst[4] == '_') { dst[4] = '5'; posAmbiguity = 2; }
    if (dst[3] == '_') { dst[3] = '5'; posAmbiguity = 3; }
    if (dst[2] == '_') { dst[2] = '3'; posAmbiguity = 4; }
    if (dst[1] == '_' || dst[0] == '_') return false;

    unsigned int latDeg = 0, latMin = 0, latMinFrag = 0;
    if (!parseFixedUnsigned(dst, 0, 2, latDeg) ||
      !parseFixedUnsigned(dst, 2, 2, latMin) ||
      !parseFixedUnsigned(dst, 4, 2, latMinFrag)) {
      return false;
    }
    lat = (float)latDeg + (float)latMin / 60.0f + (float)latMinFrag / 6000.0f;
    if (dstcall[3] <= 0x4c) lat = -lat;

    unsigned int lonDeg = body[0] - 28;
    if (dstcall[4] >= 0x50) lonDeg += 100;
    if (lonDeg >= 180 && lonDeg <= 189) lonDeg -= 80;
    else if (lonDeg >= 190 && lonDeg <= 199) lonDeg -= 190;

    unsigned int lonMin = body[1] - 28;
    if (lonMin >= 60) lonMin -= 60;
    unsigned int lonMinFrag = body[2] - 28;

    switch (posAmbiguity) {
        case 0:
            lon = (float)lonDeg + (float)lonMin / 60.0f + (float)lonMinFrag / 6000.0f;
            break;
        case 1:
            lon = (float)lonDeg + (float)lonMin / 60.0f + (float)(lonMinFrag - lonMinFrag % 10 + 5) / 6000.0f;
            break;
        case 2:
            lon = (float)lonDeg + ((float)lonMin + 0.5f) / 60.0f;
            break;
        case 3:
            lon = (float)lonDeg + (float)(lonMin - lonMin % 10 + 5) / 60.0f;
            break;
        case 4:
            lon = (float)lonDeg + 0.5f;
            break;
        default:
            return false;
    }

    if (dstcall[5] >= 0x50) lon = -lon;

