tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
    symCode = body[6];
    symTable = body[7];
    return aprsLatLonInRange(lat, lon);
}

static bool parseAprsAdvancedPosition(const String &line, APRSStation &station) {
    int gtPos = line.indexOf('>');
    if (gtPos < 0) return false;
    int colonPos = line.indexOf(':', gtPos + 1);
    if (colonPos < 0) return false;

    String dstPath = line.substring(gtPos + 1, colonPos);
    int commaPos = dstPath.indexOf(',');
    String dstcall = (commaPos >= 0) ? dstPath.substring(0, commaPos) : dstPath;
    dstcall.trim();
    if (dstcall.length() == 0) return false;

    String payload = line.substring(colonPos + 1);
    if (payload.length() == 0) return false;

    char packettype = payload.charAt(0);
    const char *body = payload.c_str() + 1;
    size_t bodyLen = payload.length() > 0 ? (size_t)(payload.length() - 1) : 0;

    float lat = 0.0f, lon = 0.0f;
    char symTable = 0, symCode = 0;
    bool ok = false;
    int commentOffset = -1; // offset in payload
    String objectOrItemName = "";

    if (packettype == '`' || packettype == '\'') {
        ok = parseAprsMicE(dstcall.c_str(), (const unsigned char *)body, bodyLen, lat, lon, symTable, symCode);
      if (ok) commentOffset = 1 + aprsMicECommentBodyOffset((const unsigned char *)body, bodyLen);
    } else if (packettype == '!' || packettype == '=' || packettype == '/' || packettype == '@') {
        size_t offset = 1;
        if ((packettype == '/' || packettype == '@') && bodyLen >= 7) {
            body += 7;
            bodyLen -= 7;
            offset += 7;
        }
        if (bodyLen > 0) {
            char poschar = body[0];
            if (validSymTableCompressed(poschar)) {
                ok = parseAprsCompressed(body, bodyLen, lat, lon, symTable, symCode);
                if (ok) commentOffset = (int)(offset + 13);
            } else if (poschar >= '0' && poschar <= '9') {
                ok = parseAprsUncompressed(body, bodyLen, lat, lon, symTable, symCode);
                if (ok) commentOffset = (int)(offset + 19);
            }
        }
    } else if (packettype == ';') {
      // Object: name + (* or _) + timestamp(7) + position
      int nameEnd = -1;
      for (int i = 0; i < (int)bodyLen && i < 15; i++) {
        if (body[i] == '*' || body[i] == '_') {
          nameEnd = i;
          break;
        }
      }
      if (nameEnd >= 0) {
        objectOrItemName = payload.substring(1, 1 + nameEnd);
        objectOrItemName.trim();
      }
      if (nameEnd >= 0 && (nameEnd + 8) < (int)bodyLen) {
        const char *posBody = body + nameEnd + 8;
        size_t posLen = bodyLen - (nameEnd + 8);
            char poschar = posBody[0];
            if (validSymTableCompressed(poschar)) {
                ok = parseAprsCompressed(posBody, posLen, lat, lon, symTable, symCode);
          if (ok) commentOffset = 1 + nameEnd + 8 + 13;
            } else if (poschar >= '0' && poschar <= '9') {
                ok = parseAprsUncompressed(posBody, posLen, lat, lon, symTable, symCode);
          if (ok) commentOffset = 1 + nameEnd + 8 + 19;
            }
        }
    } else if (packettype == ')') {
        // Item: name ends with ! or _
        int nameEnd = -1;
        for (int i = 0; i < 9 && i < (int)bodyLen; i++) {
            if (body[i] == '!' || body[i] == '_') {
                nameEnd = i;
                break;
            }
        }
        if (nameEnd >= 0 && (nameEnd + 1) < (int)bodyLen) {
        objectOrItemName = payload.substring(1, 1 + nameEnd);
        objectOrItemName.trim();
            const char *posBody = body + nameEnd + 1;
            size_t posLen = bodyLen - (nameEnd + 1);
            char poschar = posBody[0];
            if (validSymTableCompressed(poschar)) {
                ok = parseAprsCompressed(posBody, posLen, lat, lon, symTable, symCode);
                if (ok) commentOffset = 1 + nameEnd + 1 + 13;
            } else if (poschar >= '0' && poschar <= '9') {
                ok = parseAprsUncompressed(posBody, posLen, lat, lon, symTable, symCode);
                if (ok) commentOffset = 1 + nameEnd + 1 + 19;
            }
        }
    }

    if (!ok) {
        return false;
    }

    station.lat = lat;
    station.lon = lon;
    station.hasLatLon = aprsLatLonInRange(lat, lon);
    if (!station.hasLatLon) {
      return false;
    }
    if (symCode != 0) {
        station.symbol = String(symCode);
    }
    if (symTable != 0) {
        station.symbolTable = String(symTable);
    }

    if (objectOrItemName.length() > 0) {
      // Dla raportów Object/Item użyj nazwy obiektu jako identyfikatora stacji.
      station.callsign = objectOrItemName;
    }

    if (commentOffset > 0 && commentOffset < payload.length()) {
      station.comment = normalizeAprsParsedComment(payload.substring(commentOffset));
    }
    return true;
}

// Obliczanie odlegĹ‚oĹ›ci metodÄ… Haversine (km)
// UĹĽywa double dla wiÄ™kszej precyzji obliczeĹ„
// UĹĽywa promienia Ziemi 6366.71 km (jak w ESP32APRS_Audio) dla zgodnoĹ›ci z aprs.fi
float calculateDistance(double lat1, double lon1, double lat2, double lon2) {
    const double r = 6366.71; // PromieĹ„ Ziemi w km (uĹĽywany przez ESP32APRS_Audio i aprs.fi)
    const double dLat = (lat2 - lat1) * M_PI / 180.0;
    const double dLon = (lon2 - lon1) * M_PI / 180.0;

    const double a = sin(dLat/2.0) * sin(dLat/2.0) +
                     cos(lat1 * M_PI / 180.0) * cos(lat2 * M_PI / 180.0) *
                     sin(dLon/2.0) * sin(dLon/2.0);
    const double c = 2.0 * atan2(sqrt(a), sqrt(1.0 - a));
    
    return (float)(r * c); // Wynik w km
}

// Oblicz azymut początkowy (0..360), gdzie 0 = Północ
float calculateBearing(double lat1, double lon1, double lat2, double lon2) {
    const double phi1 = lat1 * M_PI / 180.0;
    const double phi2 = lat2 * M_PI / 180.0;
    const double dLon = (lon2 - lon1) * M_PI / 180.0;

    const double y = sin(dLon) * cos(phi2);
    const double x = cos(phi1) * sin(phi2) - sin(phi1) * cos(phi2) * cos(dLon);
    double bearingDeg = atan2(y, x) * 180.0 / M_PI;
    if (bearingDeg < 0.0) {
      bearingDeg += 360.0;
    }
    return (float)bearingDeg;
}

String formatDistanceOrCountry(const DXSpot &spot, size_t maxLen) {
  if (spot.country.length() > 0) {
    String c = spot.country;
    c.trim();
    if (c.length() > maxLen) {
      c = c.substring(0, maxLen);
    }
    return c;
  }
  return "-";
}

// OkreĹ›lanie pasma na podstawie czÄ™stotliwoĹ›ci (kHz) wg bandplanu
String getBand(float freq) {
  // Normalize to kHz so both kHz (DX cluster) and MHz (POTA API) inputs map correctly
  float freqKHz = freq;
  if (freqKHz > 0.0f && freqKHz < 1000.0f) {
    freqKHz *= 1000.0f;
  }

  if (freqKHz >= 1810 && freqKHz <= 2000) return "160m";
  if (freqKHz >= 3500 && freqKHz <= 3800) return "80m";
  if (freqKHz >= 7000 && freqKHz <= 7200) return "40m";
  if (freqKHz >= 10100 && freqKHz <= 10150) return "30m";
  if (freqKHz >= 14000 && freqKHz <= 14350) return "20m";
  if (freqKHz >= 18068 && freqKHz <= 18168) return "17m";
  if (freqKHz >= 21000 && freqKHz <= 21450) return "15m";
  if (freqKHz >= 24890 && freqKHz <= 24990) return "12m";
  if (freqKHz >= 28000 && freqKHz <= 29700) return "10m";
  return "Other";
}

// OkreĹ›lanie modulacji na podstawie komentarza
String getMode(String comment) {
  comment.toUpperCase();
  if (comment.indexOf("CW") >= 0) return "CW";
  if (comment.indexOf("FT4") >= 0) return "FT4";
  if (comment.indexOf("FT8") >= 0) return "FT8";
  if (comment.indexOf("SSB") >= 0 || comment.indexOf("USB") >= 0 || comment.indexOf("LSB") >= 0) return "SSB";
  return "SSB"; // DomyĹ›lnie SSB
}

String extractXmlTagValue(const String &xml, const String &tag) {
  String openTag = "<" + tag + ">";
  String closeTag = "</" + tag + ">";
  int start = xml.indexOf(openTag);
  if (start < 0) return "";
  start += openTag.length();
  int end = xml.indexOf(closeTag, start);
  if (end < 0) return "";
  return xml.substring(start, end);
}

bool ensureQrzSession(String &sessionKey) {
  static String cachedKey = "";
  static unsigned long cachedAt = 0;
  const unsigned long SESSION_TTL_MS = 30UL * 60UL * 1000UL; // 30 minut

  if (qrzUsername.length() == 0 || qrzPassword.length() == 0) {
    qrzStatus = "QRZ: no credentials";
    return false;
  }

  unsigned long now = millis();
  if (cachedKey.length() > 0 && (now - cachedAt) < SESSION_TTL_MS) {
    sessionKey = cachedKey;
    qrzStatus = "QRZ: session ok";
    return true;
  }

  String url = "https://xmldata.qrz.com/xml/current/?username=" + qrzUsername +
               ";password=" + qrzPassword;
  HTTPClient http;
  http.setTimeout(3000);
  http.begin(url);
  int code = http.GET();
  if (code != 200) {
    http.end();
    qrzStatus = "QRZ: login http " + String(code);
    return false;
  }
  String body = http.getString();
  http.end();

  String err = extractXmlTagValue(body, "Error");
  if (err.length() == 0) {
    err = extractXmlTagValue(body, "error");
  }

  String key = extractXmlTagValue(body, "Key");
  if (key.length() == 0) {
    key = extractXmlTagValue(body, "key");
  }
  if (key.length() == 0) {
    if (err.length() > 0) {
      qrzStatus = "QRZ: login " + err;
      Serial.print("[QRZ] Login error: ");
      Serial.println(err);
    } else {
      qrzStatus = "QRZ: login failed";
    }
    return false;
  }

  cachedKey = key;
  cachedAt = now;
  sessionKey = key;
  qrzStatus = "QRZ: login ok";
  Serial.println("[QRZ] Session OK");
  return true;
}

bool fetchQrzCallsignInfo(const String &callsign, String &outGrid, String &outCountry,
                          double &outLat, double &outLon, bool &outHasLatLon) {
  if (!wifiConnected || WiFi.status() != WL_CONNECTED) {
    qrzStatus = "QRZ: no wifi";
    return false;
  }

  outGrid = "";
  outCountry = "";
  outLat = 0.0;
  outLon = 0.0;
  outHasLatLon = false;

  String call = callsign;
  call.toUpperCase();
  unsigned long now = millis();
  for (int i = 0; i < QRZ_CACHE_SIZE; i++) {
    if (qrzCache[i].callsign == call && (now - qrzCache[i].fetchedAtMs) < QRZ_CACHE_TTL_MS) {
      outGrid = qrzCache[i].grid;
      outCountry = qrzCache[i].country;
      outLat = qrzCache[i].lat;
      outLon = qrzCache[i].lon;
      outHasLatLon = qrzCache[i].hasLatLon;
      return (outGrid.length() > 0 || outCountry.length() > 0);
    }
  }

  String sessionKey;
  if (!ensureQrzSession(sessionKey)) {
    return false;
  }

  String url = "https://xmldata.qrz.com/xml/current/?s=" + sessionKey +
               ";callsign=" + callsign;
  HTTPClient http;
  http.setTimeout(3000);
  http.begin(url);
  int code = http.GET();
  if (code != 200) {
    http.end();
    qrzStatus = "QRZ: lookup http " + String(code);
    return false;
  }
  String body = http.getString();
  http.end();

