tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  // ObsĹ‚uga bĹ‚Ä™du sesji - sprĂłbuj raz odĹ›wieĹĽyÄ‡
  if (body.indexOf("Session Timeout") >= 0 || body.indexOf("Invalid session") >= 0) {
    String dummy;
    ensureQrzSession(dummy);
    qrzStatus = "QRZ: session expired";
    return false;
  }

  String grid = extractXmlTagValue(body, "grid");
  String country = extractXmlTagValue(body, "country");
  String latStr = extractXmlTagValue(body, "lat");
  String lonStr = extractXmlTagValue(body, "lon");
  grid.trim();
  country.trim();
  if (country.length() == 0) {
    country = extractXmlTagValue(body, "dxcc");
    country.trim();
  }

  outGrid = grid;
  outCountry = country;
  latStr.trim();
  lonStr.trim();
  outHasLatLon = (latStr.length() > 0 && lonStr.length() > 0);
  if (outHasLatLon) {
    outLat = latStr.toDouble();
    outLon = lonStr.toDouble();
  } else {
    outLat = 0.0;
    outLon = 0.0;
  }
  qrzStatus = "QRZ: lookup ok";

  // Zapisz do cache (nadpisz najstarszy)
  int oldestIdx = 0;
  unsigned long oldestMs = qrzCache[0].fetchedAtMs;
  for (int i = 1; i < QRZ_CACHE_SIZE; i++) {
    if (qrzCache[i].fetchedAtMs < oldestMs) {
      oldestMs = qrzCache[i].fetchedAtMs;
      oldestIdx = i;
    }
  }
  qrzCache[oldestIdx].callsign = call;
  qrzCache[oldestIdx].grid = grid;
  qrzCache[oldestIdx].country = country;
  qrzCache[oldestIdx].lat = (float)outLat;
  qrzCache[oldestIdx].lon = (float)outLon;
  qrzCache[oldestIdx].hasLatLon = outHasLatLon;
  qrzCache[oldestIdx].fetchedAtMs = now;

  return (grid.length() > 0 || country.length() > 0);
}

bool getQrzCacheFresh(const String &callsign, String &outGrid, String &outCountry,
                     double &outLat, double &outLon, bool &outHasLatLon,
                     unsigned long ttlMs) {
  outGrid = "";
  outCountry = "";
  outLat = 0.0;
  outLon = 0.0;
  outHasLatLon = false;

  String call = callsign;
  call.toUpperCase();
  unsigned long now = millis();
  for (int i = 0; i < QRZ_CACHE_SIZE; i++) {
    if (qrzCache[i].callsign == call && (now - qrzCache[i].fetchedAtMs) < ttlMs) {
      outGrid = qrzCache[i].grid;
      outCountry = qrzCache[i].country;
      outLat = qrzCache[i].lat;
      outLon = qrzCache[i].lon;
      outHasLatLon = qrzCache[i].hasLatLon;
      return (outGrid.length() > 0 || outCountry.length() > 0);
    }
  }
  return false;
}

void applyQrzCacheToSpot(DXSpot &spot, unsigned long ttlMs) {
  if (spot.callsign.length() == 0) {
    return;
  }

  String grid;
  String country;
  double lat = 0.0;
  double lon = 0.0;
  bool hasLatLon = false;
  if (!getQrzCacheFresh(spot.callsign, grid, country, lat, lon, hasLatLon, ttlMs)) {
    return;
  }

  if (spot.country.length() == 0 && country.length() > 0) {
    spot.country = country;
  }
  if (spot.locator.length() < 4 && grid.length() >= 4) {
    spot.locator = grid;
  }
  if (!spot.hasLatLon && hasLatLon) {
    spot.lat = (float)lat;
    spot.lon = (float)lon;
    spot.hasLatLon = true;
  }
}

void logQrzAllFields(const String &callsign, const String &xml) {
  int csStart = xml.indexOf("<Callsign>");
  int csEnd = xml.indexOf("</Callsign>");
  if (csStart < 0 || csEnd < 0 || csEnd <= csStart) {
    Serial.print("[QRZ][DATA] ");
    Serial.print(callsign);
    Serial.println(" - brak CallSign w XML");
    return;
  }
  String section = xml.substring(csStart + 10, csEnd);

  Serial.print("[QRZ][DATA] ");
  Serial.println(callsign);

  int pos = 0;
  while (pos < section.length()) {
    int openTagStart = section.indexOf('<', pos);
    if (openTagStart < 0) break;
    int openTagEnd = section.indexOf('>', openTagStart + 1);
    if (openTagEnd < 0) break;

    String tag = section.substring(openTagStart + 1, openTagEnd);
    tag.trim();
    if (tag.length() == 0 || tag.indexOf('/') == 0) {
      pos = openTagEnd + 1;
      continue;
    }
    int closeTagStart = section.indexOf("</" + tag + ">", openTagEnd + 1);
    if (closeTagStart < 0) {
      pos = openTagEnd + 1;
      continue;
    }
    String value = section.substring(openTagEnd + 1, closeTagStart);
    value.trim();
    if (value.length() > 0) {
      Serial.print("  ");
      Serial.print(tag);
      Serial.print(": ");
      Serial.println(value);
    }
    pos = closeTagStart + tag.length() + 3;
  }
}

void logSpotList() {
  Serial.println("[SPOTS] Lista spotow (max 8)");
  int count = min(spotCount, 8);
  for (int i = 0; i < count; i++) {
    String call = spots[i].callsign.length() ? spots[i].callsign : "-";
    String timeStr = spots[i].time.length() ? spots[i].time : "----Z";
    float mhz = spots[i].frequency / 1000.0f;
    Serial.print(" ");
    Serial.print(i + 1);
    Serial.print(") ");
    Serial.print(call);
    Serial.print(" ");
    Serial.print(timeStr);
    Serial.print(" ");
    Serial.print(mhz, 3);
    Serial.println(" MHz");

    double lat = 0.0;
    double lon = 0.0;
    bool hasLatLon = spots[i].hasLatLon;
    if (hasLatLon) {
      lat = spots[i].lat;
      lon = spots[i].lon;
    } else if (spots[i].locator.length() >= 4) {
      locatorToLatLon(spots[i].locator, lat, lon);
      hasLatLon = true;
    }

    if (hasLatLon) {
      Serial.print("    lat=");
      Serial.print(lat, 4);
      Serial.print(" lon=");
      Serial.println(lon, 4);
    } else {
      Serial.println("    lat=-- lon=--");
    }

    if (spots[i].distance > 0) {
      Serial.print("    dist=");
      Serial.print(spots[i].distance, 0);
      Serial.println(" km");
    } else {
      Serial.println("    dist=-- km");
    }
  }
}

bool isQrzQueued(const String &callsign) {
  String normalized = callsign;
  normalized.trim();
  normalized.toUpperCase();
  for (int i = 0; i < qrzQueueLen; i++) {
    String queuedCall = qrzQueue[i].callsign;
    queuedCall.toUpperCase();
    if (queuedCall == normalized) {
      return true;
    }
  }
  return false;
}

void enqueueQrzLookup(const String &callsign) {
  String normalized = callsign;
  normalized.trim();
  normalized.toUpperCase();
  if (normalized.length() == 0) {
    return;
  }
  if (qrzQueueLen >= QRZ_QUEUE_SIZE) {
    return;
  }
  if (isQrzQueued(normalized)) {
    return;
  }

  // Nie dodawaj do kolejki, jeżeli mamy już świeży wpis w cache.
  String grid;
  String country;
  double lat = 0.0;
  double lon = 0.0;
  bool hasLatLon = false;
  if (getQrzCacheFresh(normalized, grid, country, lat, lon, hasLatLon, QRZ_CACHE_TTL_MS)) {
    return;
  }

  PendingQrzLookup item;
  item.callsign = normalized;
  item.nextTryMs = millis();
  item.attempts = 0;
  qrzQueue[qrzQueueLen++] = item;
}

