tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
// Pobierz spoty POTA z publicznego API i uzupełnij bufor + kolejkę QRZ
bool fetchPotaApi() {
  if (!wifiConnected) return false;
  auto decodeToSpots = [&](JsonDocument &doc) -> bool {
    JsonArray arr;
    if (doc.is<JsonArray>()) {
      arr = doc.as<JsonArray>();
    } else if (doc["spots"].is<JsonArray>()) {
      arr = doc["spots"].as<JsonArray>();
    }
    if (arr.isNull() || arr.size() == 0) {
      return false;
    }

    lockPotaSpots();
    potaSpotCount = 0;
    for (JsonObject spot : arr) {
      if (potaSpotCount >= MAX_POTA_SPOTS) break;
      DXSpot s;
      s.time = spot["activatorLastSpotTime"] | spot["spotTime"] | "";
      s.callsign = spot["activator"] | spot["call"] | spot["callsign"] | "";
      float freq = 0.0f;
      if (spot["frequency"].is<float>() || spot["frequency"].is<double>()) {
        freq = spot["frequency"].as<float>();
      } else if (spot["frequency"].is<int>() || spot["frequency"].is<long>()) {
        freq = (float)spot["frequency"].as<long>();
      } else if (spot["frequency"].is<const char*>() || spot["frequency"].is<String>()) {
        String fstr = spot["frequency"].as<String>();
        freq = fstr.toFloat();
      }
      if (freq > 0) {
        s.frequency = freq / 1000.0f;
      } else {
        s.frequency = 0.0f;
      }
      s.band = getBand(s.frequency);
      s.mode = spot["mode"] | "";
      s.mode.toUpperCase();
      if (s.mode.length() == 0) {
        s.mode = getMode(spot["comments"] | "");
      }
      s.country = spot["country"] | "";
      s.spotter = spot["spotter"] | "";
      s.comment = spot["comments"] | "";
      s.distance = 0;
      s.hasLatLon = false;
      applyQrzCacheToSpot(s, QRZ_CACHE_TTL_MS);
      compactDxSpotStrings(s);
      potaSpots[potaSpotCount++] = s;
      if (s.country.length() == 0 && s.callsign.length() > 0) {
        enqueueQrzLookup(s.callsign);
      }
    }
    bool hasPotaSpots = potaSpotCount > 0;
    unlockPotaSpots();
    return hasPotaSpots;
  };

  HTTPClient http;
  http.setTimeout(8000);
  if (!http.begin(potaApiUrl)) {
    Serial.println("[POTA] http.begin failed");
    return false;
  }
  int code = http.GET();
  if (code != HTTP_CODE_OK) {
    Serial.print("[POTA] HTTP GET failed: ");
    Serial.println(code);
    http.end();
    return false;
  }
  int contentLength = http.getSize();
  Serial.print("[POTA] HTTP ");
  Serial.print(code);
  Serial.print(", content-length=");
  Serial.print(contentLength);
  Serial.println(" (may be -1 if chunked)");

  WiFiClient *stream = http.getStreamPtr();
  DynamicJsonDocument filter(512);
  JsonObject filterRootArray = filter[0].to<JsonObject>();
  filterRootArray["activatorLastSpotTime"] = true;
  filterRootArray["spotTime"] = true;
  filterRootArray["activator"] = true;
  filterRootArray["call"] = true;
  filterRootArray["callsign"] = true;
  filterRootArray["frequency"] = true;
  filterRootArray["mode"] = true;
  filterRootArray["country"] = true;
  filterRootArray["spotter"] = true;
  filterRootArray["comments"] = true;

  DynamicJsonDocument doc(60000);
  DeserializationError err = deserializeJson(doc, *stream, DeserializationOption::Filter(filter));
  http.end();
  bool parsedOk = (!err && decodeToSpots(doc));
  if (!parsedOk) {
    if (err) {
      Serial.print("[POTA] Filtered JSON parse error: ");
      Serial.println(err.c_str());
    }
    Serial.println("[POTA] Filtered parse empty - retrying without filter");

    HTTPClient retry;
    retry.setTimeout(8000);
    if (!retry.begin(potaApiUrl)) {
      return false;
    }
    int retryCode = retry.GET();
    if (retryCode != HTTP_CODE_OK) {
      retry.end();
      return false;
    }
    WiFiClient *retryStream = retry.getStreamPtr();
    DynamicJsonDocument fullDoc(120000);
    DeserializationError retryErr = deserializeJson(fullDoc, *retryStream);
    retry.end();
    if (retryErr) {
      Serial.print("[POTA] Fallback JSON parse error: ");
      Serial.println(retryErr.c_str());
      return false;
    }
    if (!decodeToSpots(fullDoc)) {
      Serial.println("[POTA] Fallback parse also returned 0 spots");
      return false;
    }
  }

  // Posortuj malejąco po czasie (ISO string porównuje się leksykograficznie poprawnie)
  lockPotaSpots();
  for (int i = 0; i < potaSpotCount - 1; i++) {
    for (int j = i + 1; j < potaSpotCount; j++) {
      if (potaSpots[j].time > potaSpots[i].time) {
        DXSpot tmp = potaSpots[i];
        potaSpots[i] = potaSpots[j];
        potaSpots[j] = tmp;
      }
    }
  }
  bool hasPotaSpots = potaSpotCount > 0;
  unlockPotaSpots();

  return hasPotaSpots;
}

void removeQrzQueueAt(int idx) {
  if (idx < 0 || idx >= qrzQueueLen) {
    return;
  }
  for (int i = idx; i < qrzQueueLen - 1; i++) {
    qrzQueue[i] = qrzQueue[i + 1];
  }
  qrzQueueLen--;
}

void updateSpotsWithQrz(const String &callsign, const String &grid,
                        const String &country, double lat, double lon, bool hasLatLon) {
  bool updated = false;
  bool updatedPota = false;
  if (!userLatLonValid && userLocator.length() >= 4) {
    double tmpLat = 0.0;
    double tmpLon = 0.0;
    locatorToLatLon(userLocator, tmpLat, tmpLon);
    userLat = tmpLat;
    userLon = tmpLon;
    userLatLonValid = true;
  }
  lockDxSpots();
  for (int i = 0; i < spotCount; i++) {
    if (!spots[i].callsign.equalsIgnoreCase(callsign)) {
      continue;
    }

    if (grid.length() >= 4) {
      spots[i].locator = grid;
    }
    if (country.length() > 0) {
      spots[i].country = country;
    }

    double spotLat = 0.0;
    double spotLon = 0.0;
    bool spotHasLatLon = false;
    if (hasLatLon) {
      spotLat = lat;
      spotLon = lon;
      spotHasLatLon = true;
      spots[i].lat = (float)lat;
      spots[i].lon = (float)lon;
      spots[i].hasLatLon = true;
    } else if (spots[i].locator.length() >= 4) {
      locatorToLatLon(spots[i].locator, spotLat, spotLon);
      spotHasLatLon = true;
      spots[i].lat = (float)spotLat;
      spots[i].lon = (float)spotLon;
      spots[i].hasLatLon = true;
    }

    double userLatLocal = 0.0;
    double userLonLocal = 0.0;
    bool userHasLatLon = getServiceCoordinatesForServices(userLatLocal, userLonLocal);

    if (userHasLatLon && spotHasLatLon) {
      spots[i].distance = calculateDistance(userLatLocal, userLonLocal, spotLat, spotLon);
      updated = true;
    }
  }
  unlockDxSpots();

  lockPotaSpots();
  for (int i = 0; i < potaSpotCount; i++) {
    if (!potaSpots[i].callsign.equalsIgnoreCase(callsign)) {
      continue;
    }

    if (grid.length() >= 4) {
      potaSpots[i].locator = grid;
    }
    if (country.length() > 0) {
      potaSpots[i].country = country;
    }

