tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
    double spotLat = 0.0;
    double spotLon = 0.0;
    bool spotHasLatLon = false;
    if (hasLatLon) {
      spotLat = lat;
      spotLon = lon;
      spotHasLatLon = true;
      potaSpots[i].lat = (float)lat;
      potaSpots[i].lon = (float)lon;
      potaSpots[i].hasLatLon = true;
    } else if (potaSpots[i].locator.length() >= 4) {
      locatorToLatLon(potaSpots[i].locator, spotLat, spotLon);
      spotHasLatLon = true;
      potaSpots[i].lat = (float)spotLat;
      potaSpots[i].lon = (float)spotLon;
      potaSpots[i].hasLatLon = true;
    }

    double userLatLocal = 0.0;
    double userLonLocal = 0.0;
    bool userHasLatLon = getServiceCoordinatesForServices(userLatLocal, userLonLocal);

    if (userHasLatLon && spotHasLatLon) {
      potaSpots[i].distance = calculateDistance(userLatLocal, userLonLocal, spotLat, spotLon);
      updatedPota = true;
    }
  }
  unlockPotaSpots();

  if (updated) {
#ifdef ENABLE_TFT_DISPLAY
    updateScreen2();
#endif
  }
  if (updatedPota) {
#ifdef ENABLE_TFT_DISPLAY
    updateScreen7();
#endif
  }
}

bool fetchQrzRawXml(const String &callsign, String &body) {
  if (!wifiConnected || WiFi.status() != WL_CONNECTED) {
    qrzStatus = "QRZ: no wifi";
    return false;
  }
  String sessionKey;
  if (!ensureQrzSession(sessionKey)) {
    return false;
  }

  String url = "https://xmldata.qrz.com/xml/current/?s=" + sessionKey +
               ";callsign=" + callsign;
  HTTPClient http;
  http.setTimeout(3000);
  http.begin(url);
  int code = http.GET();
  if (code != 200) {
    http.end();
    qrzStatus = "QRZ: lookup http " + String(code);
    return false;
  }
  body = http.getString();
  http.end();

  if (body.indexOf("Session Timeout") >= 0 || body.indexOf("Invalid session") >= 0) {
    String dummy;
    ensureQrzSession(dummy);
    qrzStatus = "QRZ: session expired";
    return false;
  }
  return true;
}

void runQrzSingleTest(const String &callsign) {
  (void)callsign;
}

// Parsowanie spotu DX z formatu "DX de [Spotter]: [Freq] [Call] [Comments] [Time]"
bool parseDXSpot(String line, DXSpot &spot) {
  LOGV_PRINT("[PARSE] parseDXSpot START, len=");
  LOGV_PRINTLN(line.length());
  
  // Format: DX de SP5XYZ: 14025.0 SP9ABC Test comment 1234Z
  if (!line.startsWith("DX de")) {
    LOGV_PRINTLN("[PARSE] Nie zaczyna siÄ™ od 'DX de' - wyjĹ›cie");
    return false;
  }
  
  int dePos = line.indexOf("DX de");
  if (dePos < 0) return false;
  
  int colonPos = line.indexOf(":", dePos);
  if (colonPos < 0) return false;
  
  // WyciÄ…gnij spottera
  String spotterPart = line.substring(dePos + 5, colonPos);
  spotterPart.trim();
  spot.spotter = spotterPart;
  
  // Reszta po dwukropku
  String rest = line.substring(colonPos + 1);
  rest.trim();
  
  // Parsuj czÄ™stotliwoĹ›Ä‡ (pierwsza liczba)
  int spacePos = rest.indexOf(" ");
  if (spacePos < 0) return false;
  
  String freqStr = rest.substring(0, spacePos);
  spot.frequency = freqStr.toFloat();
  rest = rest.substring(spacePos + 1);
  rest.trim();
  
  // Parsuj znak wywoĹ‚awczy (nastÄ™pne sĹ‚owo)
  spacePos = rest.indexOf(" ");
  if (spacePos < 0) {
    spot.callsign = rest;
    spot.comment = "";
  } else {
    spot.callsign = rest.substring(0, spacePos);
    rest = rest.substring(spacePos + 1);
    rest.trim();
    
    // Reszta to komentarz (moĹĽe zawieraÄ‡ czas na koĹ„cu)
    // Czas jest zwykle na koĹ„cu w formacie HHMMZ
    int timePos = rest.lastIndexOf("Z");
    if (timePos > 0 && rest.length() >= timePos + 1) {
      String timeStr = rest.substring(timePos - 4, timePos + 1);
      if (timeStr.length() == 5) {
        spot.time = timeStr;
        spot.comment = rest.substring(0, timePos - 4);
        spot.comment.trim();
      } else {
        spot.comment = rest;
        // Pobierz czas z NTP
        struct tm timeinfo;
        if (getLocalTime(&timeinfo)) {
          char timeBuffer[6];
          strftime(timeBuffer, 6, "%H%MZ", &timeinfo);
          spot.time = String(timeBuffer);
        } else {
          spot.time = "----Z";
        }
      }
    } else {
      spot.comment = rest;
      // Pobierz czas z NTP (z timeout - nie blokuj jeĹ›li NTP nie dziaĹ‚a)
      struct tm timeinfo;
      if (getLocalTime(&timeinfo, 1)) { // Timeout 1 sekunda
        char timeBuffer[6];
        strftime(timeBuffer, 6, "%H%MZ", &timeinfo);
        spot.time = String(timeBuffer);
      } else {
        spot.time = "----Z";
      }
    }
  }
  
  // OkreĹ›l pasmo i modulacjÄ™
  spot.band = getBand(spot.frequency);
  spot.mode = getMode(spot.comment);
  
  // SprĂłbuj wyciÄ…gnÄ…Ä‡ locator z komentarza (format JO82LK)
  spot.locator = "";
  int commentLen = spot.comment.length();
  if (commentLen >= 6) { // Locator ma minimum 6 znakĂłw
    for (int i = 0; i <= commentLen - 6; i++) {
      String sub = spot.comment.substring(i, i + 6);
      if (sub.length() == 6 && 
          isAlpha(sub.charAt(0)) && isAlpha(sub.charAt(1)) &&
          isDigit(sub.charAt(2)) && isDigit(sub.charAt(3)) &&
          isAlpha(sub.charAt(4)) && isAlpha(sub.charAt(5))) {
        spot.locator = sub;
        break;
      }
    }
  }
  
  LOGV_PRINTLN("[PARSE] Obliczanie odlegĹ‚oĹ›ci...");
  
  spot.distance = 0;
  spot.country = "";
  spot.lat = 0.0f;
  spot.lon = 0.0f;
  spot.hasLatLon = false;
  bool qrzConfigured = (qrzUsername.length() > 0 && qrzPassword.length() > 0);
  // Najpierw licz z lokatora jeĹ›li mamy lokalizacjÄ™ i lokator w spocie
  double userLatLocal = 0.0;
  double userLonLocal = 0.0;
  if (getServiceCoordinatesForServices(userLatLocal, userLonLocal) && spot.locator.length() >= 4) {
    double spotLat, spotLon;
    locatorToLatLon(spot.locator, spotLat, spotLon);
    spot.distance = calculateDistance(userLatLocal, userLonLocal, spotLat, spotLon);
    spot.lat = (float)spotLat;
    spot.lon = (float)spotLon;
    spot.hasLatLon = true;
  }

  if (qrzConfigured) {
    applyQrzCacheToSpot(spot, QRZ_CACHE_TTL_MS);
  }

  if (qrzConfigured && spot.callsign.length() > 0 && (spot.country.length() == 0 || !spot.hasLatLon)) {
    String call = spot.callsign;
    call.toUpperCase();
    enqueueQrzLookup(call);
  }

  compactDxSpotStrings(spot);
  
  LOGV_PRINTLN("[PARSE] parseDXSpot END - OK");
  return true;
}

