tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
// Prostsze parsowanie spotu dla POTA (bez QRZ i bez obliczeĹ„ dystansu)
bool parsePotaSpot(String line, DXSpot &spot) {
  if (!line.startsWith("DX de")) {
    return false;
  }

  int dePos = line.indexOf("DX de");
  if (dePos < 0) return false;

  int colonPos = line.indexOf(":", dePos);
  if (colonPos < 0) return false;

  String spotterPart = line.substring(dePos + 5, colonPos);
  spotterPart.trim();
  spot.spotter = spotterPart;

  String rest = line.substring(colonPos + 1);
  rest.trim();

  int spacePos = rest.indexOf(" ");
  if (spacePos < 0) return false;

  String freqStr = rest.substring(0, spacePos);
  spot.frequency = freqStr.toFloat();
  rest = rest.substring(spacePos + 1);
  rest.trim();

  spacePos = rest.indexOf(" ");
  if (spacePos < 0) {
    spot.callsign = rest;
    spot.comment = "";
  } else {
    spot.callsign = rest.substring(0, spacePos);
    rest = rest.substring(spacePos + 1);
    rest.trim();

    int timePos = rest.lastIndexOf("Z");
    if (timePos > 0 && rest.length() >= timePos + 1) {
      String timeStr = rest.substring(timePos - 4, timePos + 1);
      if (timeStr.length() == 5) {
        spot.time = timeStr;
        spot.comment = rest.substring(0, timePos - 4);
        spot.comment.trim();
      } else {
        spot.comment = rest;
        struct tm timeinfo;
        if (getLocalTime(&timeinfo)) {
          char timeBuffer[6];
          strftime(timeBuffer, 6, "%H%MZ", &timeinfo);
          spot.time = String(timeBuffer);
        } else {
          spot.time = "----Z";
        }
      }
    } else {
      spot.comment = rest;
      struct tm timeinfo;
      if (getLocalTime(&timeinfo, 1)) {
        char timeBuffer[6];
        strftime(timeBuffer, 6, "%H%MZ", &timeinfo);
        spot.time = String(timeBuffer);
      } else {
        spot.time = "----Z";
      }
    }
  }

  spot.band = getBand(spot.frequency);
  spot.mode = getMode(spot.comment);
  spot.locator = "";
  spot.distance = 0;
  spot.country = "";
  spot.lat = 0.0f;
  spot.lon = 0.0f;
  spot.hasLatLon = false;
  compactDxSpotStrings(spot);

  return true;
}

// Dodaj nowy spot do tablicy
void addSpot(DXSpot spot) {
  compactDxSpotStrings(spot);
  lockDxSpots();
  LOGV_PRINT("[SPOT] addSpot: ");
  LOGV_PRINT(spot.callsign);
  LOGV_PRINT(" @ ");
  LOGV_PRINT(spot.frequency);
  LOGV_PRINT(" kHz, spotCount=");
  LOGV_PRINTLN(spotCount);
  
  // PrzesuĹ„ istniejÄ…ce spoty
  if (spotCount < MAX_SPOTS) {
    spotCount++;
  }
  
  // PrzesuĹ„ wszystkie spoty o jeden w dĂłĹ‚
  for (int i = MAX_SPOTS - 1; i > 0; i--) {
    spots[i] = spots[i - 1];
  }
  
  // Dodaj nowy spot na poczÄ…tku
  spots[0] = spot;
  
  LOGV_PRINT("[SPOT] addSpot END, nowy spotCount=");
  LOGV_PRINTLN(spotCount);
  unlockDxSpots();
  // logSpotList(); // WyĹ‚Ä…czone - nie wypisuj listy spotĂłw do Serial
}

void addPotaSpot(DXSpot spot) {
  compactDxSpotStrings(spot);
  lockPotaSpots();
  if (potaSpotCount < MAX_POTA_SPOTS) {
    potaSpotCount++;
  }

  for (int i = MAX_POTA_SPOTS - 1; i > 0; i--) {
    potaSpots[i] = potaSpots[i - 1];
  }

  potaSpots[0] = spot;
  unlockPotaSpots();
}

void addHamalertSpot(DXSpot spot) {
  compactDxSpotStrings(spot);
  lockHamalertSpots();
  if (hamalertSpotCount < MAX_POTA_SPOTS) {
    hamalertSpotCount++;
  }

  for (int i = MAX_POTA_SPOTS - 1; i > 0; i--) {
    hamalertSpots[i] = hamalertSpots[i - 1];
  }

  hamalertSpots[0] = spot;
  unlockHamalertSpots();
}

bool parseHamalertJsonSpot(const String &line, DXSpot &spot) {
  DynamicJsonDocument doc(3072);
  DeserializationError err = deserializeJson(doc, line);
  if (err) {
    return false;
  }

  JsonVariant root = doc.as<JsonVariant>();
  String callsign = root["dx"] | root["call"] | root["callsign"] | "";
  if (callsign.length() == 0) {
    return false;
  }

  spot.callsign = callsign;
  spot.spotter = root["de"] | root["spotter"] | root["source"] | "";
  spot.comment = root["comment"] | root["info"] | root["message"] | "";
  spot.mode = root["mode"] | "";
  if (spot.mode.length() == 0) {
    spot.mode = getMode(spot.comment);
  }
  spot.mode.toUpperCase();
  spot.country = root["country"] | root["entity"] | "";

  float freq = 0.0f;
  if (root["frequency"].is<float>() || root["frequency"].is<double>()) {
    freq = (float)root["frequency"].as<double>();
  } else if (root["frequency"].is<int>() || root["frequency"].is<long>()) {
    freq = (float)root["frequency"].as<long>();
  } else if (root["freq"].is<float>() || root["freq"].is<double>()) {
    freq = (float)root["freq"].as<double>();
  } else if (root["freq"].is<int>() || root["freq"].is<long>()) {
    freq = (float)root["freq"].as<long>();
  } else if (root["frequency"].is<const char*>()) {
    freq = String(root["frequency"].as<const char*>()).toFloat();
  } else if (root["freq"].is<const char*>()) {
    freq = String(root["freq"].as<const char*>()).toFloat();
  }
  if (freq <= 0.0f) {
    return false;
  }
  // HAMALERT i DX cluster zwykle podają kHz, ale obsłuż także MHz.
  spot.frequency = (freq > 1000.0f) ? (freq / 1000.0f) : freq;
  spot.band = getBand(spot.frequency * 1000.0f);

  String timeStr = root["time"] | root["spotTime"] | root["timestamp"] | "";
  if (timeStr.length() == 0) {
    struct tm timeinfo;
    if (getLocalTime(&timeinfo, 1)) {
      char timeBuffer[6];
      strftime(timeBuffer, 6, "%H%MZ", &timeinfo);
      timeStr = String(timeBuffer);
    } else {
      timeStr = "----Z";
    }
  }
  spot.time = timeStr;
  spot.distance = 0;
  spot.locator = "";
  spot.lat = 0.0f;
  spot.lon = 0.0f;
  spot.hasLatLon = false;
  compactDxSpotStrings(spot);
  return true;
}

bool parseHamalertSpotLine(const String &lineIn, DXSpot &spot) {
  String line = lineIn;
  line.trim();
  if (line.length() < 6) {
    return false;
  }
  if (line == ">" || line == "#" || line.startsWith("Welcome") || line.startsWith("Password")) {
    return false;
  }
  if (line.charAt(0) == '{' && parseHamalertJsonSpot(line, spot)) {
    return true;
  }

  DXSpot parsed;
  if (!parsePotaSpot(line, parsed)) {
    return false;
  }
  parsed.frequency = (parsed.frequency > 1000.0f) ? (parsed.frequency / 1000.0f) : parsed.frequency;
  parsed.band = getBand(parsed.frequency * 1000.0f);
  parsed.mode.toUpperCase();
  compactDxSpotStrings(parsed);
  spot = parsed;
  return true;
}

bool fetchHamalertTelnet() {
  const size_t HAMALERT_MAX_LINE_LEN = 1400;
  Serial.println("[HAMALERT] fetch start");
  if (!wifiConnected) {
    Serial.println("[HAMALERT] skip: WiFi offline");
    return false;
  }
  if (hamalertHost.length() == 0 || hamalertPort <= 0 || hamalertLogin.length() == 0 || hamalertPassword.length() == 0) {
    Serial.println("[HAMALERT] skip: missing host/port/login/password");
    return false;
  }

  String login = hamalertLogin;
  login.trim();
  if (login.length() == 0) {
    Serial.println("[HAMALERT] skip: hamalert_login is empty");
    return false;
  }

  Serial.print("[HAMALERT] connect ");
  Serial.print(hamalertHost);
  Serial.print(":");
  Serial.println(hamalertPort);

