tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  WiFiClient client;
  client.setTimeout(1200);
  if (!client.connect(hamalertHost.c_str(), hamalertPort)) {
    Serial.println("[HAMALERT] connect failed");
    return false;
  }
  Serial.println("[HAMALERT] connected");

  lockHamalertSpots();
  hamalertSpotCount = 0;
  unlockHamalertSpots();
  String line;
  line.reserve(HAMALERT_MAX_LINE_LEN + 16);

  // Odczytaj ewentualny banner/prompt przed logowaniem
  unsigned long preLoginUntil = millis() + 1200;
  while (millis() < preLoginUntil && client.connected()) {
    while (client.available()) {
      char c = (char)client.read();
      if (c == '\r') continue;
      if (c == '\n') {
        if (line.length() > 0) {
          Serial.print("[HAMALERT] < ");
          Serial.println(line);
        }
        line = "";
      } else if (line.length() < HAMALERT_MAX_LINE_LEN) {
        line += c;
      }
    }
    delay(2);
    yield();
  }
  if (line.length() > 0) {
    Serial.print("[HAMALERT] < ");
    Serial.println(line);
    line = "";
  }

  // HamAlert telnet wymaga username + password
  Serial.print("[HAMALERT] > username: ");
  Serial.println(login);
  client.print(login);
  client.print("\n");

  delay(180);
  Serial.print("[HAMALERT] > password: (");
  Serial.print(hamalertPassword.length());
  Serial.println(" chars)");
  client.print(hamalertPassword);
  client.print("\n");

  delay(220);
  Serial.println("[HAMALERT] > set/json");
  client.print("set/json\n");

  delay(160);
  Serial.println("[HAMALERT] > sh/dx 30");
  client.print("sh/dx 30\n");

  const unsigned long started = millis();
  unsigned long lastRx = millis();
  const unsigned long totalTimeoutMs = 9000;
  const unsigned long idleTimeoutMs = 1800;
  int parsedOkCount = 0;
  int parsedFailCount = 0;
  int diagLineCount = 0;

  while (client.connected() && (millis() - started) < totalTimeoutMs) {
    while (client.available()) {
      char c = (char)client.read();
      lastRx = millis();
      if (c == '\r') {
        continue;
      }
      if (c == '\n') {
        if (line.length() > 0) {
          DXSpot s;
          if (parseHamalertSpotLine(line, s)) {
            addHamalertSpot(s);
            parsedOkCount++;
            if (hamalertSpotCount >= MAX_POTA_SPOTS) {
              break;
            }
          } else {
            parsedFailCount++;
            String lowerLine = line;
            lowerLine.toLowerCase();
            if (lowerLine.indexOf("invalid") >= 0 || lowerLine.indexOf("error") >= 0 || lowerLine.indexOf("denied") >= 0 ||
                lowerLine.indexOf("login") >= 0 || lowerLine.indexOf("password") >= 0 || lowerLine.indexOf("failed") >= 0) {
              Serial.print("[HAMALERT] server: ");
              Serial.println(line);
            } else if (diagLineCount < 8) {
              Serial.print("[HAMALERT] line(unparsed): ");
              Serial.println(line);
              diagLineCount++;
            }
          }
        }
        line = "";
      } else if (line.length() < HAMALERT_MAX_LINE_LEN) {
        line += c;
      }
    }
    if ((millis() - lastRx) > idleTimeoutMs && hamalertSpotCount > 0) {
      break;
    }
    if (hamalertSpotCount >= MAX_POTA_SPOTS) {
      break;
    }
    yield();
    delay(2);
  }

  if (line.length() > 0 && hamalertSpotCount < MAX_POTA_SPOTS) {
    DXSpot s;
    if (parseHamalertSpotLine(line, s)) {
      addHamalertSpot(s);
      parsedOkCount++;
    } else {
      parsedFailCount++;
    }
  }

  client.stop();
  Serial.print("[HAMALERT] done: spots=");
  Serial.print(hamalertSpotCount);
  Serial.print(", parsed_ok=");
  Serial.print(parsedOkCount);
  Serial.print(", parsed_fail=");
  Serial.println(parsedFailCount);
  return hamalertSpotCount > 0;
}

// ========== APRS-IS FUNKCJE ==========

// Połącz z serwerem APRS-IS
void connectToAPRS() {
  Serial.println("[APRS] connectToAPRS() START");
  
  if (!wifiConnected) {
    Serial.println("[APRS] WiFi nie połączony - wyjście");
    return;
  }
  
  if (aprsClient.connected()) {
    // Jeśli konfiguracja się zmieniła, rozłącz i połącz ponownie
    Serial.println("[APRS] Już połączony - sprawdzam czy potrzeba reconnect...");
    // Można dodać sprawdzenie czy konfiguracja się zmieniła, ale na razie zostawiamy jak jest
    // W razie potrzeby reconnect nastąpi automatycznie przez watchdog
    return;
  }
  
  unsigned long now = millis();
  if (now - lastAPRSAttempt < 5000) {
    return; // Cichy return - nie spamuj logu
  }
  
  lastAPRSAttempt = now;
  
  Serial.print("[APRS] Łączenie z APRS-IS: ");
  Serial.print(aprsIsHost);
  Serial.print(":");
  Serial.println(aprsIsPort);
  
  // Diagnostyka DNS
  IPAddress resolvedIp;
  if (WiFi.hostByName(aprsIsHost.c_str(), resolvedIp)) {
    Serial.print("DNS OK: ");
    Serial.print(aprsIsHost);
    Serial.print(" -> ");
    Serial.println(resolvedIp);
  } else {
    Serial.print("DNS FAIL dla hosta: ");
    Serial.println(aprsIsHost);
  }
  
  Serial.println("[APRS] Wywołanie aprsClient.connect()...");
  unsigned long connectStart = millis();
  
  // Ustaw timeout połączenia (300 sekund jak w wymaganiach)
  aprsClient.setTimeout(300);
  
  if (aprsClient.connect(aprsIsHost.c_str(), aprsIsPort)) {
    unsigned long connectTime = millis() - connectStart;
    Serial.print("[APRS] Połączono z APRS-IS! (czas: ");
    Serial.print(connectTime);
    Serial.println("ms)");
    aprsConnected = true;
    aprsBuffer = "";
    aprsLoginSent = false;
    lastAPRSRxMs = millis();
    
    // Zaplanuj wysłanie loginu
    delay(500); // Krótkie opóźnienie przed loginem
    sendAPRSLogin();
  } else {
    unsigned long connectTime = millis() - connectStart;
    Serial.print("[APRS] Błąd połączenia z APRS-IS (czas: ");
    Serial.print(connectTime);
    Serial.println("ms)");
    aprsConnected = false;
  }
  Serial.println("[APRS] connectToAPRS() END");
}

// Wyślij login do APRS-IS
void sendAPRSLogin() {
  if (!aprsConnected || !aprsClient.connected()) {
    Serial.println("[APRS] Nie mozna wysłać loginu - brak połączenia");
    return;
  }
  
  // Format loginu: user Callsign pass 23123 vers ESP32-HAM-CLOCK 1.2
  String login = "user ";
  login += getAprsTxCallsignWithSsid();
  login += " pass ";
  login += String(aprsPasscode);
  login += " vers ESP32-HAM-CLOCK 1.2";
  
  Serial.print("[APRS] Wysyłanie loginu: ");
  Serial.println(login);
  
  aprsClient.println(login);
  aprsLoginSent = true;
  lastAPRSRxMs = millis();
  
  // Po zalogowaniu wyślij filtr
  delay(500);
  sendAPRSFilter();
}

