tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
// Wyślij komendę filtra do APRS-IS
void sendAPRSFilter() {
  if (!aprsConnected || !aprsClient.connected()) {
    Serial.println("[APRS] Nie można wysłać filtra - brak połączenia");
    return;
  }
  
  // Format filtra: #filter r/52.40/16.92/50
  // Używamy współrzędnych z sekcji "Moja Stacja"
  double filterLat = 52.40;  // Fallback jeśli nie ustawione
  double filterLon = 16.92;
  getServiceCoordinatesForServices(filterLat, filterLon);
  unsigned long nowMs = millis();
  bool gpsBased = useGpsIfActive && gpsLocationValid && isGpsFixActive(nowMs);
  String filter = "#filter r/";
  filter += String(filterLat, 2);
  filter += "/";
  filter += String(filterLon, 2);
  filter += "/";
  filter += String(aprsFilterRadius);
  
  Serial.print("[APRS] Wysyłanie filtra: ");
  Serial.println(filter);
  
  aprsClient.println(filter);
  lastAPRSRxMs = millis();
  aprsFilterLastSentMs = nowMs;
  aprsFilterLastLat = filterLat;
  aprsFilterLastLon = filterLon;
  aprsFilterLastValid = true;
  aprsFilterLastGpsBased = gpsBased;
}

static void refreshAprsFilterIfNeeded(unsigned long nowMs) {
  if (!aprsConnected || !aprsClient.connected() || !aprsLoginSent) {
    return;
  }

  if (aprsFilterLastSentMs != 0 && (nowMs - aprsFilterLastSentMs) < APRS_FILTER_REFRESH_MIN_INTERVAL_MS) {
    return;
  }

  double currentLat = 0.0;
  double currentLon = 0.0;
  if (!getServiceCoordinatesForServices(currentLat, currentLon)) {
    return;
  }

  bool gpsBasedNow = useGpsIfActive && gpsLocationValid && isGpsFixActive(nowMs);
  if (!aprsFilterLastValid || gpsBasedNow != aprsFilterLastGpsBased) {
    sendAPRSFilter();
    return;
  }

  float movedKm = calculateDistance(aprsFilterLastLat, aprsFilterLastLon, currentLat, currentLon);
  if (movedKm >= APRS_FILTER_REFRESH_MOVE_KM) {
    sendAPRSFilter();
  }
}

String formatAprsCoordinate(double value, bool isLat) {
  double absVal = fabs(value);
  int degrees = (int)absVal;
  double minutes = (absVal - degrees) * 60.0;
  String degText;
  if (isLat) {
    degText = (degrees < 10 ? "0" : "") + String(degrees);
  } else {
    if (degrees < 10) degText = "00" + String(degrees);
    else if (degrees < 100) degText = "0" + String(degrees);
    else degText = String(degrees);
  }

  String minText = String(minutes, 2);
  if (minutes < 10.0) {
    minText = "0" + minText;
  }

  char hemi = isLat ? ((value >= 0.0) ? 'N' : 'S') : ((value >= 0.0) ? 'E' : 'W');
  return degText + minText + String(hemi);
}

static bool isValidAprsSymbolChar(char c) {
  return (c >= 33 && c <= 126); // widoczne ASCII bez spacji/kontrolnych
}

static String sanitizeAprsSymbol(const String &sym) {
  String s = sym;
  s.trim();
  if (s.length() < 2) {
    return String(DEFAULT_APRS_SYMBOL_TABLE) + String(DEFAULT_APRS_SYMBOL_CODE);
  }
  s = s.substring(0, 2);
  if (!isValidAprsSymbolChar(s.charAt(0)) || !isValidAprsSymbolChar(s.charAt(1))) {
    return String(DEFAULT_APRS_SYMBOL_TABLE) + String(DEFAULT_APRS_SYMBOL_CODE);
  }
  return s;
}

static void applyAprsSymbol(const String &sym) {
  String s = sanitizeAprsSymbol(sym);
  aprsSymbolTwoChar = s;
  aprsSymbolTable = s.charAt(0);
  aprsSymbolCode = s.charAt(1);
}

static int normalizeAprsSsid(int ssid) {
  if (ssid < 0) return 0;
  if (ssid > 15) return 15;
  return ssid;
}

static void applyAprsSsid(int ssid) {
  aprsSsid = normalizeAprsSsid(ssid);
}

static String getAprsBaseCallsign() {
  String call = aprsCallsign.length() ? aprsCallsign : userCallsign;
  call.trim();
  call.toUpperCase();
  int dash = call.indexOf('-');
  if (dash > 0) {
    call = call.substring(0, dash);
  }
  return call;
}

static String getAprsTxCallsignWithSsid() {
  String baseCall = getAprsBaseCallsign();
  if (aprsSsid <= 0) {
    return baseCall;
  }
  return baseCall + "-" + String(aprsSsid);
}

static String sanitizeAprsComment(const String &cmt) {
  String s = cmt;
  s.trim();
  String out = "";
  for (size_t i = 0; i < s.length(); i++) {
    char c = s.charAt(i);
    if (c >= 32 && c <= 126) { // drukowalne ASCII
      out += c;
    }
    if (out.length() >= 43) { // rekomendowany limit komentarza APRS
      break;
    }
  }
  return out;
}

static String sanitizeAprsAlertWatchToken(const String &raw) {
  String token = raw;
  token.trim();
  token.toUpperCase();

  bool wildcardAnySsid = false;
  if (token.endsWith("*")) {
    wildcardAnySsid = true;
    token.remove(token.length() - 1);
  }

  String cleaned = "";
  for (size_t i = 0; i < token.length(); i++) {
    char ch = token.charAt(i);
    bool ok = (ch >= 'A' && ch <= 'Z') || (ch >= '0' && ch <= '9') || ch == '-' || ch == '/';
    if (ok) cleaned += ch;
  }

  if (cleaned.length() == 0) {
    return "";
  }
  if (wildcardAnySsid) {
    cleaned += "*";
  }
  return cleaned;
}

static String sanitizeAprsAlertList(const String &raw) {
  String src = raw;
  src.trim();
  if (src.length() == 0) return "";

  String out = "";
  int count = 0;
  int start = 0;

  while (start <= src.length() && count < 20) {
    int comma = src.indexOf(',', start);
    int end = (comma >= 0) ? comma : src.length();
    String token = src.substring(start, end);
    String cleaned = sanitizeAprsAlertWatchToken(token);

    if (cleaned.length() > 0) {
      if (count > 0) out += ",";
      out += cleaned;
      count++;
    }

    if (comma < 0) break;
    start = comma + 1;
  }

  return out;
}

static int normalizeAprsAlertMinSeconds(int seconds) {
  if (seconds < 0) return 0;
  if (seconds > 86400) return 86400;
  return seconds;
}

static void applyAprsAlertMinSeconds(int seconds) {
  aprsAlertMinSeconds = normalizeAprsAlertMinSeconds(seconds);
}

static float normalizeAprsAlertDistanceKm(float km) {
  if (km < 0.1f) return 0.1f;
  if (km > 500.0f) return 500.0f;
  return km;
}

static void applyAprsAlertDistanceKm(float km) {
  aprsAlertDistanceKm = normalizeAprsAlertDistanceKm(km);
}

static int normalizeAprsAlertScreenSeconds(int seconds) {
  if (seconds < 1) return 1;
  if (seconds > 60) return 60;
  return seconds;
}

static void applyAprsAlertScreenSeconds(int seconds) {
  aprsAlertScreenSeconds = normalizeAprsAlertScreenSeconds(seconds);
}

