tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
static String sanitizeAprsCallsignToken(const String &raw) {
  String token = raw;
  token.trim();
  token.toUpperCase();

  String cleaned = "";
  for (size_t i = 0; i < token.length(); i++) {
    char ch = token.charAt(i);
    bool ok = (ch >= 'A' && ch <= 'Z') || (ch >= '0' && ch <= '9') || ch == '-' || ch == '/';
    if (ok) cleaned += ch;
  }
  return cleaned;
}

static String getAprsCallsignBase(const String &callsign) {
  String normalized = sanitizeAprsCallsignToken(callsign);
  int dash = normalized.indexOf('-');
  if (dash > 0) {
    normalized = normalized.substring(0, dash);
  }
  return normalized;
}

static bool isAprsAlertCallMatch(const String &watchedToken, const String &incomingCallsign) {
  if (watchedToken.length() == 0 || incomingCallsign.length() == 0) {
    return false;
  }

  String watched = sanitizeAprsAlertWatchToken(watchedToken);
  String incoming = sanitizeAprsCallsignToken(incomingCallsign);
  if (watched.length() == 0 || incoming.length() == 0) {
    return false;
  }

  if (watched.endsWith("*")) {
    String base = watched.substring(0, watched.length() - 1);
    if (base.length() == 0) {
      return false;
    }
    if (incoming.equals(base)) {
      return true;
    }
    String withSsidPrefix = base + "-";
    return incoming.startsWith(withSsidPrefix);
  }

  return watched.equals(incoming);
}

static bool isAprsCallsignOnAlertList(const String &incomingCallsign) {
  String src = aprsAlertCsv;
  src.trim();
  if (src.length() == 0) return false;

  int start = 0;
  while (start <= src.length()) {
    int comma = src.indexOf(',', start);
    int end = (comma >= 0) ? comma : src.length();
    String token = src.substring(start, end);
    token.trim();

    if (isAprsAlertCallMatch(token, incomingCallsign)) {
      return true;
    }

    if (comma < 0) break;
    start = comma + 1;
  }

  return false;
}

static bool isAprsMobileSsid7or9(const String &incomingCallsign) {
  String normalized = sanitizeAprsCallsignToken(incomingCallsign);
  if (normalized.length() == 0) {
    return false;
  }

  int dash = normalized.lastIndexOf('-');
  if (dash <= 0 || dash >= (normalized.length() - 1)) {
    return false;
  }

  String ssid = normalized.substring(dash + 1);
  return ssid.equals("7") || ssid.equals("9");
}

static void resetAprsAlertCooldownState() {
  for (int i = 0; i < MAX_APRS_STATIONS; i++) {
    aprsAlertCooldown[i].callsign = "";
    aprsAlertCooldown[i].lastAlertMs = 0;
  }
  aprsAlertCooldownReplaceIdx = 0;
}

static bool shouldTriggerAprsAlert(const APRSStation &station) {
  bool watchListMatched = isAprsCallsignOnAlertList(station.callsign);

  bool nearbyMobileMatched = false;
  if (aprsAlertNearbyEnabled && station.hasLatLon && station.distance >= 0.0f && station.distance <= aprsAlertDistanceKm) {
    nearbyMobileMatched = isAprsMobileSsid7or9(station.callsign);
  }

  bool weatherStationMatched = aprsAlertWxEnabled && isAprsWxPayloadValidForAlert(station);

  if (!watchListMatched && !nearbyMobileMatched && !weatherStationMatched) {
    return false;
  }

  String normalized = sanitizeAprsCallsignToken(station.callsign);
  if (normalized.length() == 0) {
    return false;
  }

  const unsigned long minGapMs = (unsigned long)aprsAlertMinSeconds * 1000UL;
  const unsigned long nowMs = millis();

  for (int i = 0; i < MAX_APRS_STATIONS; i++) {
    if (aprsAlertCooldown[i].callsign.equals(normalized)) {
      if (minGapMs > 0 && (nowMs - aprsAlertCooldown[i].lastAlertMs) < minGapMs) {
        return false;
      }
      aprsAlertCooldown[i].lastAlertMs = nowMs;
      return true;
    }
  }

  for (int i = 0; i < MAX_APRS_STATIONS; i++) {
    if (aprsAlertCooldown[i].callsign.length() == 0) {
      aprsAlertCooldown[i].callsign = normalized;
      aprsAlertCooldown[i].lastAlertMs = nowMs;
      return true;
    }
  }

  int replaceIdx = aprsAlertCooldownReplaceIdx;
  if (replaceIdx < 0 || replaceIdx >= MAX_APRS_STATIONS) {
    replaceIdx = 0;
  }
  aprsAlertCooldown[replaceIdx].callsign = normalized;
  aprsAlertCooldown[replaceIdx].lastAlertMs = nowMs;
  aprsAlertCooldownReplaceIdx = (replaceIdx + 1) % MAX_APRS_STATIONS;
  return true;
}

static uint8_t weatherStormRepeatMinutesFromEta(int etaMinutes) {
  if (etaMinutes <= 0) {
    return 1;
  }
  int hours = etaMinutes / 60;
  if ((etaMinutes % 60) != 0) {
    hours++;
  }
  if (hours < 1) {
    hours = 1;
  }
  if (hours > 6) {
    hours = 6;
  }
  return (uint8_t)hours;
}

static void queueWeatherAlertDraw(const WeatherAlertInfo &info) {
  portENTER_CRITICAL(&weatherAlertPendingMux);
  weatherAlertPendingInfo = info;
  weatherAlertDrawPending = true;
  portEXIT_CRITICAL(&weatherAlertPendingMux);
}

static void updateWeatherAlertForecastState(bool stormPossible,
                                            int stormEtaMinutes,
                                            bool windPossible,
                                            float maxWindMs,
                                            float maxWindGustMs) {
  bool stormChanged = (weatherStormForecastActive != stormPossible);
  bool windChanged = (weatherWindForecastActive != windPossible);

  weatherStormForecastActive = stormPossible;
  weatherWindForecastActive = windPossible;
  weatherAlertForecastUpdatedMs = millis();

  if (stormPossible) {
    if (stormEtaMinutes < 1) {
      stormEtaMinutes = 1;
    }
    if (stormEtaMinutes > 360) {
      stormEtaMinutes = 360;
    }
    weatherStormEtaMinutes = stormEtaMinutes;
    if (stormChanged) {
      nextWeatherStormAlertMs = 0;
    }
  } else {
    weatherStormEtaMinutes = 0;
    nextWeatherStormAlertMs = 0;
  }

  weatherWindForecastMaxMs = maxWindMs;
  weatherWindForecastGustMs = maxWindGustMs;
  if (!windPossible) {
    nextWeatherWindAlertMs = 0;
  } else if (windChanged) {
    nextWeatherWindAlertMs = 0;
  }
}

static void processWeatherAlertSchedule() {
  const bool stormTestMode = WEATHER_ALERT_STORM_TEST_MODE;
  const bool windForceMode = WEATHER_ALERT_WIND_FORCE_ENABLED;

  if (!(weatherAlertStormEnabled || stormTestMode) && !(weatherAlertWindEnabled || windForceMode)) {
    return;
  }
  if (!tftInitialized || brightnessMenuActive || currentScreen == SCREEN_UNLIS_HUNTER || aprsAlertScreenActive) {
    return;
  }

