tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  unsigned long nowMs = millis();
  WeatherAlertInfo info;
  bool shouldNotify = false;

  bool stormNowDetected = false;
  if (weatherAlertStormEnabled && !stormTestMode) {
    int currentWeatherId = 800;
    bool currentWeatherValid = false;
    unsigned long currentWeatherFetchedAtMs = 0;

    lockWeatherData();
    currentWeatherId = weatherData.weatherId;
    currentWeatherValid = weatherData.valid;
    currentWeatherFetchedAtMs = weatherData.fetchedAtMs;
    unlockWeatherData();

    if (currentWeatherValid && currentWeatherId >= 200 && currentWeatherId < 300) {
      if (currentWeatherFetchedAtMs > 0 && (nowMs - currentWeatherFetchedAtMs) <= WEATHER_ALERT_CURRENT_DATA_MAX_AGE_MS) {
        stormNowDetected = true;
      }
    }
  }

  if ((weatherAlertStormEnabled && (weatherStormForecastActive || stormNowDetected)) || stormTestMode) {
    int elapsedMinutes = 0;
    if (weatherAlertForecastUpdatedMs > 0 && nowMs > weatherAlertForecastUpdatedMs) {
      elapsedMinutes = (int)((nowMs - weatherAlertForecastUpdatedMs) / 60000UL);
    }
    int etaMinutesNow = weatherStormEtaMinutes - elapsedMinutes;
    if (etaMinutesNow < 1) {
      etaMinutesNow = 1;
    }

    uint8_t repeatMinutes = (stormTestMode || stormNowDetected) ? 1 : weatherStormRepeatMinutesFromEta(etaMinutesNow);
    if (nextWeatherStormAlertMs == 0 || (long)(nowMs - nextWeatherStormAlertMs) >= 0) {
      info.stormPossible = true;
      info.stormNow = stormNowDetected;
      info.stormEtaHours = repeatMinutes;
      shouldNotify = true;
      nextWeatherStormAlertMs = nowMs + ((unsigned long)repeatMinutes * 60UL * 1000UL);
    }
  }

  if ((weatherAlertWindEnabled || windForceMode) && (weatherWindForecastActive || windForceMode)) {
    if (nextWeatherWindAlertMs == 0 || (long)(nowMs - nextWeatherWindAlertMs) >= 0) {
      float currentWindMs = 0.0f;
      lockWeatherData();
      currentWindMs = weatherData.windMs;
      unlockWeatherData();

      info.windPossible = true;
      info.maxWindMs = weatherWindForecastMaxMs;
      info.maxWindGustMs = weatherWindForecastGustMs;
      if (currentWindMs > info.maxWindMs) {
        info.maxWindMs = currentWindMs;
      }
      if (windForceMode && info.maxWindMs <= 0.0f) {
        info.maxWindMs = weatherAlertWindThresholdMs;
      }
      shouldNotify = true;
      nextWeatherWindAlertMs = nowMs + WEATHER_ALERT_WIND_REPEAT_MS;
    }
  }

  if (shouldNotify) {
    queueWeatherAlertDraw(info);
  }
}

static void applyAprsIntervalMinutes(int minutes) {
  int m = minutes;
  if (m < 1) m = 1;
  if (m > 180) m = 180; // sanity bound 1..180 min
  aprsIntervalMinutes = m;
  aprsPositionIntervalMs = (unsigned long)m * 60UL * 1000UL;
  nextAPRSPositionDueMs = 0; // przelicz harmonogram od nowa
}

bool isAprsTxCallValid(const String &call) {
  String c = call;
  c.trim();
  c.toUpperCase();
  if (c.length() == 0) return false;
  int dash = c.indexOf('-');
  if (dash > 0) {
    c = c.substring(0, dash);
  }
  return c.length() > 0 && c != "NOCALL";
}

void sendAprsPosition() {
  if (!aprsBeaconEnabled || !aprsConnected || !aprsClient.connected() || !aprsLoginSent) {
    return;
  }
  double txLat = 0.0;
  double txLon = 0.0;
  if (!getServiceCoordinatesForServices(txLat, txLon)) {
    Serial.println("[APRS] Pomijam TX pozycji - brak poprawnych współrzędnych stacji");
    return;
  }

  String txCallsign = getAprsTxCallsignWithSsid();
  txCallsign.trim();
  if (!isAprsTxCallValid(txCallsign)) {
    Serial.println("[APRS] Pomijam TX pozycji - ustaw znak w konfiguracji APRS");
    return;
  }
  txCallsign.toUpperCase();

  String latStr = formatAprsCoordinate(txLat, true);
  String lonStr = formatAprsCoordinate(txLon, false);

  String frame = txCallsign;
  frame += ">APRS,TCPIP*:";
  frame += "!";
  frame += latStr;
  frame += aprsSymbolTable;
  frame += lonStr;
  frame += aprsSymbolCode;
  frame += " ";
  bool useProjectComment = (((aprsBeaconTxCount + 1) % 5) == 0); // co piąty beacon
  String comment = useProjectComment ? String(APRS_POSITION_COMMENT)
                                     : sanitizeAprsComment(aprsUserComment);
  frame += comment;

  aprsClient.println(frame);
  lastAPRSPositionTxMs = millis();
  aprsBeaconTxCount++;

  Serial.print("[APRS] Wysłano pozycję: ");
  Serial.println(frame);
}

static bool parseAx25CallsignToken(const String &raw, String &baseOut, uint8_t &ssidOut) {
  String token = raw;
  token.trim();
  token.toUpperCase();

  if (token.endsWith("*")) {
    token.remove(token.length() - 1);
  }

  int dashPos = token.indexOf('-');
  String base = (dashPos >= 0) ? token.substring(0, dashPos) : token;
  String ssidText = (dashPos >= 0) ? token.substring(dashPos + 1) : "";

  String cleanedBase = "";
  cleanedBase.reserve(base.length());
  for (size_t i = 0; i < base.length(); i++) {
    char c = base.charAt(i);
    if ((c >= 'A' && c <= 'Z') || (c >= '0' && c <= '9')) {
      cleanedBase += c;
    }
  }

  if (cleanedBase.length() == 0) {
    return false;
  }
  if (cleanedBase.length() > 6) {
    cleanedBase = cleanedBase.substring(0, 6);
  }

  int ssid = 0;
  if (ssidText.length() > 0) {
    bool ssidValid = true;
    for (size_t i = 0; i < ssidText.length(); i++) {
      if (!isdigit((unsigned char)ssidText.charAt(i))) {
        ssidValid = false;
        break;
      }
    }
    if (!ssidValid) {
      return false;
    }
    ssid = ssidText.toInt();
    if (ssid < 0 || ssid > 15) {
      return false;
    }
  }

  baseOut = cleanedBase;
  ssidOut = (uint8_t)ssid;
  return true;
}

static bool appendAx25AddressField(uint8_t *buffer, size_t bufferSize, size_t &offset, const String &callsignToken, bool isLastField, bool markRepeated) {
  String baseCall = "";
  uint8_t ssid = 0;
  if (!parseAx25CallsignToken(callsignToken, baseCall, ssid)) {
    return false;
  }

  if ((offset + 7) > bufferSize) {
    return false;
  }

  for (int i = 0; i < 6; i++) {
    char c = (i < (int)baseCall.length()) ? baseCall.charAt(i) : ' ';
    buffer[offset + i] = (uint8_t)(((uint8_t)c) << 1);
  }

  uint8_t ssidByte = (uint8_t)(0x60 | ((ssid & 0x0F) << 1));
  if (markRepeated) {
    ssidByte |= 0x80;
  }
  if (isLastField) {
    ssidByte |= 0x01;
  }
  buffer[offset + 6] = ssidByte;
  offset += 7;
  return true;
}

