tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
static void writeKissEscapedByte(uint8_t b) {
  if (b == 0xC0) {
    gpsSerial.write((uint8_t)0xDB);
    gpsSerial.write((uint8_t)0xDC);
    return;
  }
  if (b == 0xDB) {
    gpsSerial.write((uint8_t)0xDB);
    gpsSerial.write((uint8_t)0xDD);
    return;
  }
  gpsSerial.write(b);
}

static bool sendAprsPositionToKiss() {
  if (!aprsBeaconEnabled || !isUart2AprsTncKissModuleSelected()) {
    return false;
  }

  double txLat = 0.0;
  double txLon = 0.0;
  if (!getServiceCoordinatesForServices(txLat, txLon)) {
    Serial.println("[KISS] Pomijam TX pozycji - brak poprawnych współrzędnych stacji");
    return false;
  }

  String txCallsign = getAprsTxCallsignWithSsid();
  txCallsign.trim();
  if (!isAprsTxCallValid(txCallsign)) {
    Serial.println("[KISS] Pomijam TX pozycji - ustaw znak w konfiguracji APRS");
    return false;
  }
  txCallsign.toUpperCase();

  String latStr = formatAprsCoordinate(txLat, true);
  String lonStr = formatAprsCoordinate(txLon, false);
  bool useProjectComment = (((aprsBeaconTxCount + 1) % 5) == 0); // co piąty beacon
  String comment = useProjectComment ? String(APRS_POSITION_COMMENT)
                                     : sanitizeAprsComment(aprsUserComment);
  String info = "!" + latStr + String(aprsSymbolTable) + lonStr + String(aprsSymbolCode) + " " + comment;

  uint8_t ax25Payload[360];
  size_t payloadLen = 0;

  if (!appendAx25AddressField(ax25Payload, sizeof(ax25Payload), payloadLen, "APRS", false, false)) {
    Serial.println("[KISS] Błąd budowy AX.25 (adres docelowy)");
    return false;
  }
  if (!appendAx25AddressField(ax25Payload, sizeof(ax25Payload), payloadLen, txCallsign, false, false)) {
    Serial.println("[KISS] Błąd budowy AX.25 (adres źródłowy)");
    return false;
  }
  // RF New-N: domyslna sciezka dla mobilnej stacji APRS.
  if (!appendAx25AddressField(ax25Payload, sizeof(ax25Payload), payloadLen, APRS_KISS_RF_PATH1, false, false)) {
    Serial.println("[KISS] Błąd budowy AX.25 (ścieżka 1)");
    return false;
  }
  if (!appendAx25AddressField(ax25Payload, sizeof(ax25Payload), payloadLen, APRS_KISS_RF_PATH2, true, false)) {
    Serial.println("[KISS] Błąd budowy AX.25 (ścieżka 2)");
    return false;
  }

  if ((payloadLen + 2) >= sizeof(ax25Payload)) {
    Serial.println("[KISS] Błąd budowy AX.25 (za mały bufor nagłówka)");
    return false;
  }
  ax25Payload[payloadLen++] = 0x03; // UI frame
  ax25Payload[payloadLen++] = 0xF0; // no layer 3

  for (size_t i = 0; i < info.length(); i++) {
    if (payloadLen >= sizeof(ax25Payload)) {
      Serial.println("[KISS] Błąd budowy AX.25 (za długi payload)");
      return false;
    }
    ax25Payload[payloadLen++] = (uint8_t)info.charAt(i);
  }

  gpsSerial.write((uint8_t)0xC0);
  gpsSerial.write((uint8_t)0x00); // KISS port 0, command Data
  for (size_t i = 0; i < payloadLen; i++) {
    writeKissEscapedByte(ax25Payload[i]);
  }
  gpsSerial.write((uint8_t)0xC0);

  lastAPRSPositionTxMs = millis();
  aprsBeaconTxCount++;

  String pathInfo = String(APRS_KISS_RF_PATH1) + "," + String(APRS_KISS_RF_PATH2);
  String positionInfo = "!" + latStr + String(aprsSymbolTable) + lonStr + String(aprsSymbolCode);
  String tnc2Preview = txCallsign + ">APRS," + pathInfo + ":" + info;
  Serial.print("[KISS] Wysłano beacon: ");
  Serial.println(tnc2Preview);

  APRS_BEACONING_Screen(txCallsign, positionInfo, pathInfo, tnc2Preview);
  return true;
}

static void serviceAprsBeaconTx(unsigned long nowAprsMs) {
  bool kissTxMode = isUart2AprsTncKissModuleSelected();
  bool aprsTxCoordsReady = false;
  double aprsTxLat = 0.0;
  double aprsTxLon = 0.0;
  aprsTxCoordsReady = getServiceCoordinatesForServices(aprsTxLat, aprsTxLon);

  bool txChannelReady = false;
  if (kissTxMode) {
    txChannelReady = true;
  } else {
    txChannelReady = isAprsNetworkFeedEnabled() && aprsConnected && aprsClient.connected() && aprsLoginSent;
  }

  if (aprsBeaconEnabled && aprsTxCoordsReady && txChannelReady) {
    if (nextAPRSPositionDueMs == 0) {
      nextAPRSPositionDueMs = nowAprsMs + APRS_POSITION_FIRST_DELAY_MS;
    } else if ((long)(nowAprsMs - nextAPRSPositionDueMs) >= 0) {
      if (kissTxMode) {
        sendAprsPositionToKiss();
      } else {
        sendAprsPosition();
      }
      nextAPRSPositionDueMs = nowAprsMs + aprsPositionIntervalMs;
    }
  } else {
    nextAPRSPositionDueMs = 0; // reset harmonogramu gdy beacon wyłączony lub brak warunków TX
    aprsBeaconTxCount = 0;
  }
}

// Parsuj ramkÄ™ APRS
// Format przykĹ‚adowy: SP3KON-1>APRS,TCPIP*,qAC,T2POLAND:!5202.40N/01655.12E#PHG5130/Poznan
bool parseAPRSFrame(String line, APRSStation &station) {
  LOGV_PRINTF("[APRS] Parsing frame: %s\n", line.c_str());
  
  // WyczyĹ›Ä‡ strukturÄ™
  station.time = "";
  station.callsign = "";
  station.symbol = "";
  station.symbolTable = "";
  station.lat = 0.0f;
  station.lon = 0.0f;
  station.comment = "";
  station.freqMHz = 0.0f;
  station.distance = 0.0f;
  station.hasLatLon = false;
  
  // Pobierz czas UTC
  struct tm timeinfo;
  if (getLocalTime(&timeinfo, 1)) {
    char timeBuffer[6];
    strftime(timeBuffer, 6, "%H%MZ", &timeinfo);
    station.time = String(timeBuffer);
  } else {
    station.time = "----Z";
  }
  
  // Parsuj callsign (przed >)
  int gtPos = line.indexOf('>');
  if (gtPos < 0) {
    LOGV_PRINTLN("[APRS] Brak znaku '>' w ramce - nieprawidĹ‚owy format");
    return false;
  }
  station.callsign = line.substring(0, gtPos);
  station.callsign.trim();
  LOGV_PRINTF("[APRS] Callsign: %s\n", station.callsign.c_str());

  // Najpierw sprĂłbuj dekodowaÄ‡ Mic-E / skompresowane / obiekty z gotowego parsera
  bool advancedParsed = parseAprsAdvancedPosition(line, station);
  if (advancedParsed) {
    LOGV_PRINTF("[APRS] Advanced decode lat/lon: %.6f, %.6f\n", station.lat, station.lon);
  }
  
  // Parsuj pozycjÄ™ GPS (prosty parser) tylko jeĹ›li advanced nie zadziaĹ‚aĹ‚
  // Szukaj formatu: !5202.40N/01655.12E, @5202.40N/01655.12E, =5202.40N/01655.12E, lub ;...*HHMMzDDMM.mmN/DDDMM.mmE
  int posStart = -1;
  char tableSymbol = 0;
  int commentBeforePos = -1; // Pozycja poczÄ…tku komentarza przed timestampem (dla formatu z ;)
  
