tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  if (!advancedParsed) {
  // Szukaj standardowych formatĂłw pozycji (!, @, =)
  posStart = line.indexOf('!');
  if (posStart >= 0) {
    tableSymbol = '!';
  } else {
    posStart = line.indexOf('@');
    if (posStart >= 0) {
      tableSymbol = '@';
    } else {
      posStart = line.indexOf('=');
      if (posStart >= 0) {
        tableSymbol = '=';
      }
    }
  }
  
  // JeĹ›li nie znaleziono standardowych formatĂłw, szukaj w komentarzu (format z ;)
  if (posStart < 0) {
    int colonPos = line.indexOf(':');
    if (colonPos >= 0) {
      String commentPart = line.substring(colonPos + 1);
      // Szukaj formatu z ; i timestampem: ;...*HHMMzDDMM.mmN/DDDMM.mmE
      int semicolonPos = commentPart.indexOf(';');
      if (semicolonPos >= 0) {
        // Zapisz pozycjÄ™ poczÄ…tku komentarza przed timestampem
        commentBeforePos = colonPos + 1 + semicolonPos + 1; // +1 bo colonPos, +1 bo po ';'
        // Szukaj timestampu *HHMMz
        int timestampPos = commentPart.indexOf('*', semicolonPos);
        if (timestampPos >= 0 && timestampPos + 7 < commentPart.length()) {
          // SprawdĹş czy po timestampie jest pozycja (format: *HHMMzDDMM.mmN)
          char zChar = commentPart.charAt(timestampPos + 6);
          if (zChar == 'z' || zChar == 'Z') {
            // Pozycja zaczyna siÄ™ po 'z'
            posStart = colonPos + 1 + timestampPos + 7; // +1 bo colonPos, +timestampPos, +7 bo "*HHMMz"
            tableSymbol = ';';
          }
        }
      }
    }
  }
  
  if (posStart < 0) {
    // Brak pozycji - sprĂłbuj wyciÄ…gnÄ…Ä‡ tylko callsign i komentarz
    LOGV_PRINTLN("[APRS] Brak pozycji GPS w ramce");
    int colonPos = line.indexOf(':');
    if (colonPos >= 0) {
      station.comment = line.substring(colonPos + 1);
      station.comment.trim();
    }
    return true; // ZwrĂłÄ‡ true nawet bez pozycji
  }
  
  LOGV_PRINTF("[APRS] Znaleziono pozycjÄ™ na indeksie %d, symbol tabeli: %c\n", posStart, tableSymbol);
  
  // Symbol table ustawimy po wyciÄ…gniÄ™ciu pozycji
  
  // Wyznacz poczÄ…tek pozycji (lat) zaleĹĽnie od formatu
  bool posStartIsSymbol = (tableSymbol == '!' || tableSymbol == '@' || tableSymbol == '=' || tableSymbol == '/');
  int latStart = posStartIsSymbol ? (posStart + 1) : posStart; // dla ';' posStart wskazuje juĹĽ na lat

  // ObsĹ‚uga timestampu dla @ lub /: @DDHHMMh... lub /DDHHMMh...
  if (tableSymbol == '@' || tableSymbol == '/') {
    if (posStart + 7 < line.length()) {
      bool tsDigits = true;
      for (int i = 1; i <= 6; i++) {
        char c = line.charAt(posStart + i);
        if (!isDigit(c)) {
          tsDigits = false;
          break;
        }
      }
      char tsChar = line.charAt(posStart + 7);
      if (tsDigits && (tsChar == 'h' || tsChar == 'z' || tsChar == '/')) {
        latStart = posStart + 8;
      }
    }
  }

  // SprawdĹş czy jest format z "/" czy bez "/"
  int slashPos = line.indexOf('/', latStart);
  bool hasSlash = (slashPos >= 0);
  
  bool latOk = false;
  bool lonOk = false;

  if (hasSlash) {
    // Format z "/": !DDMM.mmN/DDDMM.mmEsymbol
    // Parsuj szerokoĹ›Ä‡ geograficznÄ…: 5202.40N (format: DDMM.mmN)
    if (latStart + 7 < line.length()) {
      String latStr = line.substring(latStart, latStart + 7);
      if (latStr.length() == 7) {
        char dir = line.charAt(latStart + 7);
        // UĹĽyj funkcji convertToDecimal do parsowania
        float parsedLat = convertToDecimal(latStr, dir);
        if (!isnan(parsedLat)) {
          station.lat = parsedLat;
          latOk = true;
        }
        
        LOGV_PRINTF("[APRS] Parsed lat: %s%c -> %.6f\n", 
                    latStr.c_str(), dir, station.lat);
      }
    }
    
    // Parsuj dĹ‚ugoĹ›Ä‡ geograficznÄ…: 01655.12E (format: DDDMM.mmE)
    if (slashPos >= 0 && slashPos + 9 < line.length()) {
      String lonStr = line.substring(slashPos + 1, slashPos + 9);
      if (lonStr.length() == 8) {
        char dir = line.charAt(slashPos + 9);
        // UĹĽyj funkcji convertToDecimal do parsowania
        float parsedLon = convertToDecimal(lonStr, dir);
        if (!isnan(parsedLon)) {
          station.lon = parsedLon;
          lonOk = true;
        }
        
        LOGV_PRINTF("[APRS] Parsed lon: %s%c -> %.6f\n", 
                    lonStr.c_str(), dir, station.lon);
      }
    }
    
    // Symbol table (znak przed /)
    if (slashPos >= 0) {
      station.symbolTable = line.substring(slashPos, slashPos + 1);
    }
    // WyciÄ…gnij symbol code (znak po dĹ‚ugoĹ›ci geograficznej, po "/")
    // Format: !DDMM.mmN/DDDMM.mmEsymbol
    if (slashPos >= 0 && slashPos + 10 < line.length()) {
      station.symbol = line.substring(slashPos + 10, slashPos + 11);
    }
  } else {
    // Format bez "/": DDMM.mmNsymbolDDDMM.mmE (symbol miÄ™dzy lat a lon)
    // PrzykĹ‚ad: 5223.73NW01655.41E lub 5225.05NL01651.66E
    if (latStart + 7 < line.length()) {
      String latStr = line.substring(latStart, latStart + 7);
      if (latStr.length() == 7) {
        char dir = line.charAt(latStart + 7);
        // UĹĽyj funkcji convertToDecimal do parsowania
        float parsedLat = convertToDecimal(latStr, dir);
        if (!isnan(parsedLat)) {
          station.lat = parsedLat;
          latOk = true;
        }
        
        LOGV_PRINTF("[APRS] Parsed lat: %s%c -> %.6f\n", 
                    latStr.c_str(), dir, station.lat);
        
        // Symbol table jest zaraz po kierunku lat
        if (latStart + 8 < line.length()) {
          station.symbolTable = line.substring(latStart + 8, latStart + 9);
        }
        
        // DĹ‚ugoĹ›Ä‡ geograficzna zaczyna siÄ™ po symbolu table
        int lonStart = latStart + 9;
        if (lonStart + 7 < line.length()) {
          String lonStr = line.substring(lonStart, lonStart + 8);
          if (lonStr.length() == 8) {
            char dir = line.charAt(lonStart + 8);
            // UĹĽyj funkcji convertToDecimal do parsowania
            float parsedLon = convertToDecimal(lonStr, dir);
            if (!isnan(parsedLon)) {
              station.lon = parsedLon;
              lonOk = true;
            }
            
            LOGV_PRINTF("[APRS] Parsed lon: %s%c -> %.6f\n", 
                        lonStr.c_str(), dir, station.lon);

            // Symbol code jest po kierunku lon (jeĹ›li wystÄ™puje)
            if (lonStart + 9 < line.length()) {
              station.symbol = line.substring(lonStart + 9, lonStart + 10);
            }
          }
        }
      }
    }
  }
  
  // Ustaw flagÄ™ poprawnoĹ›ci pozycji tylko jeĹ›li mamy lat i lon
  station.hasLatLon = (latOk && lonOk);

