tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  // WyciÄ…gnij komentarz (po symbolu i pozycji)
  // Format z "/": !5202.40N/01655.12E#symbol/komentarz lub !5202.40N/01655.12E#symbol komentarz
  // Format bez "/": DDMM.mmNsymbolDDDMM.mmE&komentarz
  // Format z ";": ;komentarz_przed*HHMMzDDMM.mmNsymbolDDDMM.mmE&komentarz_po
  int colonPos = line.indexOf(':');
  if (colonPos >= 0 && colonPos + 1 < line.length()) {
    String fullComment = "";
    
    if (tableSymbol == ';' && commentBeforePos >= 0) {
      // Format z ";": komentarz skĹ‚ada siÄ™ z czÄ™Ĺ›ci przed timestampem i po pozycji
      // CzÄ™Ĺ›Ä‡ przed timestampem
      int timestampStart = line.indexOf('*', commentBeforePos);
      if (timestampStart > commentBeforePos) {
        fullComment = line.substring(commentBeforePos, timestampStart);
      }
      
      // CzÄ™Ĺ›Ä‡ po pozycji
      int commentAfterPos = -1;
      if (hasSlash) {
        int afterSymbol = slashPos + 11;
        if (afterSymbol < line.length()) {
          char c = line.charAt(afterSymbol);
          if (c == '&' || c == '#' || c == '/') {
            commentAfterPos = afterSymbol + 1;
          } else {
            commentAfterPos = afterSymbol;
          }
        }
      } else {
        // Format bez "/": komentarz zaczyna siÄ™ po lon
        int afterLon = latStart + 18;
        if (afterLon < line.length()) {
          char c = line.charAt(afterLon);
          if (c == '&' || c == '#' || c == '/') {
            commentAfterPos = afterLon + 1;
          } else {
            commentAfterPos = afterLon;
          }
        }
      }
      
      if (commentAfterPos >= 0 && commentAfterPos < line.length()) {
        if (fullComment.length() > 0) {
          fullComment += " ";
        }
        fullComment += line.substring(commentAfterPos);
      }
      
      station.comment = fullComment;
      station.comment.trim();
    } else {
      // Standardowe formaty (!, @, =)
      int commentStart = colonPos + 1;
      
      if (hasSlash && slashPos >= 0) {
        // Format z "/": komentarz zaczyna siÄ™ po symbolu
        int afterSymbol = slashPos + 11;
        if (afterSymbol < line.length()) {
          char c = line.charAt(afterSymbol);
          if (c == '#' || c == '/') {
            commentStart = afterSymbol + 1;
          } else {
            // Komentarz zaczyna siÄ™ zaraz po symbolu
            commentStart = afterSymbol;
          }
        }
      } else {
        // Format bez "/": komentarz zaczyna siÄ™ po lon (po kierunku E/W)
        int afterLon = latStart + 18;
        if (afterLon < line.length()) {
          char c = line.charAt(afterLon);
          if (c == '&' || c == '#' || c == '/') {
            commentStart = afterLon + 1;
          } else {
            // Komentarz zaczyna siÄ™ zaraz po lon
            commentStart = afterLon;
          }
        }
      }
      
      // JeĹ›li commentStart jest przed koĹ„cem linii, wyciÄ…gnij komentarz
      if (commentStart < line.length() && commentStart >= colonPos + 1) {
        station.comment = line.substring(commentStart);
        station.comment.trim();
      } else if (commentStart < colonPos + 1) {
        // JeĹ›li nie znaleziono komentarza po pozycji, uĹĽyj caĹ‚ej czÄ™Ĺ›ci po ":"
        station.comment = line.substring(colonPos + 1);
        station.comment.trim();
      }
    }
  }
  } // !advancedParsed
  
  // SprĂłbuj wyciÄ…gnÄ…Ä‡ czÄ™stotliwoĹ›Ä‡ z komentarza
  if (station.comment.length() > 0) {
    float freq = 0.0f;
    if (extractAPRSFrequencyMHz(station.comment, freq)) {
      station.freqMHz = freq;
    }
  }
  
  // Oblicz odlegĹ‚oĹ›Ä‡ jeĹ›li mamy pozycjÄ™
  // UĹĽywamy wspĂłĹ‚rzÄ™dnych z sekcji "Moja Stacja"
  if (station.hasLatLon) {
    // UĹĽyj double dla wiÄ™kszej precyzji obliczeĹ„
    double userLatForDistance = 52.40;  // Fallback jeśli nie ustawione
    double userLonForDistance = 16.92;
    getServiceCoordinatesForServices(userLatForDistance, userLonForDistance);
    double stationLat = (double)station.lat;
    double stationLon = (double)station.lon;
    
    station.distance = calculateDistance(userLatForDistance, userLonForDistance, 
                                         stationLat, stationLon);
    LOGV_PRINTF("[APRS] Distance: user(%.6f,%.6f) -> station(%.6f,%.6f) = %.1f km\n",
                userLatForDistance, userLonForDistance, stationLat, stationLon, station.distance);
  }
  
  return true;
}

// Dodaj nowÄ… stacjÄ™ APRS do tablicy (bez duplikatĂłw - aktualizuje istniejÄ…ce)
void addAPRSStation(APRSStation station) {
  compactAprsStationStrings(station);
  LOGV_PRINT("[APRS] addAPRSStation: ");
  LOGV_PRINT(station.callsign);
  if (station.hasLatLon) {
    LOGV_PRINT(" @ ");
    if (LOG_VERBOSE) Serial.print(station.lat, 4);
    LOGV_PRINT(",");
    if (LOG_VERBOSE) Serial.print(station.lon, 4);
    LOGV_PRINT(" (");
    if (LOG_VERBOSE) Serial.print(station.distance, 1);
    LOGV_PRINT(" km)");
  }
  LOGV_PRINTLN();
  
  // SprawdĹş czy stacja juĹĽ istnieje (po callsign)
  int existingIndex = -1;
  for (int i = 0; i < aprsStationCount; i++) {
    if (aprsStations[i].callsign.equalsIgnoreCase(station.callsign)) {
      existingIndex = i;
      break;
    }
  }
  
  if (existingIndex >= 0) {
    // Stacja juĹĽ istnieje - usuĹ„ jÄ… z obecnej pozycji
    for (int i = existingIndex; i > 0; i--) {
      aprsStations[i] = aprsStations[i - 1];
    }
    // Zaktualizuj dane stacji (nowy czas, pozycja, itp.)
    aprsStations[0] = station;
    LOGV_PRINT("[APRS] Stacja juĹĽ istnieje - zaktualizowano na pozycji 0");
  } else {
    // Nowa stacja - dodaj na poczÄ…tku
    if (aprsStationCount < MAX_APRS_STATIONS) {
      aprsStationCount++;
    }
    
    // PrzesuĹ„ wszystkie stacje o jeden w dĂłĹ‚
    for (int i = MAX_APRS_STATIONS - 1; i > 0; i--) {
      aprsStations[i] = aprsStations[i - 1];
    }
    
    // Dodaj nowÄ… stacjÄ™ na poczÄ…tku
    aprsStations[0] = station;
    LOGV_PRINT("[APRS] Dodano nowÄ… stacjÄ™");
  }
  
  LOGV_PRINT("[APRS] addAPRSStation END, nowy aprsStationCount=");
  LOGV_PRINTLN(aprsStationCount);
}

