tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
static void processAprsFrameFromLine(const String &line, const char *sourceTag) {
  APRSStation station;
  if (!parseAPRSFrame(line, station)) {
    return;
  }

  addAPRSStation(station);

  // While Unlis Hunter or TFT settings screen is active,
  // suppress APRS alert popups and LED/buzzer alerts.
  if (aprsAlertEnabled && currentScreen != SCREEN_UNLIS_HUNTER && !brightnessMenuActive && shouldTriggerAprsAlert(station)) {
    Serial.print("[APRS ALERT] stacja wykryta (");
    Serial.print(sourceTag);
    Serial.print("): ");
    Serial.println(line);
    bool isWxStation = aprsAlertWxEnabled && isAprsWxPayloadValidForAlert(station);
    if (!isWxStation) {
      triggerAprsRgbLedAlert();
    }
    #ifdef ENABLE_TFT_DISPLAY
    portENTER_CRITICAL(&aprsAlertPendingMux);
    aprsAlertPendingStation = station;
    aprsAlertDrawPending = true;
    portEXIT_CRITICAL(&aprsAlertPendingMux);
    #endif
  }
}

// ObsĹ‚uga danych z APRS-IS
void handleAPRSData() {
  if (!aprsConnected || !aprsClient.connected()) {
    if (aprsConnected) {
      LOGV_PRINTLN("[APRS] PoĹ‚Ä…czenie zerwane - reset flagĂłw");
    }
    aprsConnected = false;
    aprsLoginSent = false;
    return;
  }
  
  // Odczytaj dostÄ™pne dane
  while (aprsClient.available()) {
    unsigned char c = (unsigned char)aprsClient.read();
    lastAPRSRxMs = millis();
    
    if (c == '\n' || c == '\r') {
      if (aprsBuffer.length() > 0) {
        String line = aprsBuffer;
        aprsBuffer = "";
        
        // Ignoruj linie zaczynajÄ…ce siÄ™ od # (komentarze serwera)
        if (line.startsWith("#")) {
          Serial.print("[APRS] Server: ");
          Serial.println(line);
          continue;
        }
        
        processAprsFrameFromLine(line, "APRS-IS");
      }
    } else if (c != 0) {
      // Keep control bytes (e.g. 0x1C/0x1D) for Mic-E decode compatibility.
      aprsBuffer += (char)c;
      // Ograniczenie dĹ‚ugoĹ›ci bufora (zapobieganie przepeĹ‚nieniu)
      if (aprsBuffer.length() > 512) {
        aprsBuffer = aprsBuffer.substring(aprsBuffer.length() - 256);
      }
    }
  }
}

// ========== WIFI MANAGER ==========

void startAPMode() {
  // Stabilny portal konfiguracyjny: sam AP (bez STA w tle),
  // ĹĽeby nie gubiÄ‡ poĹ‚Ä…czenia na telefonie/PC przy zmianie kanaĹ‚u przez STA.
  WiFi.mode(WIFI_AP);
  WiFi.softAP(AP_SSID, AP_PASSWORD);
  // Odmierzaj ponowną próbę STA od momentu wejścia do AP.
  lastWiFiReconnectAttempt = millis();
  Serial.println("AP Mode uruchomiony");
  Serial.print("SSID: ");
  Serial.println(AP_SSID);
  Serial.print("IP: ");
  Serial.println(WiFi.softAPIP());
  
  // Aktualizuj wyĹ›wietlacz TFT z IP AP (jeĹ›li jesteĹ›my na ekranie 1)
#ifdef ENABLE_TFT_DISPLAY
  updateScreen1();
#endif
}

void requestRestart(unsigned long delayMs = 1500) {
  restartRequested = true;
  restartAtMs = millis() + delayMs;
}

bool connectToWiFi() {
  return connectToWiFiWithAttempts(40, true);
}

bool connectToWiFiWithAttempts(uint8_t maxAttemptsPerSsid, bool runDiagnostics) {
  if (wifiSSID.length() == 0 && wifiSSID2.length() == 0) {
    return false;
  }

  struct WiFiCred {
    String ssid;
    String pass;
  };

  WiFiCred candidates[2] = {{wifiSSID, wifiPassword}, {wifiSSID2, wifiPassword2}};

  auto attemptConnect = [maxAttemptsPerSsid, runDiagnostics](const WiFiCred &cred) -> bool {
    Serial.println("=== WiFi connect ===");
    Serial.print("SSID: '");
    Serial.print(cred.ssid);
    Serial.print("' (len=");
    Serial.print(cred.ssid.length());
    Serial.println(")");
    Serial.print("PASS len=");
    Serial.println(cred.pass.length());

    WiFi.persistent(false);
    WiFi.setAutoReconnect(true);
    WiFi.setSleep(false);
    WiFi.disconnect(true);
    WiFi.mode(WIFI_OFF);
    delay(250);

    WiFi.mode(WIFI_STA);
    delay(50);
    WiFi.begin(cred.ssid.c_str(), cred.pass.c_str());

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < maxAttemptsPerSsid) {
      delay(500);
      yield();
      Serial.print(".");
      attempts++;
    }

    if (WiFi.status() == WL_CONNECTED) {
      Serial.println("");
      return true;
    }

    Serial.println("");
    Serial.println("BĹ‚Ä…d poĹ‚Ä…czenia WiFi");
    Serial.print("WiFi.status(): ");
    Serial.println((int)WiFi.status());

    if (runDiagnostics) {
      Serial.println("--- WiFi diag ---");
      WiFi.printDiag(Serial);
      Serial.println("--- Scan networks ---");
      int n = WiFi.scanNetworks(/*async=*/false, /*show_hidden=*/true);
      Serial.print("Znaleziono sieci: ");
      Serial.println(n);
      bool found = false;
      for (int i = 0; i < n; i++) {
        String s = WiFi.SSID(i);
        int32_t rssi = WiFi.RSSI(i);
        wifi_auth_mode_t enc = WiFi.encryptionType(i);
        if (s == cred.ssid) {
          found = true;
          Serial.print("MATCH SSID: ");
          Serial.print(s);
          Serial.print(" RSSI=");
          Serial.print(rssi);
          Serial.print(" enc=");
          Serial.println((int)enc);
        }
      }
      if (!found) {
        Serial.println("UWAGA: Nie widzÄ™ Twojego SSID w skanie (moĹĽe 5GHz / inny SSID / poza zasiÄ™giem / ukryte SSID).");
      }
    }

    return false;
  };

  for (int i = 0; i < 2; i++) {
    const WiFiCred &cred = candidates[i];
    if (cred.ssid.length() == 0) {
      continue;
    }

    if (i == 1 && cred.ssid == candidates[0].ssid) {
      continue; // avoid duplicate attempt
    }

    bool ok = attemptConnect(cred);
    if (ok) {
      wifiConnected = true;
      Serial.print("PoĹ‚Ä…czono z SSID: ");
      Serial.println(cred.ssid);
      Serial.print("IP: ");
      Serial.println(WiFi.localIP());

      // Aktualizuj wyĹ›wietlacz TFT z IP STA (jeĹ›li jesteĹ›my na ekranie 1)
#ifdef ENABLE_TFT_DISPLAY
      updateScreen1();
#endif

      return true;
    } else {
      Serial.println("PrĂłba poĹ‚Ä…czenia nieudana dla SSID: " + cred.ssid);
    }
  }

  wifiConnected = false;
  return false;
}

void retryWiFiFromAPIfDue(unsigned long now) {
  if (wifiConnected) {
    return;
  }

  if (wifiSSID.length() == 0 && wifiSSID2.length() == 0) {
    return;
  }

  // Retry uruchamiaj tylko wtedy, gdy urządzenie realnie działa jako AP.
  if ((WiFi.getMode() & WIFI_AP) == 0) {
    return;
  }

  if (lastWiFiReconnectAttempt != 0 && (now - lastWiFiReconnectAttempt) < WIFI_AP_RETRY_INTERVAL_MS) {
    return;
  }

  lastWiFiReconnectAttempt = now;
  Serial.println("[WIFI] AP retry timer elapsed -> trying STA (SSID1/SSID2)");

