tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  if (connectToWiFi()) {
    Serial.println("[WIFI] STA reconnect successful");
    return;
  }

  Serial.println("[WIFI] STA reconnect failed, returning to AP mode");
  startAPMode();
}

void retryWiFiFromSTAIfDue(unsigned long now) {
  if (wifiConnected) {
    wifiStaRetryWindowStartMs = 0;
    return;
  }

  if (wifiSSID.length() == 0 && wifiSSID2.length() == 0) {
    return;
  }

  // W AP retry obsługuje osobna funkcja.
  if (WiFi.getMode() & WIFI_AP) {
    return;
  }

  if (wifiStaRetryWindowStartMs == 0) {
    wifiStaRetryWindowStartMs = now;
  }

  if ((now - wifiStaRetryWindowStartMs) >= WIFI_STA_RETRY_WINDOW_MS) {
    Serial.println("[WIFI] STA retry window (10 min) elapsed -> switching to AP mode");
    wifiStaRetryWindowStartMs = 0;
    startAPMode();
    return;
  }

  if (lastWiFiStaReconnectAttempt != 0 && (now - lastWiFiStaReconnectAttempt) < WIFI_STA_RETRY_INTERVAL_MS) {
    return;
  }

  lastWiFiStaReconnectAttempt = now;
  Serial.println("[WIFI] STA offline -> retry connect (SSID1/SSID2)");
  if (connectToWiFiWithAttempts(WIFI_STA_RECONNECT_ATTEMPTS, false)) {
    Serial.println("[WIFI] STA reconnect successful");
    wifiStaRetryWindowStartMs = 0;
    updateNTPTime();
  }
}

// ========== TELNET CLUSTER ==========

void connectToCluster() {
  Serial.println("[CLUSTER] connectToCluster() START");
  
  if (!wifiConnected) {
    Serial.println("[CLUSTER] WiFi nie połączony - wyjście");
    return;
  }
  
  if (telnetClient.connected()) {
    Serial.println("[CLUSTER] Już połączony - wyjście");
    return;
  }
  
  unsigned long now = millis();
  if (now - lastTelnetAttempt < 5000) {
    return; // Cichy return - nie spamuj logu (to byĹ‚o gĹ‚Ăłwne ĹşrĂłdĹ‚o spamu!)
  }
  
  lastTelnetAttempt = now;
  
  Serial.print("[CLUSTER] Łączenie z DX Cluster: ");
  Serial.print(clusterHost);
  Serial.print(":");
  Serial.println(clusterPort);

  // Diagnostyka DNS (czÄ™sty problem gdy host nie rozwiÄ…zuje siÄ™ na ESP32)
  IPAddress resolvedIp;
  if (WiFi.hostByName(clusterHost.c_str(), resolvedIp)) {
    Serial.print("DNS OK: ");
    Serial.print(clusterHost);
    Serial.print(" -> ");
    Serial.println(resolvedIp);
  } else {
    Serial.print("DNS FAIL dla hosta: ");
    Serial.println(clusterHost);
  }
  
  Serial.println("[CLUSTER] Wywołanie telnetClient.connect()...");
  unsigned long connectStart = millis();
  if (telnetClient.connect(clusterHost.c_str(), clusterPort)) {
    unsigned long connectTime = millis() - connectStart;
    Serial.print("[CLUSTER] Połączono z DX Cluster! (czas: ");
    Serial.print(connectTime);
    Serial.println("ms)");
    telnetConnected = true;
    telnetBuffer = "";
    clusterLoginSent = false;
    clusterLoginScheduled = false;
    lastClusterKeepAliveMs = millis();
    lastTelnetRxMs = millis();

    // Zawsze wysyĹ‚amy login po poĹ‚Ä…czeniu (tak jak w projekcie referencyjnym).
    // JeĹ›li uĹĽytkownik nie ustawiĹ‚ znaku, uĹĽywamy domyĹ›lnego (DEFAULT_CALLSIGN).
    clusterLoginScheduled = true;
    clusterSendLoginAtMs = millis() + 1000;
  } else {
    unsigned long connectTime = millis() - connectStart;
    Serial.print("[CLUSTER] Błąd połączenia z DX Cluster (czas: ");
    Serial.print(connectTime);
    Serial.println("ms)");
    telnetConnected = false;
  }
  Serial.println("[CLUSTER] connectToCluster() END");
}

void connectToPotaCluster() {
  if (!wifiConnected) {
    return;
  }
  if (potaClusterHost.length() == 0 || potaClusterPort <= 0) {
    return;
  }
  if (potaTelnetClient.connected()) {
    return;
  }

  unsigned long now = millis();
  if (now - lastPotaAttempt < 5000) {
    return;
  }
  lastPotaAttempt = now;

  Serial.print("[POTA] Łączenie z POTA Cluster: ");
  Serial.print(potaClusterHost);
  Serial.print(":");
  Serial.println(potaClusterPort);

  IPAddress resolvedIp;
  if (WiFi.hostByName(potaClusterHost.c_str(), resolvedIp)) {
    Serial.print("[POTA] DNS OK: ");
    Serial.print(potaClusterHost);
    Serial.print(" -> ");
    Serial.println(resolvedIp);
  } else {
    Serial.print("[POTA] DNS FAIL: ");
    Serial.println(potaClusterHost);
  }

  if (potaTelnetClient.connect(potaClusterHost.c_str(), potaClusterPort)) {
    Serial.println("[POTA] Połączono z POTA Cluster!");
    potaTelnetConnected = true;
    potaTelnetBuffer = "";
    pendingPotaLine = "";
    potaLoginSent = false;
    potaLoginScheduled = false;
    lastPotaKeepAliveMs = millis();
    lastPotaRxMs = millis();

    String login = userCallsign;
    login.trim();
    if (login.length() == 0) {
      login = DEFAULT_CALLSIGN;
    }
    if (userLocator.length() >= 4) {
      login += "/";
      login += userLocator;
    }
    potaTelnetClient.print(login);
    potaTelnetClient.print("\r\n");
    potaLoginSent = true;
    lastPotaKeepAliveMs = millis();

    if (potaFilterCommand.length() > 0) {
      potaTelnetClient.print(potaFilterCommand);
      potaTelnetClient.print("\r\n");
    }
  } else {
    Serial.println("[POTA] Błąd połączenia z POTA Cluster");
    potaTelnetConnected = false;
  }
}

// WyĹ›lij komendÄ™ konfiguracyjnÄ… do DX Cluster (CC-Cluster)
// UWAGA: UĹĽywane TYLKO do konfiguracji odbioru (set/noann, set/nowwv, set/filter, etc.)
// NIE wysyĹ‚a ĹĽadnych spotĂłw - urzÄ…dzenie dziaĹ‚a tylko w trybie odbioru
void sendClusterCommand(String command) {
  if (!telnetConnected || !telnetClient.connected()) {
    Serial.print("[CLUSTER] Nie mo\u017Cna wys\u0142a\u0107 komendy '");
    Serial.print(command);
    Serial.println("' - brak połączenia");
    return;
  }
  
  Serial.print("[CLUSTER] Wysy\u0142anie komendy: ");
  Serial.println(command);
  telnetClient.print(command);
  telnetClient.print("\r\n");
  delay(50); // KrĂłtkie opĂłĹşnienie miÄ™dzy komendami
}

// WyĹ›lij komendy konfiguracyjne CC-Cluster po zalogowaniu
void sendClusterConfigCommands() {
  if (!telnetConnected || !telnetClient.connected()) {
    return;
  }
  
  Serial.println("[CLUSTER] Wysy\u0142anie komend konfiguracyjnych CC-Cluster...");
  
  // WyĹ‚Ä…cz ogĹ‚oszenia (domyĹ›lnie wĹ‚Ä…czone)
  if (clusterNoAnnouncements) {
    sendClusterCommand("set/noann");
  }
  
