tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  // WyĹ‚Ä…cz WWV (domyĹ›lnie wĹ‚Ä…czone)
  if (clusterNoWWV) {
    sendClusterCommand("set/nowwv");
  }
  
  // WyĹ‚Ä…cz WCY (domyĹ›lnie wĹ‚Ä…czone)
  if (clusterNoWCY) {
    sendClusterCommand("set/nowcy");
  }
  
  // Ustaw filtry (jeĹ›li wĹ‚Ä…czone)
  if (clusterUseFilters && clusterFilterCommands.length() > 0) {
    // Parsuj i wyĹ›lij komendy filtrĂłw (moĹĽe byÄ‡ kilka linii oddzielonych \n)
    String filters = clusterFilterCommands;
    int pos = 0;
    while (pos < filters.length()) {
      int nextPos = filters.indexOf('\n', pos);
      if (nextPos < 0) {
        nextPos = filters.length();
      }
      String cmd = filters.substring(pos, nextPos);
      cmd.trim();
      if (cmd.length() > 0) {
        sendClusterCommand(cmd);
      }
      pos = nextPos + 1;
    }
  } else {
    // JeĹ›li filtry wyĹ‚Ä…czone, wyczyĹ›Ä‡ wszystkie filtry
    sendClusterCommand("set/nofilter");
  }
  
  Serial.println("[CLUSTER] Komendy konfiguracyjne wys\u0142ane");
}

void handleTelnetData() {
  static unsigned long lastTelnetPrint = 0;
  static int telnetCallCount = 0;
  telnetCallCount++;
  
  if (!telnetConnected || !telnetClient.connected()) {
    if (telnetConnected) {
      LOGV_PRINTLN("[TELNET] PoĹ‚Ä…czenie zerwane - reset flagĂłw");
    }
    telnetConnected = false;
    clusterLoginSent = false;
    clusterLoginScheduled = false;
    return;
  }
  
  // Print co 1000 wywoĹ‚aĹ„ (dla debugowania)
  unsigned long now = millis();
  if (now - lastTelnetPrint > 30000) { // Co 30 sekund
    LOGV_PRINT("[TELNET] handleTelnetData wywoĹ‚ane ");
    LOGV_PRINT(telnetCallCount);
    LOGV_PRINT(" razy, available=");
    LOGV_PRINTLN(telnetClient.available());
    lastTelnetPrint = now;
    telnetCallCount = 0;
  }
  
  // Nie blokuj pÄ™tli gĹ‚Ăłwnej: w jednej iteracji czytaj maksymalnie N bajtĂłw
  // i dawaj yield, ĹĽeby nie wpaĹ›Ä‡ w WDT przy duĹĽym strumieniu.
  int processed = 0;
  const int maxPerLoop = 256;
  int availableBefore = telnetClient.available();
  
  while (telnetClient.available() && processed < maxPerLoop) {
    char c = telnetClient.read();
    processed++;
    lastTelnetRxMs = millis();
    if ((processed % 64) == 0) {
      yield();
      // obsĹ‚uĹĽ WWW nawet jeĹ›li telnet zalewa danymi
      if (server != nullptr) {
        server->handleClient();
      }
    }
    
    if (c == '\n' || c == '\r') {
      if (telnetBuffer.length() > 0) {
        // Nie parsuj tu (to bywa kosztowne). PrzekaĹĽ liniÄ™ do przetworzenia w loop().
        if (pendingTelnetLine.length() == 0) {
          pendingTelnetLine = telnetBuffer;
        } else {
          pendingTelnetDropped++;
        }
        telnetBuffer = "";
      }
    } else if (c >= 32 && c < 127) {
      telnetBuffer += c;
      if (telnetBuffer.length() > 512) {
        telnetBuffer = ""; // Ochrona przed przepeĹ‚nieniem
      }
    }
  }
  
  if (processed > 0) {
    LOGV_PRINT("[TELNET] Przetworzono ");
    LOGV_PRINT(processed);
    LOGV_PRINT(" bajtĂłw (byĹ‚o ");
    LOGV_PRINT(availableBefore);
    LOGV_PRINT(", zostaĹ‚o ");
    LOGV_PRINT(telnetClient.available());
    LOGV_PRINTLN(")");
  }
  
  if (telnetClient.available() && processed >= maxPerLoop) {
    LOGV_PRINTLN("[TELNET] WARNING: ZostaĹ‚o wiÄ™cej danych - nastÄ™pna iteracja");
    // Zostaw resztÄ™ na nastÄ™pnÄ… iteracjÄ™ loop()
    yield();
  }
  
  // SprawdĹş czy poĹ‚Ä…czenie nadal dziaĹ‚a
  if (!telnetClient.connected()) {
    LOGV_PRINTLN("[TELNET] RozĹ‚Ä…czono z DX Cluster");
    telnetConnected = false;
    clusterLoginSent = false;
    clusterLoginScheduled = false;
  }
}

void handlePotaTelnetData() {
  if (!potaTelnetConnected || !potaTelnetClient.connected()) {
    if (potaTelnetConnected) {
      LOGV_PRINTLN("[POTA] Połączenie zerwane - reset flag");
    }
    potaTelnetConnected = false;
    potaLoginSent = false;
    potaLoginScheduled = false;
    return;
  }

  int processed = 0;
  const int maxPerLoop = 256;
  while (potaTelnetClient.available() && processed < maxPerLoop) {
    char c = potaTelnetClient.read();
    processed++;
    lastPotaRxMs = millis();
    if ((processed % 64) == 0) {
      yield();
      if (server != nullptr) {
        server->handleClient();
      }
    }

    if (c == '\n' || c == '\r') {
      if (potaTelnetBuffer.length() > 0) {
        if (pendingPotaLine.length() == 0) {
          pendingPotaLine = potaTelnetBuffer;
        } else {
          pendingPotaDropped++;
        }
        potaTelnetBuffer = "";
      }
    } else if (c >= 32 && c < 127) {
      potaTelnetBuffer += c;
      if (potaTelnetBuffer.length() > 512) {
        potaTelnetBuffer = "";
      }
    }
  }

  if (!potaTelnetClient.connected()) {
    LOGV_PRINTLN("[POTA] Rozłączono z POTA Cluster");
    potaTelnetConnected = false;
    potaLoginSent = false;
    potaLoginScheduled = false;
  }
}

// ========== NTP TIME ==========

void updateNTPTime() {
  unsigned long now = millis();
  if (isGpsTimeSourceActive(now)) {
    return;
  }

  if (lastNTPUpdate != 0 && (now - lastNTPUpdate < 3600000)) { // Aktualizuj co godzinÄ™
    return;
  }
  
  if (!wifiConnected) {
    return;
  }
  
  Serial.println("[NTP] Aktualizacja czasu NTP...");
  configTime(GMT_OFFSET_SEC, 0, NTP_SERVER);
  lastNTPUpdate = now;
  
  struct tm timeinfo;
  if (getLocalTime(&timeinfo)) {
    Serial.println("[NTP] Czas NTP zsynchronizowany");
  } else {
    Serial.println("[NTP] BĹÄ„D: Nie udaĹ‚o siÄ™ pobraÄ‡ czasu NTP");
  }
}

// ========== PREFERENCES ==========

void loadPreferences() {
  if (preferences == nullptr) {
    preferences = new Preferences();
  }
  
  preferences->begin("dxcluster", false);
  yield();

  // Kolejność ekranów
  loadDefaultScreenOrder();
  size_t bytesRead = preferences->getBytes("screen_order", screenOrder, sizeof(screenOrder));
  if (bytesRead != sizeof(screenOrder)) {
    loadDefaultScreenOrder();
  }
  ensureScreenOrderValid();
  currentScreen = firstActiveScreen();
  tftAutoSwitchEnabled = preferences->getBool("tft_autosw", false);
  applyTftAutoSwitchTimeSec(preferences->getInt("tft_sw_sec", DEFAULT_TFT_SWITCH_TIME_SEC));
  tftAutoSwitchLastMs = millis();
  tftAutoSwitchLastScreen = currentScreen;
  
  wifiSSID = preferences->getString("wifi_ssid", "");
  yield();
  wifiPassword = preferences->getString("wifi_pass", "");
  yield();
  wifiSSID2 = preferences->getString("wifi_ssid2", "");
  yield();
  wifiPassword2 = preferences->getString("wifi_pass2", "");
  yield();
  
  clusterHost = preferences->getString("cluster_host", DEFAULT_CLUSTER_HOST);
  yield();
  clusterPort = preferences->getInt("cluster_port", DEFAULT_CLUSTER_PORT);
  yield();
  potaClusterHost = preferences->getString("pota_host", DEFAULT_POTA_CLUSTER_HOST);
  yield();
  potaClusterPort = preferences->getInt("pota_port", DEFAULT_POTA_CLUSTER_PORT);
  yield();
  potaFilterCommand = preferences->getString("pota_filter", DEFAULT_POTA_FILTER_COMMAND);
  yield();
  potaApiUrl = preferences->getString("pota_api_url", DEFAULT_POTA_API_URL);
  yield();
  hamalertHost = preferences->getString("hama_host", DEFAULT_HAMALERT_HOST);
  yield();
  hamalertPort = preferences->getInt("hama_port", DEFAULT_HAMALERT_PORT);
  if (hamalertPort <= 0 || hamalertPort > 65535) hamalertPort = DEFAULT_HAMALERT_PORT;
  yield();
  hamalertLogin = preferences->getString("hama_user", "");
  yield();
  hamalertPassword = preferences->getString("hama_pass", "");
  yield();
  userCallsign = preferences->getString("user_callsign", "");
  yield();
  userLocator = preferences->getString("user_locator", "");
  yield();
  timezoneHours = preferences->getFloat("timezone", DEFAULT_TIMEZONE_HOURS);
  if (timezoneHours < -12.0f) timezoneHours = -12.0f;
  if (timezoneHours > 14.0f) timezoneHours = 14.0f;
  yield();
  userLat = preferences->getFloat("user_lat", 0.0f);
  yield();
  userLon = preferences->getFloat("user_lon", 0.0f);
  yield();
  userLatLonValid = preferences->getBool("user_ll_ok", false);
  useGpsIfActive = preferences->getBool(NVS_KEY_USE_GPS_IF_ACTIVE, false);
  uart2ConnectedModule = sanitizeUart2ConnectedModule(
    preferences->getString(NVS_KEY_UART2_CONNECTED_MODULE, "none")
  );
  uart2Mode = uart2ModeFromCode(preferences->getString(NVS_KEY_UART2_MODE, "gps"));
  applyUart2BaudRate(preferences->getInt(NVS_KEY_UART2_BAUD, (int)DEFAULT_UART2_BAUD));
  applyUart2DataBits(preferences->getInt(NVS_KEY_UART2_DATABITS, DEFAULT_UART2_DATA_BITS));
  uart2Parity = uart2ParityFromCode(preferences->getString(NVS_KEY_UART2_PARITY, "none"));
  applyUart2StopBits(preferences->getInt(NVS_KEY_UART2_STOP_BITS, DEFAULT_UART2_STOP_BITS));
  bridgeBtPairedAddress = normalizeBridgeBtAddress(preferences->getString(NVS_KEY_BRIDGE_PAIR_ADDR, ""));
  bridgeBtPairedName = sanitizeBridgeTextField(preferences->getString(NVS_KEY_BRIDGE_PAIR_NAME, ""), 40);
  bridgeBtAutoConnectPending = (bridgeBtPairedAddress.length() == 12);
  yield();
  qrzUsername = preferences->getString("qrz_user", "");
  yield();
  qrzPassword = preferences->getString("qrz_pass", "");
  yield();
  weatherApiKey = preferences->getString("weather_key", "");
  yield();
  openWebRxUrl = preferences->getString("openwebrx_url", DEFAULT_OPENWEBRX_URL);
  yield();
  backlightPercent = preferences->getInt("tft_backlight", TFT_BACKLIGHT);
  if (backlightPercent < MIN_BACKLIGHT_PERCENT) backlightPercent = MIN_BACKLIGHT_PERCENT;
  if (backlightPercent > 100) backlightPercent = 100;
  tftNightDimmingPercent = preferences->getInt(NVS_KEY_TFT_NIGHT_DIMMING, 0);
  if (tftNightDimmingPercent < 0) tftNightDimmingPercent = 0;
  if (tftNightDimmingPercent > 100) tftNightDimmingPercent = 100;
  tftInvertColors = preferences->getBool("tft_inv", tftInvertColors);
  tftLanguage = preferences->getUChar("tft_lang", TFT_LANG_PL);
  if (tftLanguage > TFT_LANG_EN) tftLanguage = TFT_LANG_PL;
  tftStyleMode = preferences->getUChar("tft_style", TFT_STYLE_DARK);
  if (tftStyleMode > TFT_STYLE_LIGHT) tftStyleMode = TFT_STYLE_DARK;
  dxTableSizeMode = preferences->getUChar("tft_tbl_size", DX_TABLE_SIZE_NORMAL);
  if (dxTableSizeMode > DX_TABLE_SIZE_ENLARGED) dxTableSizeMode = DX_TABLE_SIZE_NORMAL;
  int savedMenuHue = preferences->getInt("menu_hue", DEFAULT_MENU_THEME_HUE);
  if (savedMenuHue < 0) savedMenuHue = 0;
  if (savedMenuHue > 255) savedMenuHue = 255;
  menuThemeHue = (uint8_t)savedMenuHue;
  applyMenuThemeFromHue();
  touchXMin = preferences->getInt("touch_xmin", TOUCH_X_MIN);
  touchXMax = preferences->getInt("touch_xmax", TOUCH_X_MAX);
  touchYMin = preferences->getInt("touch_ymin", TOUCH_Y_MIN);
  touchYMax = preferences->getInt("touch_ymax", TOUCH_Y_MAX);
  touchSwapXY = preferences->getBool("touch_swap", TOUCH_SWAP_XY);
  touchInvertX = preferences->getBool("touch_invx", TOUCH_INVERT_X);
  touchInvertY = preferences->getBool("touch_invy", TOUCH_INVERT_Y);
  touchRotation = preferences->getUChar("touch_rot", 1);
  if (touchRotation > 3) touchRotation = 1;
  tftRotation = preferences->getUChar("tft_rot", 1);
  if (tftRotation > 3) tftRotation = 1;
  if (touchXMin < 0 || touchXMax > 4095 || touchXMin >= touchXMax) {
    touchXMin = TOUCH_X_MIN;
    touchXMax = TOUCH_X_MAX;
  }
  if (touchYMin < 0 || touchYMax > 4095 || touchYMin >= touchYMax) {
    touchYMin = TOUCH_Y_MIN;
    touchYMax = TOUCH_Y_MAX;
  }
  screen1TimeMode = (uint8_t)preferences->getInt("screen1_time", SCREEN1_TIME_UTC);
  if (screen1TimeMode > SCREEN1_TIME_LOCAL) screen1TimeMode = SCREEN1_TIME_UTC;

  screen2FilterModeMask = preferences->getUChar("s2_mode", 0);
  screen2FilterModeMask &= (FILTER_MODE_BIT_CW | FILTER_MODE_BIT_SSB | FILTER_MODE_BIT_DIGI);
  uint16_t screen2BandAllowedMask = 0;
  for (int bandIdx = 1; bandIdx < SCREEN8_FILTER_BANDS_COUNT; bandIdx++) {
    screen2BandAllowedMask |= getBandFilterBitForIndex(bandIdx);
  }
  screen2FilterBandMask = (uint16_t)preferences->getUInt("s2_band", 0);
  screen2FilterBandMask &= screen2BandAllowedMask;

