tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  uint8_t loadedScreen6Sort = preferences->getUChar("s6_sort", APRS_SORT_TIME);
  if (loadedScreen6Sort > APRS_SORT_DISTANCE) {
    loadedScreen6Sort = APRS_SORT_TIME;
  }
  screen6SortMode = (Screen6SortMode)loadedScreen6Sort;

  screen7FilterModeMask = preferences->getUChar("s7_mode", 0);
  screen7FilterModeMask &= (FILTER_MODE_BIT_CW | FILTER_MODE_BIT_SSB | FILTER_MODE_BIT_DIGI);
  uint16_t screen7BandAllowedMask = 0;
  for (int bandIdx = 1; bandIdx < SCREEN2_FILTER_BANDS_COUNT; bandIdx++) {
    screen7BandAllowedMask |= getBandFilterBitForIndex(bandIdx);
  }
  screen7FilterBandMask = (uint16_t)preferences->getUInt("s7_band", 0);
  screen7FilterBandMask &= screen7BandAllowedMask;

  screen8FilterModeMask = preferences->getUChar("s8_mode", 0);
  screen8FilterModeMask &= (FILTER_MODE_BIT_CW | FILTER_MODE_BIT_SSB | FILTER_MODE_BIT_DIGI);
  uint16_t screen8BandAllowedMask = 0;
  for (int bandIdx = 1; bandIdx < SCREEN8_FILTER_BANDS_COUNT; bandIdx++) {
    screen8BandAllowedMask |= getBandFilterBitForIndex(bandIdx);
  }
  screen8FilterBandMask = (uint16_t)preferences->getUInt("s8_band", 0);
  screen8FilterBandMask &= screen8BandAllowedMask;
  
  // Konfiguracja filtrĂłw CC-Cluster
  clusterNoAnnouncements = preferences->getBool("cluster_noann", true);
  yield();
  clusterNoWWV = preferences->getBool("cluster_nowwv", true);
  yield();
  clusterNoWCY = preferences->getBool("cluster_nowcy", true);
  yield();
  clusterUseFilters = preferences->getBool(NVS_KEY_CLUSTER_USEFILTERS, true);
  yield();
  clusterFilterCommands = preferences->getString("cluster_filters", "set/ft8");
  yield();
  
  // Konfiguracja APRS-IS
  aprsIsHost = preferences->getString("aprs_host", DEFAULT_APRS_IS_HOST);
  yield();
  aprsIsPort = preferences->getInt("aprs_port", DEFAULT_APRS_IS_PORT);
  yield();
  aprsCallsign = preferences->getString("aprs_callsign", DEFAULT_APRS_CALLSIGN);
  yield();
  aprsPasscode = preferences->getInt("aprs_passcode", DEFAULT_APRS_PASSCODE);
  applyAprsSsid(preferences->getInt("aprs_ssid", DEFAULT_APRS_SSID));
  yield();
  aprsFilterRadius = preferences->getInt("aprs_radius", DEFAULT_APRS_FILTER_RADIUS);
  yield();
  aprsBeaconEnabled = preferences->getBool("aprs_beacon", true);
  String aprsSymPref = preferences->getString("aprs_symbol", aprsSymbolTwoChar);
  applyAprsSymbol(aprsSymPref);
  aprsUserComment = preferences->getString("aprs_comment", "");
  aprsAlertCsv = sanitizeAprsAlertList(preferences->getString("aprs_alert", ""));
  aprsAlertEnabled = preferences->getBool("aprs_alert_en", true);
  applyAprsAlertMinSeconds(preferences->getInt(NVS_KEY_APRS_ALERT_MIN_SEC, DEFAULT_APRS_ALERT_MIN_SEC));
  applyAprsAlertScreenSeconds(preferences->getInt(NVS_KEY_APRS_ALERT_SCREEN_SEC, DEFAULT_APRS_ALERT_SCREEN_SEC));
  aprsAlertNearbyEnabled = preferences->getBool("aprs_alert_near_en", true);
  aprsAlertWxEnabled = preferences->getBool(NVS_KEY_APRS_ALERT_WX_ENABLED, false);
  applyAprsAlertDistanceKm(preferences->getFloat(NVS_KEY_APRS_ALERT_DISTANCE_KM, DEFAULT_APRS_ALERT_DISTANCE_KM));
  weatherAlertStormEnabled = preferences->getBool(NVS_KEY_WEATHER_ALERT_STORM_ENABLED, DEFAULT_WEATHER_ALERT_STORM_ENABLED);
  weatherAlertWindEnabled = preferences->getBool(NVS_KEY_WEATHER_ALERT_WIND_ENABLED, DEFAULT_WEATHER_ALERT_WIND_ENABLED);
  applyWeatherAlertWindThresholdMs(preferences->getFloat(NVS_KEY_WEATHER_ALERT_WIND_THRESHOLD_MS, DEFAULT_WEATHER_ALERT_WIND_THRESHOLD_MS));
  enableLedAlert = preferences->getBool(NVS_KEY_ENABLE_LED_ALERT, DEFAULT_ENABLE_LED_ALERT);
  applyLedAlertDurationMs(preferences->getInt(NVS_KEY_LED_ALERT_DURATION_MS, DEFAULT_LED_ALERT_DURATION_MS));
  applyLedAlertBlinkMs(preferences->getInt(NVS_KEY_LED_ALERT_BLINK_MS, DEFAULT_LED_ALERT_BLINK_MS));
  resetAprsAlertCooldownState();
  int storedIntervalMin = preferences->getInt(NVS_KEY_APRS_INTERVAL_MIN, DEFAULT_APRS_INTERVAL_MIN);
  applyAprsIntervalMinutes(storedIntervalMin);
  yield();
  // Ograniczenie promienia do 1-50 km
  if (aprsFilterRadius < 1) aprsFilterRadius = 1;
  if (aprsFilterRadius > 50) aprsFilterRadius = 50;
  // Uwaga: APRS uĹĽywa wspĂłĹ‚rzÄ™dnych z sekcji "Moja Stacja" (userLat, userLon) - nie ma osobnych pĂłl

  if (!userLatLonValid && userLocator.length() >= 4) {
    updateUserLatLonFromLocator();
    preferences->putFloat("user_lat", (float)userLat);
    preferences->putFloat("user_lon", (float)userLon);
    preferences->putBool("user_ll_ok", userLatLonValid);
  }
  
  preferences->end();

  // Zastosuj inwersję kolorów po wczytaniu ustawień
  if (tftInitialized) {
    applyTftInversion();
  }
  
  Serial.println("Konfiguracja wczytana");
}

void savePreferences() {
  if (preferences == nullptr) {
    preferences = new Preferences();
  }
  
  preferences->begin("dxcluster", false);
  preferences->putBytes("screen_order", screenOrder, sizeof(screenOrder));
  
  preferences->putString("wifi_ssid", wifiSSID);
  preferences->putString("wifi_pass", wifiPassword);
  preferences->putString("wifi_ssid2", wifiSSID2);
  preferences->putString("wifi_pass2", wifiPassword2);
  preferences->putString("cluster_host", clusterHost);
  preferences->putInt("cluster_port", clusterPort);
  preferences->putString("pota_host", potaClusterHost);
  preferences->putInt("pota_port", potaClusterPort);
  preferences->putString("pota_filter", potaFilterCommand);
  preferences->putString("pota_api_url", potaApiUrl);
  preferences->putString("hama_host", hamalertHost);
  preferences->putInt("hama_port", hamalertPort);
  preferences->putString("hama_user", hamalertLogin);
  preferences->putString("hama_pass", hamalertPassword);
  preferences->putString("user_callsign", userCallsign);
  preferences->putString("user_locator", userLocator);
  preferences->putFloat("timezone", timezoneHours);
  preferences->putFloat("user_lat", (float)userLat);
  preferences->putFloat("user_lon", (float)userLon);
  preferences->putBool("user_ll_ok", userLatLonValid);
  preferences->putBool(NVS_KEY_USE_GPS_IF_ACTIVE, useGpsIfActive);
  preferences->putString(NVS_KEY_UART2_CONNECTED_MODULE, uart2ConnectedModule);
  preferences->putString(NVS_KEY_UART2_MODE, uart2ModeToCode(uart2Mode));
  preferences->putInt(NVS_KEY_UART2_BAUD, (int)uart2BaudRate);
  preferences->putInt(NVS_KEY_UART2_DATABITS, (int)uart2DataBits);
  preferences->putString(NVS_KEY_UART2_PARITY, uart2ParityToCode(uart2Parity));
  preferences->putInt(NVS_KEY_UART2_STOP_BITS, (int)uart2StopBits);
  preferences->putString(NVS_KEY_BRIDGE_PAIR_ADDR, bridgeBtPairedAddress);
  preferences->putString(NVS_KEY_BRIDGE_PAIR_NAME, bridgeBtPairedName);
  preferences->putString("qrz_user", qrzUsername);
  preferences->putString("qrz_pass", qrzPassword);
  preferences->putString("weather_key", weatherApiKey);
  preferences->putString("openwebrx_url", openWebRxUrl);
  preferences->putInt("tft_backlight", backlightPercent);
  preferences->putInt(NVS_KEY_TFT_NIGHT_DIMMING, tftNightDimmingPercent);
  preferences->putBool("tft_inv", tftInvertColors);
  preferences->putUChar("tft_lang", tftLanguage);
  preferences->putUChar("tft_style", tftStyleMode);
  preferences->putUChar("tft_tbl_size", dxTableSizeMode);
  preferences->putInt("menu_hue", menuThemeHue);
  preferences->putInt("screen1_time", screen1TimeMode);
  preferences->putUChar("s2_mode", screen2FilterModeMask);
  preferences->putUInt("s2_band", (uint32_t)screen2FilterBandMask);
  preferences->putUChar("s6_sort", (uint8_t)screen6SortMode);
  preferences->putUChar("s7_mode", screen7FilterModeMask);
  preferences->putUInt("s7_band", (uint32_t)screen7FilterBandMask);
  preferences->putUChar("s8_mode", screen8FilterModeMask);
  preferences->putUInt("s8_band", (uint32_t)screen8FilterBandMask);
  preferences->putBool("tft_autosw", tftAutoSwitchEnabled);
  preferences->putInt("tft_sw_sec", tftAutoSwitchTimeSec);
  preferences->putInt("touch_xmin", touchXMin);
  preferences->putInt("touch_xmax", touchXMax);
  preferences->putInt("touch_ymin", touchYMin);
  preferences->putInt("touch_ymax", touchYMax);
  preferences->putBool("touch_swap", touchSwapXY);
  preferences->putBool("touch_invx", touchInvertX);
  preferences->putBool("touch_invy", touchInvertY);
  preferences->putUChar("touch_rot", touchRotation);
  preferences->putUChar("tft_rot", tftRotation);
  
  // Konfiguracja APRS-IS
  preferences->putString("aprs_host", aprsIsHost);
  preferences->putInt("aprs_port", aprsIsPort);
  preferences->putString("aprs_callsign", aprsCallsign);
  preferences->putInt("aprs_passcode", aprsPasscode);
  preferences->putInt("aprs_ssid", aprsSsid);
  preferences->putBool("aprs_beacon", aprsBeaconEnabled);
  preferences->putString("aprs_symbol", aprsSymbolTwoChar);
  preferences->putString("aprs_comment", aprsUserComment);
  preferences->putString("aprs_alert", aprsAlertCsv);
  preferences->putBool("aprs_alert_en", aprsAlertEnabled);
  preferences->putInt(NVS_KEY_APRS_ALERT_MIN_SEC, aprsAlertMinSeconds);
  preferences->putInt(NVS_KEY_APRS_ALERT_SCREEN_SEC, aprsAlertScreenSeconds);
  preferences->putBool("aprs_alert_near_en", aprsAlertNearbyEnabled);
  preferences->putBool(NVS_KEY_APRS_ALERT_WX_ENABLED, aprsAlertWxEnabled);
  preferences->putFloat(NVS_KEY_APRS_ALERT_DISTANCE_KM, aprsAlertDistanceKm);
  preferences->putBool(NVS_KEY_WEATHER_ALERT_STORM_ENABLED, weatherAlertStormEnabled);
  preferences->putBool(NVS_KEY_WEATHER_ALERT_WIND_ENABLED, weatherAlertWindEnabled);
  preferences->putFloat(NVS_KEY_WEATHER_ALERT_WIND_THRESHOLD_MS, weatherAlertWindThresholdMs);
  preferences->putBool(NVS_KEY_ENABLE_LED_ALERT, enableLedAlert);
  preferences->putInt(NVS_KEY_LED_ALERT_DURATION_MS, ledAlertDurationMs);
  preferences->putInt(NVS_KEY_LED_ALERT_BLINK_MS, ledAlertBlinkMs);
  preferences->putInt(NVS_KEY_APRS_INTERVAL_MIN, aprsIntervalMinutes);
  // Ograniczenie promienia do 1-50 km przed zapisem
  int radiusToSave = aprsFilterRadius;
  if (radiusToSave < 1) radiusToSave = 1;
  if (radiusToSave > 50) radiusToSave = 50;
  preferences->putInt("aprs_radius", radiusToSave);
  // Uwaga: APRS używa współrzędnych z sekcji "Moja Stacja" (userLat, userLon) - nie zapisujemy osobnych pól
  
  // Konfiguracja filtrów CC-Cluster
  preferences->putBool("cluster_noann", clusterNoAnnouncements);
  preferences->putBool("cluster_nowwv", clusterNoWWV);
  preferences->putBool("cluster_nowcy", clusterNoWCY);
  preferences->putBool(NVS_KEY_CLUSTER_USEFILTERS, clusterUseFilters);
  preferences->putString("cluster_filters", clusterFilterCommands);
  
  preferences->end();
  
  Serial.println("Konfiguracja zapisana");
}

// ========== WEB SERVER ==========

