tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
String getMainHTML();
String getConfigHTML();

static bool streamLittleFsFile(const char *path, const char *contentType) {
  if (!littleFsReady) {
    return false;
  }
  File f = LittleFS.open(path, "r");
  if (!f) {
    return false;
  }
  server->streamFile(f, contentType);
  f.close();
  return true;
}

void setupWebServer() {
  // UtwĂłrz serwer jeĹ›li jeszcze nie istnieje
  if (server == nullptr) {
    server = new WebServer(80);
  }
  
  // Strona gĹ‚Ăłwna
  server->on("/", HTTP_GET, []() {
    if (!streamLittleFsFile("/index.html", "text/html; charset=utf-8")) {
      server->send(200, "text/html; charset=utf-8", getMainHTML());
    }
  });

  // Strona gĹ‚Ăłwna (alias /index.html)
  server->on("/index.html", HTTP_GET, []() {
    if (!streamLittleFsFile("/index.html", "text/html; charset=utf-8")) {
      server->send(200, "text/html; charset=utf-8", getMainHTML());
    }
  });

  // Strona gĹ‚Ăłwna (EN)
  server->on("/indexEN.html", HTTP_GET, []() {
    if (!streamLittleFsFile("/indexEN.html", "text/html; charset=utf-8") &&
        !streamLittleFsFile("/index.html", "text/html; charset=utf-8")) {
      server->send(404, "text/plain", "indexEN.html missing in LittleFS");
    }
  });

  // Instrukcja (PL)
  server->on("/instrukcja.txt", HTTP_GET, []() {
    if (!streamLittleFsFile("/instrukcja.txt", "text/plain; charset=utf-8")) {
      server->send(404, "text/plain", "instrukcja.txt missing in LittleFS");
    }
  });

  // Manual (EN)
  server->on("/manual.txt", HTTP_GET, []() {
    if (!streamLittleFsFile("/manual.txt", "text/plain; charset=utf-8")) {
      server->send(404, "text/plain", "manual.txt missing in LittleFS");
    }
  });

  // Arkusze stylów CSS (wspólne + desktop/mobile)
  server->on("/style.css", HTTP_GET, []() {
    if (!streamLittleFsFile("/style.css", "text/css; charset=utf-8")) {
      server->send(404, "text/plain", "style.css missing in LittleFS");
    }
  });

  server->on("/style.base.css", HTTP_GET, []() {
    if (!streamLittleFsFile("/style.base.css", "text/css; charset=utf-8")) {
      server->send(404, "text/plain", "style.base.css missing in LittleFS");
    }
  });

  server->on("/style.desktop.css", HTTP_GET, []() {
    if (!streamLittleFsFile("/style.desktop.css", "text/css; charset=utf-8")) {
      server->send(404, "text/plain", "style.desktop.css missing in LittleFS");
    }
  });

  server->on("/style.mobile.css", HTTP_GET, []() {
    if (!streamLittleFsFile("/style.mobile.css", "text/css; charset=utf-8")) {
      server->send(404, "text/plain", "style.mobile.css missing in LittleFS");
    }
  });
  
  // Strona konfiguracji
  server->on("/config", HTTP_GET, []() {
    if (!streamLittleFsFile("/index.html", "text/html; charset=utf-8")) {
      server->send(200, "text/html; charset=utf-8", getConfigHTML());
    }
  });
  
  // API - pobierz wszystkie spoty (maksymalnie 50)
  server->on("/api/spots", HTTP_GET, []() {
    // ZwiÄ™kszony bufor JSON dla 50 spotĂłw (kaĹĽdy spot ~150-200 bajtĂłw)
    StaticJsonDocument<12000> doc;  // 50 spotĂłw * ~200 bajtĂłw = ~10KB + margines
    JsonArray spotsArray = doc.createNestedArray("spots");
    
    // ZwrĂłÄ‡ wszystkie spoty (maksymalnie 50)
    for (int i = 0; i < spotCount; i++) {
      JsonObject spotObj = spotsArray.createNestedObject();
      spotObj["time"] = spots[i].time;
      spotObj["callsign"] = spots[i].callsign;
      spotObj["frequency"] = spots[i].frequency;
      spotObj["distance"] = spots[i].distance;
      spotObj["country"] = spots[i].country;
      spotObj["band"] = spots[i].band;
      spotObj["mode"] = spots[i].mode;
      spotObj["spotter"] = spots[i].spotter;
      spotObj["comment"] = spots[i].comment;
    }
    
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });
  
  // API - pobierz stacje APRS
  server->on("/api/aprs", HTTP_GET, []() {
    // Bufor JSON dla 20 stacji APRS (kaĹĽda stacja ~200-250 bajtĂłw)
    StaticJsonDocument<6000> doc;  // 20 stacji * ~250 bajtĂłw = ~5KB + margines
    JsonArray aprsArray = doc.createNestedArray("stations");
    
    // ZwrĂłÄ‡ wszystkie stacje APRS (maksymalnie 20)
    for (int i = 0; i < aprsStationCount; i++) {
      JsonObject stationObj = aprsArray.createNestedObject();
      stationObj["time"] = aprsStations[i].time;
      stationObj["callsign"] = aprsStations[i].callsign;
      stationObj["symbol"] = getAPRSSymbolShort(aprsStations[i]);
      stationObj["lat"] = aprsStations[i].lat;
      stationObj["lon"] = aprsStations[i].lon;
      stationObj["comment"] = aprsStations[i].comment;
      stationObj["distance"] = aprsStations[i].distance;
      stationObj["hasLatLon"] = aprsStations[i].hasLatLon;
      stationObj["freq_mhz"] = aprsStations[i].freqMHz;
    }
    
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });

  // API - POTA (bufor z backendu, z krajami z QRZ jeśli dostępne)
  server->on("/api/pota", HTTP_GET, []() {
    StaticJsonDocument<12000> doc; // do 30 spotów * ~300-350 bajtów
    JsonArray spotsArray = doc.createNestedArray("spots");
    const int apiSpotLimit = 30;
    const int potaApiCount = (potaSpotCount < apiSpotLimit) ? potaSpotCount : apiSpotLimit;
    for (int i = 0; i < potaApiCount; i++) {
      JsonObject spotObj = spotsArray.createNestedObject();
      spotObj["time"] = potaSpots[i].time;
      spotObj["spotTime"] = potaSpots[i].time; // zgodność z POTA API
      spotObj["callsign"] = potaSpots[i].callsign;
      spotObj["frequency"] = potaSpots[i].frequency;
      spotObj["mode"] = potaSpots[i].mode;
      spotObj["country"] = potaSpots[i].country;
      spotObj["spotter"] = potaSpots[i].spotter;
      spotObj["comment"] = potaSpots[i].comment;
      spotObj["band"] = potaSpots[i].band;
    }
    doc["count"] = potaApiCount;
    doc["total"] = potaSpotCount;
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });

  // API - HAMALERT (ostatnie spoty z telnetu)
  server->on("/api/hamalert", HTTP_GET, []() {
    StaticJsonDocument<12000> doc; // do 30 spotów
    JsonArray spotsArray = doc.createNestedArray("spots");
    const int apiSpotLimit = 30;
    const int hamalertApiCount = (hamalertSpotCount < apiSpotLimit) ? hamalertSpotCount : apiSpotLimit;
    for (int i = 0; i < hamalertApiCount; i++) {
      JsonObject spotObj = spotsArray.createNestedObject();
      spotObj["time"] = hamalertSpots[i].time;
      spotObj["spotTime"] = hamalertSpots[i].time;
      spotObj["callsign"] = hamalertSpots[i].callsign;
      spotObj["frequency"] = hamalertSpots[i].frequency;
      spotObj["mode"] = hamalertSpots[i].mode;
      spotObj["country"] = hamalertSpots[i].country;
      spotObj["spotter"] = hamalertSpots[i].spotter;
      spotObj["comment"] = hamalertSpots[i].comment;
      spotObj["band"] = hamalertSpots[i].band;
    }
    doc["count"] = hamalertApiCount;
    doc["total"] = hamalertSpotCount;
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });

  // API - Propagation + HF Band Info
  server->on("/api/propagation", HTTP_GET, []() {
    StaticJsonDocument<2048> doc;
    doc["valid"] = propagationData.valid;
    doc["sfi"] = propagationData.sfi;
    doc["kindex"] = propagationData.kindex;
    doc["aindex"] = propagationData.aindex;
    doc["muf"] = propagationData.muf;
    doc["updated"] = propagationData.updated;
    doc["lastError"] = propagationData.lastError;

    JsonArray bands = doc.createNestedArray("hfBands");
    for (int i = 0; i < 4; i++) {
      JsonObject band = bands.createNestedObject();
      band["label"] = propagationData.hfBandLabel[i];
      band["freq"] = propagationData.hfBandFreq[i];
      band["day"] = propagationData.hfBandDay[i];
      band["night"] = propagationData.hfBandNight[i];
    }

    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });
  
  // API - zapisz konfiguracjÄ™
  server->on("/api/save", HTTP_POST, []() {
    if (server->hasArg("plain")) {
      String body = server->arg("plain");
      
