tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
        StaticJsonDocument<8192> doc;  // Bufor dla pełnego payloadu konfiguracji z WWW
      DeserializationError err = deserializeJson(doc, body);
      if (err) {
        server->send(400, "application/json", "{\"status\":\"error\",\"message\":\"json_parse\"}");
        return;
      }
      
      wifiSSID = doc["wifi_ssid"].as<String>();
      wifiPassword = doc["wifi_pass"].as<String>();
      if (doc["wifi_ssid2"].is<String>()) {
        wifiSSID2 = doc["wifi_ssid2"].as<String>();
      }
      if (doc["wifi_pass2"].is<String>()) {
        wifiPassword2 = doc["wifi_pass2"].as<String>();
      }
      if (doc["uart2_mode"].is<String>()) {
        uart2Mode = uart2ModeFromCode(doc["uart2_mode"].as<String>());
      }
      if (doc.containsKey("uart2_baud")) {
        int uart2BaudCandidate = (int)uart2BaudRate;
        if (doc["uart2_baud"].is<int>()) {
          uart2BaudCandidate = doc["uart2_baud"].as<int>();
        } else if (doc["uart2_baud"].is<long>()) {
          uart2BaudCandidate = (int)doc["uart2_baud"].as<long>();
        } else if (doc["uart2_baud"].is<float>() || doc["uart2_baud"].is<double>()) {
          uart2BaudCandidate = (int)doc["uart2_baud"].as<double>();
        } else if (doc["uart2_baud"].is<String>()) {
          String uart2BaudStr = doc["uart2_baud"].as<String>();
          uart2BaudStr.trim();
          uart2BaudCandidate = uart2BaudStr.toInt();
        }
        applyUart2BaudRate(uart2BaudCandidate);
      }
      if (doc.containsKey("uart2_data_bits")) {
        int uart2DataBitsCandidate = (int)uart2DataBits;
        if (doc["uart2_data_bits"].is<int>()) {
          uart2DataBitsCandidate = doc["uart2_data_bits"].as<int>();
        } else if (doc["uart2_data_bits"].is<long>()) {
          uart2DataBitsCandidate = (int)doc["uart2_data_bits"].as<long>();
        } else if (doc["uart2_data_bits"].is<float>() || doc["uart2_data_bits"].is<double>()) {
          uart2DataBitsCandidate = (int)doc["uart2_data_bits"].as<double>();
        } else if (doc["uart2_data_bits"].is<String>()) {
          String uart2DataBitsStr = doc["uart2_data_bits"].as<String>();
          uart2DataBitsStr.trim();
          uart2DataBitsCandidate = uart2DataBitsStr.toInt();
        }
        applyUart2DataBits(uart2DataBitsCandidate);
      }
      if (doc["uart2_parity"].is<String>()) {
        uart2Parity = uart2ParityFromCode(doc["uart2_parity"].as<String>());
      }
      if (doc.containsKey("uart2_stop_bits")) {
        int uart2StopBitsCandidate = (int)uart2StopBits;
        if (doc["uart2_stop_bits"].is<int>()) {
          uart2StopBitsCandidate = doc["uart2_stop_bits"].as<int>();
        } else if (doc["uart2_stop_bits"].is<long>()) {
          uart2StopBitsCandidate = (int)doc["uart2_stop_bits"].as<long>();
        } else if (doc["uart2_stop_bits"].is<float>() || doc["uart2_stop_bits"].is<double>()) {
          uart2StopBitsCandidate = (int)doc["uart2_stop_bits"].as<double>();
        } else if (doc["uart2_stop_bits"].is<String>()) {
          String uart2StopBitsStr = doc["uart2_stop_bits"].as<String>();
          uart2StopBitsStr.trim();
          uart2StopBitsCandidate = uart2StopBitsStr.toInt();
        }
        applyUart2StopBits(uart2StopBitsCandidate);
      }
      clusterHost = doc["cluster_host"].as<String>();
      if (doc["pota_host"].is<String>()) {
        potaClusterHost = doc["pota_host"].as<String>();
      }
      if (doc["pota_filter"].is<String>()) {
        potaFilterCommand = doc["pota_filter"].as<String>();
      }
      if (doc["pota_api_url"].is<String>()) {
        potaApiUrl = doc["pota_api_url"].as<String>();
      }
      if (doc["hamalert_host"].is<String>()) {
        hamalertHost = doc["hamalert_host"].as<String>();
      }
      if (doc["hamalert_port"].is<int>()) {
        hamalertPort = doc["hamalert_port"].as<int>();
      }
      if (doc["hamalert_login"].is<String>()) {
        hamalertLogin = doc["hamalert_login"].as<String>();
      }
      if (doc["hamalert_password"].is<String>()) {
        hamalertPassword = doc["hamalert_password"].as<String>();
      }
      userCallsign = doc["user_callsign"].as<String>();
      userLocator = doc["user_locator"].as<String>();
      if (doc["timezone"].is<float>() || doc["timezone"].is<double>() || doc["timezone"].is<int>()) {
        timezoneHours = doc["timezone"].as<float>();
        if (timezoneHours < -12.0f) timezoneHours = -12.0f;
        if (timezoneHours > 14.0f) timezoneHours = 14.0f;
      }
      
      // WspĂłĹ‚rzÄ™dne geograficzne (LAT/LON)
      bool latProvided = false;
      bool lonProvided = false;
      if (doc["user_lat"].is<float>() || doc["user_lat"].is<double>()) {
        userLat = doc["user_lat"].as<double>();
        latProvided = true;
      }
      if (doc["user_lon"].is<float>() || doc["user_lon"].is<double>()) {
        userLon = doc["user_lon"].as<double>();
        lonProvided = true;
      }
      // JeĹ›li podano obie wspĂłĹ‚rzÄ™dne, ustaw flagÄ™ jako waĹĽne
      // Uwaga: sprawdzamy czy wartoĹ›ci sÄ… w prawidĹ‚owym zakresie (nie tylko != 0)
      if (latProvided && lonProvided && 
          userLat >= -90.0 && userLat <= 90.0 && 
          userLon >= -180.0 && userLon <= 180.0) {
        userLatLonValid = true;
      } else if (latProvided || lonProvided) {
        // JeĹ›li podano tylko jednÄ… wspĂłĹ‚rzÄ™dnÄ…, uznaj za nieprawidĹ‚owe
        userLatLonValid = false;
      }
      if (doc["use_gps_if_active"].is<bool>()) {
        useGpsIfActive = doc["use_gps_if_active"].as<bool>();
      }
      if (doc.containsKey("uart2_connected_module")) {
        uart2ConnectedModule = sanitizeUart2ConnectedModule(doc["uart2_connected_module"].as<String>());
      }
      
      if (doc["qrz_user"].is<String>()) {
        qrzUsername = doc["qrz_user"].as<String>();
      }
      if (doc["qrz_pass"].is<String>()) {
        qrzPassword = doc["qrz_pass"].as<String>();
      }
      if (doc["weather_key"].is<String>()) {
        weatherApiKey = doc["weather_key"].as<String>();
      }
      if (doc["openwebrx_url"].is<String>()) {
        openWebRxUrl = doc["openwebrx_url"].as<String>();
      }
      if (doc["tft_backlight"].is<int>()) {
        backlightPercent = doc["tft_backlight"].as<int>();
        if (backlightPercent < MIN_BACKLIGHT_PERCENT) backlightPercent = MIN_BACKLIGHT_PERCENT;
        if (backlightPercent > 100) backlightPercent = 100;
      }
      if (doc["tft_night_dimming"].is<int>()) {
        tftNightDimmingPercent = doc["tft_night_dimming"].as<int>();
        if (tftNightDimmingPercent < 0) tftNightDimmingPercent = 0;
        if (tftNightDimmingPercent > 100) tftNightDimmingPercent = 100;
      }
      if (doc["tft_invert"].is<bool>()) {
        tftInvertColors = doc["tft_invert"].as<bool>();
      }
      if (doc["tft_lang"].is<String>()) {
        tftLanguage = tftLangFromCode(doc["tft_lang"].as<String>());
      } else if (doc["tft_lang"].is<int>()) {
        int lang = doc["tft_lang"].as<int>();
        tftLanguage = (lang == TFT_LANG_EN) ? TFT_LANG_EN : TFT_LANG_PL;
      }
      if (doc["tft_style"].is<String>()) {
        tftStyleMode = tftStyleFromCode(doc["tft_style"].as<String>());
        applyTftUiPalette();
      } else if (doc["tft_style"].is<int>()) {
        int styleMode = doc["tft_style"].as<int>();
        tftStyleMode = (styleMode == TFT_STYLE_LIGHT) ? TFT_STYLE_LIGHT : TFT_STYLE_DARK;
        applyTftUiPalette();
      }
      if (doc["table_size"].is<String>()) {
        dxTableSizeMode = dxTableSizeFromCode(doc["table_size"].as<String>());
      } else if (doc["table_size"].is<int>()) {
        int sizeMode = doc["table_size"].as<int>();
        dxTableSizeMode = (sizeMode == DX_TABLE_SIZE_ENLARGED) ? DX_TABLE_SIZE_ENLARGED : DX_TABLE_SIZE_NORMAL;
      }
      if (doc["menu_hue"].is<int>()) {
        int hue = doc["menu_hue"].as<int>();
        if (hue < 0) hue = 0;
        if (hue > 255) hue = 255;
        menuThemeHue = (uint8_t)hue;
        applyMenuThemeFromHue();
      }
      
      // Konfiguracja filtrĂłw CC-Cluster
      if (doc["cluster_noann"].is<bool>()) {
        clusterNoAnnouncements = doc["cluster_noann"].as<bool>();
      }
      if (doc["cluster_nowwv"].is<bool>()) {
        clusterNoWWV = doc["cluster_nowwv"].as<bool>();
      }
      if (doc["cluster_nowcy"].is<bool>()) {
        clusterNoWCY = doc["cluster_nowcy"].as<bool>();
      }
      if (doc["cluster_usefilters"].is<bool>()) {
        clusterUseFilters = doc["cluster_usefilters"].as<bool>();
      }
      if (doc["cluster_filters"].is<String>()) {
        clusterFilterCommands = doc["cluster_filters"].as<String>();
      }
      
      // Konfiguracja APRS-IS
      if (doc["aprs_host"].is<String>()) {
        aprsIsHost = doc["aprs_host"].as<String>();
      }
      if (doc["aprs_port"].is<int>()) {
        aprsIsPort = doc["aprs_port"].as<int>();
      }
      if (doc["aprs_callsign"].is<String>()) {
        aprsCallsign = doc["aprs_callsign"].as<String>();
      }
      if (doc["aprs_passcode"].is<int>()) {
        aprsPasscode = doc["aprs_passcode"].as<int>();
      }
      if (doc["aprs_ssid"].is<int>()) {
        applyAprsSsid(doc["aprs_ssid"].as<int>());
      }
      if (doc["aprs_beacon"].is<bool>()) {
        aprsBeaconEnabled = doc["aprs_beacon"].as<bool>();
      }
      if (doc["aprs_symbol"].is<String>()) {
        applyAprsSymbol(doc["aprs_symbol"].as<String>());
      }
      if (doc["aprs_comment"].is<String>()) {
        aprsUserComment = sanitizeAprsComment(doc["aprs_comment"].as<String>());
      }
      bool aprsAlertConfigChanged = false;
      if (doc["aprs_alert"].is<String>()) {
        aprsAlertCsv = sanitizeAprsAlertList(doc["aprs_alert"].as<String>());
        aprsAlertConfigChanged = true;
      }
      if (doc["aprs_alert_enabled"].is<bool>()) {
        aprsAlertEnabled = doc["aprs_alert_enabled"].as<bool>();
      }
      if (doc["aprs_alert_nearby_enabled"].is<bool>()) {
        aprsAlertNearbyEnabled = doc["aprs_alert_nearby_enabled"].as<bool>();
      }
      if (doc["aprs_alert_wx_enabled"].is<bool>()) {
        aprsAlertWxEnabled = doc["aprs_alert_wx_enabled"].as<bool>();
        aprsAlertConfigChanged = true;
      }
      if (doc.containsKey("aprs_alert_min_sec")) {
        int alertMinSecCandidate = aprsAlertMinSeconds;
        if (doc["aprs_alert_min_sec"].is<int>()) {
          alertMinSecCandidate = doc["aprs_alert_min_sec"].as<int>();
        } else if (doc["aprs_alert_min_sec"].is<long>()) {
          alertMinSecCandidate = (int)doc["aprs_alert_min_sec"].as<long>();
        } else if (doc["aprs_alert_min_sec"].is<float>() || doc["aprs_alert_min_sec"].is<double>()) {
          alertMinSecCandidate = (int)doc["aprs_alert_min_sec"].as<double>();
        } else if (doc["aprs_alert_min_sec"].is<String>()) {
          String alertMinStr = doc["aprs_alert_min_sec"].as<String>();
          alertMinStr.trim();
          alertMinSecCandidate = alertMinStr.toInt();
        }
        applyAprsAlertMinSeconds(alertMinSecCandidate);
        aprsAlertConfigChanged = true;
      }
      if (doc.containsKey("aprs_alert_screen_sec")) {
        int alertScreenSecCandidate = aprsAlertScreenSeconds;
        if (doc["aprs_alert_screen_sec"].is<int>()) {
          alertScreenSecCandidate = doc["aprs_alert_screen_sec"].as<int>();
        } else if (doc["aprs_alert_screen_sec"].is<long>()) {
          alertScreenSecCandidate = (int)doc["aprs_alert_screen_sec"].as<long>();
        } else if (doc["aprs_alert_screen_sec"].is<float>() || doc["aprs_alert_screen_sec"].is<double>()) {
          alertScreenSecCandidate = (int)doc["aprs_alert_screen_sec"].as<double>();
        } else if (doc["aprs_alert_screen_sec"].is<String>()) {
          String alertScreenSecStr = doc["aprs_alert_screen_sec"].as<String>();
          alertScreenSecStr.trim();
          alertScreenSecCandidate = alertScreenSecStr.toInt();
        }
        applyAprsAlertScreenSeconds(alertScreenSecCandidate);
      }
      if (doc.containsKey("aprs_alert_distance_km")) {
        float alertDistanceCandidate = aprsAlertDistanceKm;
        if (doc["aprs_alert_distance_km"].is<float>() || doc["aprs_alert_distance_km"].is<double>()) {
          alertDistanceCandidate = (float)doc["aprs_alert_distance_km"].as<double>();
        } else if (doc["aprs_alert_distance_km"].is<int>()) {
          alertDistanceCandidate = (float)doc["aprs_alert_distance_km"].as<int>();
        } else if (doc["aprs_alert_distance_km"].is<long>()) {
          alertDistanceCandidate = (float)doc["aprs_alert_distance_km"].as<long>();
        } else if (doc["aprs_alert_distance_km"].is<String>()) {
          String alertDistanceStr = doc["aprs_alert_distance_km"].as<String>();
          alertDistanceStr.trim();
          alertDistanceStr.replace(',', '.');
          alertDistanceCandidate = alertDistanceStr.toFloat();
        }
        applyAprsAlertDistanceKm(alertDistanceCandidate);
      }
      if (doc["weather_alert_storm_enabled"].is<bool>()) {
        weatherAlertStormEnabled = doc["weather_alert_storm_enabled"].as<bool>();
        if (!weatherAlertStormEnabled) {
          nextWeatherStormAlertMs = 0;
        }
      }
      if (doc["weather_alert_wind_enabled"].is<bool>()) {
        weatherAlertWindEnabled = doc["weather_alert_wind_enabled"].as<bool>();
        if (!weatherAlertWindEnabled) {
          nextWeatherWindAlertMs = 0;
        }
      }
      if (doc.containsKey("weather_alert_wind_threshold_ms")) {
        float windThresholdCandidate = weatherAlertWindThresholdMs;
        if (doc["weather_alert_wind_threshold_ms"].is<float>() || doc["weather_alert_wind_threshold_ms"].is<double>()) {
          windThresholdCandidate = (float)doc["weather_alert_wind_threshold_ms"].as<double>();
        } else if (doc["weather_alert_wind_threshold_ms"].is<int>()) {
          windThresholdCandidate = (float)doc["weather_alert_wind_threshold_ms"].as<int>();
        } else if (doc["weather_alert_wind_threshold_ms"].is<long>()) {
          windThresholdCandidate = (float)doc["weather_alert_wind_threshold_ms"].as<long>();
        } else if (doc["weather_alert_wind_threshold_ms"].is<String>()) {
          String windThresholdStr = doc["weather_alert_wind_threshold_ms"].as<String>();
          windThresholdStr.trim();
          windThresholdStr.replace(',', '.');
          windThresholdCandidate = windThresholdStr.toFloat();
        }
        applyWeatherAlertWindThresholdMs(windThresholdCandidate);
      }
      if (doc["enable_led_alert"].is<bool>()) {
        enableLedAlert = doc["enable_led_alert"].as<bool>();
      }
      if (doc.containsKey("led_alert_duration_ms")) {
        int ledDurationCandidate = ledAlertDurationMs;
        if (doc["led_alert_duration_ms"].is<int>()) {
          ledDurationCandidate = doc["led_alert_duration_ms"].as<int>();
        } else if (doc["led_alert_duration_ms"].is<long>()) {
          ledDurationCandidate = (int)doc["led_alert_duration_ms"].as<long>();
        } else if (doc["led_alert_duration_ms"].is<float>() || doc["led_alert_duration_ms"].is<double>()) {
          ledDurationCandidate = (int)doc["led_alert_duration_ms"].as<double>();
        } else if (doc["led_alert_duration_ms"].is<String>()) {
          String ledDurationStr = doc["led_alert_duration_ms"].as<String>();
          ledDurationStr.trim();
          ledDurationCandidate = ledDurationStr.toInt();
        }
        applyLedAlertDurationMs(ledDurationCandidate);
      }
      if (doc.containsKey("led_alert_blink_ms")) {
        int ledBlinkCandidate = ledAlertBlinkMs;
        if (doc["led_alert_blink_ms"].is<int>()) {
          ledBlinkCandidate = doc["led_alert_blink_ms"].as<int>();
        } else if (doc["led_alert_blink_ms"].is<long>()) {
          ledBlinkCandidate = (int)doc["led_alert_blink_ms"].as<long>();
        } else if (doc["led_alert_blink_ms"].is<float>() || doc["led_alert_blink_ms"].is<double>()) {
          ledBlinkCandidate = (int)doc["led_alert_blink_ms"].as<double>();
        } else if (doc["led_alert_blink_ms"].is<String>()) {
          String ledBlinkStr = doc["led_alert_blink_ms"].as<String>();
          ledBlinkStr.trim();
          ledBlinkCandidate = ledBlinkStr.toInt();
        }
        applyLedAlertBlinkMs(ledBlinkCandidate);
      }
      if (doc.containsKey("aprs_interval_min")) {
        int intervalCandidate = aprsIntervalMinutes;
        if (doc["aprs_interval_min"].is<int>()) {
          intervalCandidate = doc["aprs_interval_min"].as<int>();
        } else if (doc["aprs_interval_min"].is<long>()) {
          intervalCandidate = (int)doc["aprs_interval_min"].as<long>();
        } else if (doc["aprs_interval_min"].is<float>() || doc["aprs_interval_min"].is<double>()) {
          intervalCandidate = (int)doc["aprs_interval_min"].as<double>();
        } else if (doc["aprs_interval_min"].is<String>()) {
          String intervalStr = doc["aprs_interval_min"].as<String>();
          intervalStr.trim();
          intervalCandidate = intervalStr.toInt();
        }
        applyAprsIntervalMinutes(intervalCandidate);
      }
      if (aprsAlertConfigChanged) {
        resetAprsAlertCooldownState();
      }
      if (doc["aprs_radius"].is<int>()) {
        aprsFilterRadius = doc["aprs_radius"].as<int>();
        // Ograniczenie promienia do 1-50 km
        if (aprsFilterRadius < 1) aprsFilterRadius = 1;
        if (aprsFilterRadius > 50) aprsFilterRadius = 50;
      }
      // Uwaga: APRS uĹĽywa wspĂłĹ‚rzÄ™dnych z sekcji "Moja Stacja" (userLat, userLon) - nie ma osobnych pĂłl
      
      // Konfiguracja trybu kalibracji dotyku (ręczne nadpisanie)
      if (doc["touch_swap_mode"].is<String>()) {
        String mode = doc["touch_swap_mode"].as<String>();
        // Resetuj wszystkie flagi
        touchSwapXY = false;
        touchInvertX = false;
        touchInvertY = false;
        // Ustaw odpowiednią flagę lub kombinację
        if (mode == "xy") {
          touchSwapXY = true;
        } else if (mode == "x") {
          touchInvertX = true;
        } else if (mode == "y") {
          touchInvertY = true;
        } else if (mode == "both") {
          touchInvertX = true;
          touchInvertY = true;
        } else if (mode == "rot90cw") {
          // Obrót 90° w prawo (clockwise)
          touchSwapXY = true;
          touchInvertX = true;
        } else if (mode == "rot90ccw") {
          // Obrót 90° w lewo (counter-clockwise)
          touchSwapXY = true;
          touchInvertY = true;
        } else if (mode == "xy_both") {
          touchSwapXY = true;
          touchInvertX = true;
          touchInvertY = true;
        }
        // "none" pozostawia wszystkie false
        Serial.print("Touch swap mode set to: ");
        Serial.println(mode);
      }
      
      // Touch rotation (0-3)
      if (doc["touch_rotation"].is<int>()) {
        int rot = doc["touch_rotation"].as<int>();
        if (rot >= 0 && rot <= 3) {
          touchRotation = (uint8_t)rot;
          Serial.print("Touch rotation set to: ");
          Serial.println(touchRotation);
        }
      }

      // TFT rotation (0-3)
      if (doc["tft_rotation"].is<int>()) {
        int rot = doc["tft_rotation"].as<int>();
        if (rot >= 0 && rot <= 3) {
          tftRotation = (uint8_t)rot;
          Serial.print("TFT rotation set to: ");
          Serial.println(tftRotation);
        }
      }

      // Sanitizacja (najczÄ™stsza przyczyna: spacje na koĹ„cu SSID/hasĹ‚a)
      wifiSSID.trim();
      wifiPassword.trim();
      wifiSSID2.trim();
      wifiPassword2.trim();
      clusterHost.trim();
      potaClusterHost.trim();
      potaFilterCommand.trim();
      potaApiUrl.trim();
      hamalertHost.trim();
      hamalertLogin.trim();
      hamalertPassword.trim();
      userCallsign.trim();
      userLocator.trim();
      clusterFilterCommands.trim();
      weatherApiKey.trim();
      openWebRxUrl.trim();
      aprsIsHost.trim();
      aprsCallsign.trim();
      // KiwiSDR URL - może być puste (użytkownik nie musi ustawiać)

      if (potaApiUrl.length() == 0) {
        potaApiUrl = DEFAULT_POTA_API_URL;
      }
      bool hamalertCredentialsProvided = (hamalertLogin.length() > 0 && hamalertPassword.length() > 0);
      if (hamalertCredentialsProvided) {
        if (hamalertHost.length() == 0) {
          hamalertHost = DEFAULT_HAMALERT_HOST;
        }
        if (hamalertPort <= 0 || hamalertPort > 65535) {
          hamalertPort = DEFAULT_HAMALERT_PORT;
        }
      } else {
        // Empty login/password means HAMALERT is intentionally disabled.
        hamalertHost = "";
        hamalertPort = 0;
      }

      // Kolejność ekranów konfigurowana z WWW
      if (doc["screen_order"].is<JsonArray>()) {
        JsonArray arr = doc["screen_order"].as<JsonArray>();
        int idx = 0;
        for (JsonVariant v : arr) {
          if (idx >= SCREEN_ORDER_COUNT) break;
          if (v.is<const char*>()) {
            String code = v.as<const char*>();
            ScreenType parsed = screenCodeToType(code);
            // Unknown code should not silently clear slot to OFF.
            if (parsed == SCREEN_OFF) {
              String tmp = code;
              tmp.toLowerCase();
              tmp.trim();
              if (tmp != "off") {
                parsed = DEFAULT_SCREEN_ORDER[idx];
              }
            }
            screenOrder[idx] = parsed;
          } else if (v.is<int>()) {
            int raw = v.as<int>();
            ScreenType parsed = normalizeScreenType(raw);
            if (parsed == SCREEN_OFF && raw != 0) {
              parsed = DEFAULT_SCREEN_ORDER[idx];
            }
            screenOrder[idx] = parsed;
          }
          idx++;
        }
        // Jeśli JSON był krótszy, pozostałe uzupełnij wartościami domyślnymi,
        // aby nie gubić ekranów (np. APRS RADAR) przy starszym/okrojonym payloadzie.
        for (; idx < SCREEN_ORDER_COUNT; idx++) {
          screenOrder[idx] = DEFAULT_SCREEN_ORDER[idx];
        }
      }
      ensureScreenOrderValid();

      if (doc["tft_auto_switch"].is<bool>()) {
        tftAutoSwitchEnabled = doc["tft_auto_switch"].as<bool>();
      }
      if (doc.containsKey("tft_switch_time_sec")) {
        int switchTimeCandidate = tftAutoSwitchTimeSec;
        if (doc["tft_switch_time_sec"].is<int>()) {
          switchTimeCandidate = doc["tft_switch_time_sec"].as<int>();
        } else if (doc["tft_switch_time_sec"].is<long>()) {
          switchTimeCandidate = (int)doc["tft_switch_time_sec"].as<long>();
        } else if (doc["tft_switch_time_sec"].is<float>() || doc["tft_switch_time_sec"].is<double>()) {
          switchTimeCandidate = (int)doc["tft_switch_time_sec"].as<double>();
        } else if (doc["tft_switch_time_sec"].is<String>()) {
          String switchTimeStr = doc["tft_switch_time_sec"].as<String>();
          switchTimeStr.trim();
          switchTimeCandidate = switchTimeStr.toInt();
        }
        applyTftAutoSwitchTimeSec(switchTimeCandidate);
      }
      resetTftAutoSwitchTimer();

      // Port bywa null, jeĹ›li w JS wyszedĹ‚ NaN
      if (doc["cluster_port"].is<int>()) {
        clusterPort = doc["cluster_port"].as<int>();
      } else {
        clusterPort = DEFAULT_CLUSTER_PORT;
      }
      if (doc["pota_port"].is<int>()) {
        potaClusterPort = doc["pota_port"].as<int>();
      } else {
        potaClusterPort = DEFAULT_POTA_CLUSTER_PORT;
      }

      if (wifiSSID.length() == 0 && wifiSSID2.length() == 0) {
        server->send(400, "application/json", "{\"status\":\"error\",\"message\":\"empty_ssid\"}");
        return;
      }

