tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
      // Aktualizuj współrzędne z locatora TYLKO jeśli nie podano bezpośrednio współrzędnych
      // Priorytet: jeĹ›li userLatLonValid == true (podano bezpoĹ›rednio LAT/LON), nie nadpisuj z locatora
      if (!userLatLonValid && userLocator.length() >= 4) {
        updateUserLatLonFromLocator();
      }
      savePreferences();
      setBacklightPercent(backlightPercent);
      if (tftInitialized) {
        applyTftInversion();
      }
      
      server->send(200, "application/json", "{\"status\":\"ok\",\"action\":\"restart\"}");
      
      // W trybie AP (wifiConnected=false) bez restartu nigdy nie przejdziemy na STA.
      // Restart jest najpewniejszy i upraszcza flow.
      Serial.println("Zapisano konfiguracjÄ™. Restart za chwilÄ™...");
      requestRestart(1500);
    } else {
      server->send(400, "application/json", "{\"status\":\"error\"}");
    }
  });
  
  // API - resetuj kalibrację dotyku do wartości domyślnych
  server->on("/api/reset_touch", HTTP_POST, []() {
    touchXMin = TOUCH_X_MIN;
    touchXMax = TOUCH_X_MAX;
    touchYMin = TOUCH_Y_MIN;
    touchYMax = TOUCH_Y_MAX;
    touchSwapXY = TOUCH_SWAP_XY;
    touchInvertX = TOUCH_INVERT_X;
    touchInvertY = TOUCH_INVERT_Y;
    touchRotation = 1;
    applyTouchRotation();
    
    savePreferences();
    
    Serial.println("Touch calibration reset to defaults");
    server->send(200, "application/json", "{\"status\":\"ok\"}");
  });

  // API - status runtime UART2 (GPS/BT)
  server->on("/api/uart_status", HTTP_GET, []() {
    StaticJsonDocument<256> doc;
    unsigned long nowMs = millis();
    bool gpsMode = isUart2GpsParsingEnabled();
    bool btMode = (uart2Mode == UART2_MODE_BT);

    doc["uart2_mode"] = uart2ModeToCode(uart2Mode);
    doc["uart2_connected_module"] = uart2ConnectedModule;
    doc["gps_active"] = gpsMode && isGpsUartActive(nowMs);
    doc["gps_fix"] = gpsMode && gpsLocationValid && isGpsFixActive(nowMs);
    doc["bt_active"] = btMode;
    doc["aprs_uart_active"] = isUart2AprsUartSourceEnabled();

    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });

  // API - status skanera/parowania BT SPP dla ESP32-BRIDGE
  server->on("/api/bridge_bt_status", HTTP_GET, []() {
    StaticJsonDocument<4096> doc;
    doc["enabled"] = isUart2BridgeModuleSelected();
    doc["scan_in_progress"] = bridgeBtScanInProgress;
    doc["list_collecting"] = bridgeBtListCollecting;
    doc["list_expected"] = bridgeBtListExpected;
    doc["last_error"] = bridgeBtLastError;
    doc["last_ack"] = bridgeBtLastAck;
    doc["disc_status"] = bridgeBtLastDiscStatus;
    doc["last_scan_ms"] = bridgeBtLastScanMs;
    doc["pair_pending"] = bridgeBtPairPending;
    doc["pair_result"] = (bridgeBtPairLastResult > 0) ? "ok" : ((bridgeBtPairLastResult < 0) ? "err" : "none");
    doc["pair_result_ms"] = bridgeBtPairLastResultMs;
    doc["paired_name"] = bridgeBtPairedName;
    doc["paired_addr"] = formatBridgeBtAddressForDisplay(bridgeBtPairedAddress);

    JsonArray devices = doc.createNestedArray("devices");
    for (int i = 0; i < bridgeBtDeviceCount; i++) {
      JsonObject d = devices.createNestedObject();
      d["name"] = bridgeBtDevices[i].name;
      d["addr"] = formatBridgeBtAddressForDisplay(bridgeBtDevices[i].addressNoColon);
      d["addr_raw"] = bridgeBtDevices[i].addressNoColon;
    }

    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });

  // API - uruchom skan BT SPP dla ESP32-BRIDGE
  server->on("/api/bridge_bt_scan", HTTP_POST, []() {
    if (!isUart2BridgeModuleSelected()) {
      server->send(400, "application/json", "{\"status\":\"error\",\"message\":\"bridge_mode_required\"}");
      return;
    }

    startBridgeScanSequence();
    server->send(200, "application/json", "{\"status\":\"ok\",\"action\":\"scan_started\"}");
  });

  // API - sparuj/połącz z urządzeniem BT SPP
  server->on("/api/bridge_bt_pair", HTTP_POST, []() {
    if (!isUart2BridgeModuleSelected()) {
      server->send(400, "application/json", "{\"status\":\"error\",\"message\":\"bridge_mode_required\"}");
      return;
    }

    if (!server->hasArg("plain")) {
      server->send(400, "application/json", "{\"status\":\"error\",\"message\":\"missing_payload\"}");
      return;
    }

    StaticJsonDocument<512> doc;
    DeserializationError err = deserializeJson(doc, server->arg("plain"));
    if (err) {
      server->send(400, "application/json", "{\"status\":\"error\",\"message\":\"json_parse\"}");
      return;
    }

    String name = doc["name"].is<String>() ? doc["name"].as<String>() : "";
    String addr = doc["address"].is<String>() ? doc["address"].as<String>() : "";
    String password = doc["password"].is<String>() ? doc["password"].as<String>() : "";
    if (password.length() > 16) {
      server->send(400, "application/json", "{\"status\":\"error\",\"message\":\"password_too_long\"}");
      return;
    }

    if (!requestBridgePairConnect(name, addr, password, true)) {
      String msg = bridgeBtLastError.length() ? bridgeBtLastError : String("pair_start_failed");
      msg.replace("\"", "'");
      server->send(400, "application/json", String("{\"status\":\"error\",\"message\":\"") + msg + "\"}");
      return;
    }

    server->send(200, "application/json", "{\"status\":\"ok\",\"action\":\"pair_started\"}");
  });

  // API - resetuj rotację TFT do wartości domyślnych
  server->on("/api/reset_tft_rotation", HTTP_POST, []() {
    tftRotation = 1;
    applyTftRotation();
    savePreferences();

    Serial.println("TFT rotation reset to default");
    server->send(200, "application/json", "{\"status\":\"ok\",\"action\":\"restart\"}");
    requestRestart(1500);
  });
  
  // API - pobierz konfigurację
  server->on("/api/config", HTTP_GET, []() {
    StaticJsonDocument<4096> doc;
    doc["wifi_ssid"] = wifiSSID;
    doc["wifi_pass"] = wifiPassword;
    doc["wifi_ssid2"] = wifiSSID2;
    doc["wifi_pass2"] = wifiPassword2;
    doc["uart2_mode"] = uart2ModeToCode(uart2Mode);
    doc["uart2_baud"] = uart2BaudRate;
    doc["uart2_data_bits"] = uart2DataBits;
    doc["uart2_parity"] = uart2ParityToCode(uart2Parity);
    doc["uart2_stop_bits"] = uart2StopBits;
    doc["uart2_rx_pin"] = GPS_UART_RX_PIN;
    doc["uart2_tx_pin"] = GPS_UART_TX_PIN;
    doc["cluster_host"] = clusterHost;
    doc["cluster_port"] = clusterPort;
    doc["pota_host"] = potaClusterHost;
    doc["pota_port"] = potaClusterPort;
    doc["pota_filter"] = potaFilterCommand;
    doc["pota_api_url"] = potaApiUrl;
    doc["hamalert_host"] = hamalertHost;
    doc["hamalert_port"] = hamalertPort;
    doc["hamalert_login"] = hamalertLogin;
    doc["hamalert_password"] = hamalertPassword;
    doc["user_callsign"] = userCallsign;
    doc["user_locator"] = userLocator;
    doc["timezone"] = timezoneHours;
    doc["user_lat"] = userLat;
    doc["user_lon"] = userLon;
    doc["user_lat_lon_valid"] = userLatLonValid;
    doc["use_gps_if_active"] = useGpsIfActive;
    doc["uart2_connected_module"] = uart2ConnectedModule;
    doc["bridge_paired_name"] = bridgeBtPairedName;
    doc["bridge_paired_addr"] = formatBridgeBtAddressForDisplay(bridgeBtPairedAddress);
    doc["qrz_user"] = qrzUsername;
    doc["qrz_pass"] = qrzPassword;
    doc["weather_key"] = weatherApiKey;
    doc["openwebrx_url"] = openWebRxUrl;
    doc["tft_backlight"] = backlightPercent;
    doc["tft_night_dimming"] = tftNightDimmingPercent;
    doc["tft_invert"] = tftInvertColors;
    doc["tft_rotation"] = tftRotation;
    doc["tft_lang"] = tftLangToCode(tftLanguage);
    doc["tft_style"] = tftStyleToCode(tftStyleMode);
    doc["table_size"] = dxTableSizeToCode(dxTableSizeMode);
    doc["tft_auto_switch"] = tftAutoSwitchEnabled;
    doc["tft_switch_time_sec"] = tftAutoSwitchTimeSec;
    doc["menu_hue"] = menuThemeHue;
    doc["qrz_status"] = qrzStatus;
    doc["cluster_noann"] = clusterNoAnnouncements;
    doc["cluster_nowwv"] = clusterNoWWV;
    doc["cluster_nowcy"] = clusterNoWCY;
    doc["cluster_usefilters"] = clusterUseFilters;
    doc["cluster_filters"] = clusterFilterCommands;
    doc["aprs_host"] = aprsIsHost;
    doc["aprs_port"] = aprsIsPort;
    doc["aprs_callsign"] = aprsCallsign;
    doc["aprs_passcode"] = aprsPasscode;
    doc["aprs_ssid"] = aprsSsid;
    doc["aprs_radius"] = aprsFilterRadius;
    doc["aprs_beacon"] = aprsBeaconEnabled;
    doc["aprs_symbol"] = aprsSymbolTwoChar;
    doc["aprs_comment"] = aprsUserComment;
    doc["aprs_alert"] = aprsAlertCsv;
    doc["aprs_alert_enabled"] = aprsAlertEnabled;
    doc["aprs_alert_nearby_enabled"] = aprsAlertNearbyEnabled;
    doc["aprs_alert_wx_enabled"] = aprsAlertWxEnabled;
    doc["weather_alert_storm_enabled"] = weatherAlertStormEnabled;
    doc["weather_alert_wind_enabled"] = weatherAlertWindEnabled;
    doc["weather_alert_wind_threshold_ms"] = weatherAlertWindThresholdMs;
    doc["aprs_alert_min_sec"] = aprsAlertMinSeconds;
    doc["aprs_alert_screen_sec"] = aprsAlertScreenSeconds;
    doc["aprs_alert_distance_km"] = aprsAlertDistanceKm;
    doc["enable_led_alert"] = enableLedAlert;
    doc["led_alert_duration_ms"] = ledAlertDurationMs;
    doc["led_alert_blink_ms"] = ledAlertBlinkMs;
    doc["aprs_interval_min"] = aprsIntervalMinutes;
    
