tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
    // Touch calibration mode - priorytet: pełna kombinacja > rotacje > swap > both > single invert
    String touchMode = "none";
    if (touchSwapXY && touchInvertX && touchInvertY) {
      touchMode = "xy_both";
    } else if (touchSwapXY && touchInvertX) {
      touchMode = "rot90cw";
    } else if (touchSwapXY && touchInvertY) {
      touchMode = "rot90ccw";
    } else if (touchSwapXY) {
      touchMode = "xy";
    } else if (touchInvertX && touchInvertY) {
      touchMode = "both";
    } else if (touchInvertX) {
      touchMode = "x";
    } else if (touchInvertY) {
      touchMode = "y";
    }
    doc["touch_swap_mode"] = touchMode;
    doc["touch_rotation"] = touchRotation;
    
    JsonArray orderArr = doc.createNestedArray("screen_order");
    for (int i = 0; i < SCREEN_ORDER_COUNT; i++) {
      orderArr.add(screenTypeToCodeStr(screenOrder[i]));
    }
    
    
    String json;
    serializeJson(doc, json);
    server->send(200, "application/json", json);
  });
  
  server->begin();
  Serial.println("Serwer WWW uruchomiony");
}

// ========== HTML PAGES ==========

String getMainHTML() {
  return "<!DOCTYPE html><html><head><meta charset='UTF-8'></head>"
         "<body>index.html missing in LittleFS</body></html>";
}
String getConfigHTML() {
  return getMainHTML(); // UĹĽywa tego samego HTML z JavaScript
}

#ifdef ENABLE_TFT_DISPLAY
TaskHandle_t uiTaskHandle = nullptr;

void uiTaskLoop(void *parameter) {
  (void)parameter;
  for (;;) {
    unsigned long now = millis();

    if (tftInitialized) {
      bool pendingScreen1 = false;
      bool pendingScreen2 = false;
      bool pendingScreen6 = false;
      bool pendingScreen7 = false;
      bool pendingAnyScreen = false;
      uint8_t pendingAnyScreenId = SCREEN_HAM_CLOCK;
      portENTER_CRITICAL(&uiPendingRedrawMux);
      pendingScreen1 = uiPendingScreen1Redraw;
      pendingScreen2 = uiPendingScreen2Redraw;
      pendingScreen6 = uiPendingScreen6Redraw;
      pendingScreen7 = uiPendingScreen7Redraw;
      pendingAnyScreen = uiPendingAnyScreenRedraw;
      pendingAnyScreenId = uiPendingAnyScreenId;
      uiPendingScreen1Redraw = false;
      uiPendingScreen2Redraw = false;
      uiPendingScreen6Redraw = false;
      uiPendingScreen7Redraw = false;
      uiPendingAnyScreenRedraw = false;
      portEXIT_CRITICAL(&uiPendingRedrawMux);

      if (pendingAnyScreen && currentScreen == (ScreenType)pendingAnyScreenId && !inMenu && !aprsAlertScreenActive) {
        drawScreen((ScreenType)pendingAnyScreenId);
      }

      if (pendingScreen1 && currentScreen == SCREEN_HAM_CLOCK && !inMenu && !aprsAlertScreenActive) {
        drawScreen(SCREEN_HAM_CLOCK);
      }
      if (pendingScreen2 && currentScreen == SCREEN_DX_CLUSTER && !inMenu && !aprsAlertScreenActive) {
        drawScreen(SCREEN_DX_CLUSTER);
      }
      if (pendingScreen7 && currentScreen == SCREEN_POTA_CLUSTER && !inMenu && !aprsAlertScreenActive) {
        drawScreen(SCREEN_POTA_CLUSTER);
      }
      if (pendingScreen6 && (currentScreen == SCREEN_APRS_IS || currentScreen == SCREEN_APRS_RADAR) && !inMenu && !aprsAlertScreenActive) {
        drawScreen(currentScreen);
      }

      if (aprsAlertDrawPending && !brightnessMenuActive) {
        APRSStation pendingStation;
        portENTER_CRITICAL(&aprsAlertPendingMux);
        pendingStation = aprsAlertPendingStation;
        aprsAlertDrawPending = false;
        portEXIT_CRITICAL(&aprsAlertPendingMux);
        ALERT_Screen(pendingStation);
      }
      if (weatherAlertDrawPending && !brightnessMenuActive && !aprsAlertScreenActive) {
        WeatherAlertInfo pendingInfo;
        portENTER_CRITICAL(&weatherAlertPendingMux);
        pendingInfo = weatherAlertPendingInfo;
        weatherAlertDrawPending = false;
        portEXIT_CRITICAL(&weatherAlertPendingMux);
        WEATHER_ALERT_Screen(pendingInfo);
      }
      updateAlertScreenTimeout();
      handleTouchNavigation();
    }

    if (tftAutoSwitchEnabled && tftInitialized && !inMenu && !aprsAlertScreenActive && !touchCalActive && !brightnessMenuActive && currentScreen != SCREEN_UNLIS_HUNTER) {
      unsigned long nowSwitch = millis();
      if (autoswitchPausedUntilMs > 0 && nowSwitch < autoswitchPausedUntilMs) {
        // autoswitch zapauzowany po dotknięciu środka ekranu
      } else {
      if (tftAutoSwitchLastMs == 0 || tftAutoSwitchLastScreen != currentScreen) {
        tftAutoSwitchLastMs = nowSwitch;
        tftAutoSwitchLastScreen = currentScreen;
      } else {
        unsigned long intervalMs = (unsigned long)tftAutoSwitchTimeSec * 1000UL;
        if (intervalMs > 0 && (nowSwitch - tftAutoSwitchLastMs) >= intervalMs) {
          ScreenType nextScreen = getNextScreenId(currentScreen);
          if (nextScreen != SCREEN_OFF && nextScreen != currentScreen) {
            currentScreen = nextScreen;
            drawScreen(currentScreen);
          }
          tftAutoSwitchLastMs = nowSwitch;
          tftAutoSwitchLastScreen = currentScreen;
        }
      }
      } // koniec else (autoswitch nie zapauzowany)
    }

    if (!restartRequested) {
      if (tftInitialized && currentScreen == SCREEN_HAM_CLOCK && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreen1UpdateMs > 1000) {
          updateScreen1Clock();
          lastScreen1UpdateMs = now;
        }
        updateScreen1Header();
        updateScreen1Date();
      }

      if (tftInitialized && currentScreen == SCREEN_DX_CLUSTER && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreenUpdate > 100) {
          updateScreen2Data();
          lastScreenUpdate = now;
        }
      }

      if (tftInitialized && currentScreen == SCREEN_POTA_CLUSTER && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreen7UpdateMs > 200) {
          updateScreen7Data();
          lastScreen7UpdateMs = now;
        }
      }

      if (tftInitialized && currentScreen == SCREEN_HAMALERT_CLUSTER && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreen8UpdateMs > 200) {
          updateScreen8Data();
          lastScreen8UpdateMs = now;
        }
      }

