tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
      if (tftInitialized && (currentScreen == SCREEN_APRS_IS || currentScreen == SCREEN_APRS_RADAR) && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreenUpdate > 100) {
          updateScreen6Data();
          lastScreenUpdate = now;
        }
      }

      if (tftInitialized && currentScreen == SCREEN_SUN_SPOTS && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreen3UpdateMs > 1000) {
          updateScreen3Data();
          lastScreen3UpdateMs = now;
        }
      }

      if (tftInitialized && currentScreen == SCREEN_BAND_INFO && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreen4UpdateMs > 1000) {
          updateScreen4Data();
          lastScreen4UpdateMs = now;
        }
      }

      if (tftInitialized &&
          (currentScreen == SCREEN_WEATHER_DSP || currentScreen == SCREEN_WEATHER_FORECAST) &&
          !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreen5UpdateMs > 1000) {
          updateScreen5Data();
          lastScreen5UpdateMs = now;
        }
      }

      if (tftInitialized && currentScreen == SCREEN_LOKALIZACJA && !inMenu && !aprsAlertScreenActive) {
        if (now - lastScreenLocationUpdateMs > 1000) {
          updateLokalizacjaFields();
          lastScreenLocationUpdateMs = now;
        }
      }

      if (tftInitialized && currentScreen == SCREEN_MATRIX_CLOCK && !inMenu && !aprsAlertScreenActive) {
        updateScreen10();
      }

      if (tftInitialized && currentScreen == SCREEN_UNLIS_HUNTER && !inMenu && !aprsAlertScreenActive) {
        updateUnlisHunter();
      }
    }

    vTaskDelay(pdMS_TO_TICKS(10));
  }
}
#endif

// ========== SETUP & LOOP ==========

void setup() {
  // Ten log idzie "kana" (zwykle tym samym co bootlog),
  // wiÄ™c pozwala sprawdziÄ‡ czy aplikacja w ogĂłle startuje.
  esp_rom_printf("\nAPP: setup() start\n");

  Serial.begin(115200);
  // Na ESP32-C3 (zwłaszcza z USB CDC) warto chwilę poczekać na monitor portu
  unsigned long serialWaitStart = millis();
  while (!Serial && (millis() - serialWaitStart) < 2000) {
    delay(10);
  }
  delay(200);
  esp_rom_printf("APP: Serial.begin done\n");

  gpsNmeaLine.reserve(180);
  gpsLastRxMs = 0;
  gpsRawBridgeStartMs = 0;
  gpsRawBridgeEndLogged = true;
  gpsRawLastStatsMs = 0;
  gpsRawBytesTotal = 0;
  gpsRawBytesSinceStats = 0;

  // Daj chwilÄ™ na ustabilizowanie WiFi/PHY po resecie (zwĹ‚aszcza na "Super Mini")
  delay(300);

  if (dxSpotsMutex == nullptr) {
    dxSpotsMutex = xSemaphoreCreateMutex();
  }
  if (potaSpotsMutex == nullptr) {
    potaSpotsMutex = xSemaphoreCreateMutex();
  }
  if (hamalertSpotsMutex == nullptr) {
    hamalertSpotsMutex = xSemaphoreCreateMutex();
  }
  if (weatherDataMutex == nullptr) {
    weatherDataMutex = xSemaphoreCreateMutex();
  }

  initStatusRgbLed();
  updateStatusRgbLed();
  
  // WyĹ›wietlacz TFT (ESP32-2432S028) â€“ inicjalizacja NA POCZÄ„TKU (jak w projekcie referencyjnym)
  // TFT powinien byÄ‡ inicjalizowany zaraz po Serial.begin(), przed innymi peryferiami
#ifdef ENABLE_TFT_DISPLAY
  initTFT();
  yield();
#endif

  littleFsReady = LittleFS.begin(true);
  logRamUsage(millis());
  if (littleFsReady) {
    bootLogLine("LittleFS OK");
    if (LittleFS.exists(ROBOTO_FONT20_FILE)) {
      File f = LittleFS.open(ROBOTO_FONT20_FILE, "r");
      if (f) {
        bootLogLine(String("Font OK: ") + ROBOTO_FONT20_FILE + " size=" + f.size());
        f.close();
      }
    } else {
      bootLogLine(String("Font missing: ") + ROBOTO_FONT20_FILE);
    }
  } else {
    bootLogLine("LittleFS FAIL");
  }

  bootLogLine("");
  bootLogLine("ESP32 DX Cluster Receiver");
  bootLogLine("==============================");
  
  // DIAGNOSTYKA: Sprawdź czy ENABLE_TFT_DISPLAY jest zdefiniowane
#ifdef ENABLE_TFT_DISPLAY
  bootLogLine("ENABLE_TFT_DISPLAY - init TFT");
#else
  bootLogLine("UWAGA: ENABLE_TFT_DISPLAY NIE jest zdefiniowane - TFT dont work!");
  bootLogLine("Upewnij sie, że kompilujesz dla środowiska 'esp32-2432s028'");
#endif
  yield();

  bootLogLine("Config load...");
  loadPreferences();
  telnetBuffer.reserve(384);
  pendingTelnetLine.reserve(384);
  potaTelnetBuffer.reserve(384);
  pendingPotaLine.reserve(384);
  aprsBuffer.reserve(384);
  qrzStatus.reserve(64);
  clusterFilterCommands.reserve(128);
  weatherData.description.reserve(96);
  weatherData.cityName.reserve(48);
  weatherData.forecast3hDesc.reserve(64);
  weatherData.forecastNextDayDesc.reserve(64);
  weatherData.forecastError.reserve(80);
  weatherData.lastError.reserve(64);
  weatherData.iconCode.reserve(8);
  propagationData.lastError.reserve(48);
  yield();
  configureUart2Port();
#ifdef ENABLE_TFT_DISPLAY
  applyTftRotation();
  applyTouchRotation();
  setBacklightPercent(backlightPercent);
#endif
  
  bootLogLine("WIFI starting...");
  if (wifiSSID.length() > 0) {
    bootLogLine("Connecting WiFi: " + wifiSSID);
    if (connectToWiFi()) {
      wifiConnectedAtMs = millis();
      bootLogLine("WiFi connected!");
      yield();
      updateNTPTime();
      yield();
      connectToCluster();
      connectToPotaCluster();
    } else {
      bootLogLine("WiFi error, starting AP mode...");
      startAPMode();
    }
  } else {
    bootLogLine("No WiFi configuration, starting AP mode...");
    startAPMode();
  }
  yield();
  
  bootLogLine("Starting web server...");
  setupWebServer();
  yield();
  
  bootLogLine("System ready!");
  String ipStr = wifiConnected ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
  bootLogLine("IP: " + ipStr);
  
  // Aktualizuj wyĹ›wietlacz TFT (ekran startowy)
#ifdef ENABLE_TFT_DISPLAY
  drawWelcomeScreenYellow();
  delayWithRamLogs(4000);
  drawWelcomeScreenGreen();
  delayWithRamLogs(3000);

  if (littleFsReady) {
    warmupSmoothFonts();
  }
  logRamUsage(millis());

  bootSequenceActive = false;
  drawScreen(currentScreen);
  resetTftAutoSwitchTimer();
  if (currentScreen == SCREEN_HAM_CLOCK) {
    updateScreen1();
  }

  if (uiTaskHandle == nullptr) {
    xTaskCreatePinnedToCore(
      uiTaskLoop,
      "UI_Task",
      8192,
      nullptr,
      2,
      &uiTaskHandle,
      1
    );
  }
#endif
}

void loop() {
  static unsigned long loopCounter = 0;
  static unsigned long lastLoopPrint = 0;
  loopCounter++;
  
  unsigned long now = millis();
  
  // Feed watchdog
  yield();

  logRamUsage(now);
  pollGpsSerial();
  serviceBridgeBtsppOnRetry(now);
  serviceBridgeBootForceCommands(now);
  serviceAprsTncBootRestart(now);
  logGpsStatusEvery5s(now);

  bool gpsTimeActiveNow = isGpsTimeSourceActive(now);
  if (gpsTimeActiveNow) {
    syncSystemTimeFromGps(now);
  }

  if (gpsTimeActiveNow != gpsTimeSourceWasActive) {
    if (gpsTimeActiveNow) {
      Serial.printf("[TIME] Zrodlo czasu: GPS FIX (%s)\n", formatGpsUtcForLog().c_str());
    } else {
      Serial.println("[TIME] Zrodlo czasu: fallback NTP/www (brak aktywnego GPS FIX)");
      // WymuĹ› odĹ›wieĹĽenie NTP zaraz po utracie GPS.
      lastNTPUpdate = 0;
    }
    gpsTimeSourceWasActive = gpsTimeActiveNow;
  }

  // Odroczony restart (ĹĽeby odpowiedĹş HTTP zdÄ…ĹĽyĹ‚a wyjĹ›Ä‡)
  if (restartRequested && (long)(millis() - restartAtMs) >= 0) {
    LOGV_PRINTLN("[LOOP] Restart requested - restarting...");
    delay(50);
    ESP.restart();
  }
  
  // ObsĹ‚uga serwera WWW
  if (server != nullptr) {
    server->handleClient();
  }
  
  // Aktualizuj czas NTP
  updateNTPTime();
  
