tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
  // ObsĹ‚uga WiFi
  if (!wifiConnected && WiFi.status() == WL_CONNECTED) {
    wifiConnected = true;
    wifiConnectedAtMs = now;
    Serial.print("STA połączone…czone. IP: ");
    Serial.println(WiFi.localIP());
    // Jeżeli wcześniej był uruchomiony AP do konfiguracji, wyłącz go po udanym połączeniu STA,
    // żeby nie robić wrażenia "zwiechy" (klient AP traci link przy przełączeniu kanału).
    if (WiFi.getMode() & WIFI_AP) {
      Serial.println("Wyłączam AP (portal) po połączeniu STA. Użyj IP z sieci domowej.");
      WiFi.softAPdisconnect(true);
      WiFi.mode(WIFI_STA);
    }
    

    updateNTPTime();
    connectToCluster();
    connectToPotaCluster();
  } else if (wifiConnected && WiFi.status() != WL_CONNECTED) {
    LOGV_PRINTLN("[LOOP] WiFi status zmieniony: połączony -> rozłączony");
    wifiConnected = false;
    telnetConnected = false;
    potaTelnetConnected = false;
    aprsConnected = false;
    if (aprsClient.connected()) {
      aprsClient.stop();
    }
    LOGV_PRINTLN("[LOOP] STA rozłączone (wracam do trybu offline/AP jeśli aktywne).");
  }

  updateStatusRgbLed();

  // W trybie STA okresowo ponawiaj aktywną próbę połączenia.
  retryWiFiFromSTAIfDue(now);

  // W trybie AP okresowo podejmuj bezpieczną próbę powrotu do STA.
  retryWiFiFromAPIfDue(now);

  // Jeśli jesteśmy offline, zostajemy w AP (portal) — stabilnie.

  const bool networkServicesReady = wifiConnected && ((now - wifiConnectedAtMs) >= NETWORK_SERVICES_START_DELAY_MS);
  
  // Obsługa Telnet
  if (wifiConnected) {
    if (!telnetConnected) {
      LOGV_PRINTLN("[LOOP] WiFi OK, próba połączenia z Cluster...");
      connectToCluster();
    } else {
      handleTelnetData();
    }
  }

  // Obsługa POTA Telnet
  if (networkServicesReady) {
    // Tryb HTTP API zamiast Telnetu (źródło: https://api.pota.app/v1/spots)
    if (lastPotaApiFetchMs == 0 || now - lastPotaApiFetchMs > POTA_API_FETCH_INTERVAL_MS) {
      if (fetchPotaApi()) {
        lastPotaApiFetchMs = now;
      } else {
        // nawet przy błędzie aktualizuj czas, by nie spamować API
        lastPotaApiFetchMs = now;
      }
    }

    // HAMALERT przez Telnet: set/json + sh/dx 30
    if (lastHamalertFetchMs == 0 || now - lastHamalertFetchMs > HAMALERT_FETCH_INTERVAL_MS) {
      fetchHamalertTelnet();
      lastHamalertFetchMs = now;
    }
  }

  // ObsĹ‚uga APRS-IS (wylaczona, gdy APRS idzie z UART2 TNC)
  if (networkServicesReady) {
    if (isAprsNetworkFeedEnabled()) {
      if (!aprsConnected) {
        LOGV_PRINTLN("[LOOP] WiFi OK, prĂłba poĹ‚Ä…czenia z APRS-IS...");
        connectToAPRS();
      } else {
        handleAPRSData();
        unsigned long nowAprs = millis();
        refreshAprsFilterIfNeeded(nowAprs);
        
        // Watchdog APRS: jeĹ›li brak danych przez dĹ‚uĹĽszy czas, zrĂłb reconnect
        unsigned long inactivityTime = nowAprs - lastAPRSRxMs;
        if (inactivityTime > APRS_INACTIVITY_RECONNECT_MS) {
          LOGV_PRINT("[LOOP] WARNING: Brak danych z APRS-IS przez ");
          LOGV_PRINT(inactivityTime / 1000);
          LOGV_PRINTLN(" sekund -> reconnect");
          aprsClient.stop();
          aprsConnected = false;
          aprsLoginSent = false;
          // connectToAPRS() odpali siÄ™ w kolejnych iteracjach
        }
      }
    } else {
      if (aprsConnected || aprsClient.connected()) {
        aprsClient.stop();
      }
      aprsConnected = false;
      aprsLoginSent = false;
      if (!isUart2AprsTncKissModuleSelected()) {
        nextAPRSPositionDueMs = 0;
        aprsBeaconTxCount = 0;
      }
    }
  }

  serviceAprsBeaconTx(now);

  // Aktualizuj dane propagacyjne (hamqsl solarxml)
  if (wifiConnected) {
    unsigned long now = millis();
    unsigned long interval = lastPropagationFetchOk ? PROPAGATION_FETCH_INTERVAL_MS
                                                   : PROPAGATION_FETCH_RETRY_MS;
    if (lastPropagationFetchMs == 0 || now - lastPropagationFetchMs > interval) {
      lastPropagationFetchOk = fetchPropagationData();
      lastPropagationFetchMs = now;

    }
  }

  // ObsĹ‚uga kolejki QRZ (asynchronicznie)
  if (wifiConnected && qrzQueueLen > 0 &&
      qrzUsername.length() > 0 && qrzPassword.length() > 0) {
    unsigned long now = millis();
    unsigned long qrzInterval = getQrzLookupIntervalMs();
    if (now - lastQrzLookupMs >= qrzInterval) {
      for (int i = 0; i < qrzQueueLen; i++) {
        if (now < qrzQueue[i].nextTryMs) {
          continue;
        }
        String grid;
        String country;
        double lat = 0.0;
        double lon = 0.0;
        bool hasLatLon = false;
        bool ok = fetchQrzCallsignInfo(qrzQueue[i].callsign, grid, country, lat, lon, hasLatLon);
        lastQrzLookupMs = now;
        if (ok) {
          updateSpotsWithQrz(qrzQueue[i].callsign, grid, country, lat, lon, hasLatLon);
          removeQrzQueueAt(i);
        } else {
          qrzQueue[i].attempts++;
          if (qrzQueue[i].attempts >= QRZ_RETRY_LIMIT) {
            removeQrzQueueAt(i);
          } else {
            qrzQueue[i].nextTryMs = now + QRZ_RETRY_DELAY_MS;
          }
        }
        break; // jedna prĂłba na iteracjÄ™
      }
    }
  }

  // Aktualizuj pogodÄ™ (OpenWeather)
  if (wifiConnected) {
    unsigned long now = millis();
    unsigned long interval = lastWeatherFetchOk ? WEATHER_FETCH_INTERVAL_MS
                                               : WEATHER_FETCH_RETRY_MS;
    if (lastWeatherFetchMs == 0 || now - lastWeatherFetchMs > interval) {
      lastWeatherFetchOk = fetchWeatherData();
      lastWeatherFetchMs = now;
      applyBacklightByDayNight(true);
    }
  }

  // Weryfikacja dzień/noc z OWM co 5 minut i dostosowanie podświetlenia TFT
  if (tftInitialized && !brightnessMenuActive) {
    if (lastBacklightDayNightCheckMs == 0 || (now - lastBacklightDayNightCheckMs) >= BACKLIGHT_DAY_NIGHT_CHECK_INTERVAL_MS) {
      applyBacklightByDayNight(false);
      lastBacklightDayNightCheckMs = now;
    }
  }

  processWeatherAlertSchedule();

  // Przetwarzaj maks. 1 liniÄ™ telnet na iteracjÄ™ (ĹĽeby nie zamroziÄ‡ WWW/UI)
  if (pendingTelnetLine.length() > 0) {
    LOGV_PRINT("[LOOP] Przetwarzanie linii telnet, len=");
    LOGV_PRINTLN(pendingTelnetLine.length());
    LOGV_PRINT("[LOOP] Linia: ");
    if (pendingTelnetLine.length() > 80) {
      LOGV_PRINTLN(pendingTelnetLine.substring(0, 80) + "...");
    } else {
      LOGV_PRINTLN(pendingTelnetLine);
    }
    
    String line = pendingTelnetLine;
    pendingTelnetLine = ""; // WyczyĹ›Ä‡ PRZED parsowaniem (ĹĽeby nie gromadziÄ‡)
    yield(); // Feed watchdog przed dĹ‚ugÄ… operacjÄ…
    
    DXSpot spot;
    unsigned long parseStart = millis();
    if (parseDXSpot(line, spot)) {
      unsigned long parseTime = millis() - parseStart;
      if (parseTime > 50) {
        LOGV_PRINT("[LOOP] WARNING: parseDXSpot zajÄ™Ĺ‚o ");
        LOGV_PRINT(parseTime);
        LOGV_PRINTLN("ms");
      }
      addSpot(spot);
      // Aktualizuj wyĹ›wietlacz TFT z nowymi spotami (tylko jeĹ›li jesteĹ›my na ekranie 2)

