tidabek/ESP32-HAM-CLOCK/src/ESP32-HAM-CLOCK.ino
    }
  }

  if (pendingPotaLine.length() > 0) {
    String line = pendingPotaLine;
    pendingPotaLine = "";

    DXSpot spot;
    if (parsePotaSpot(line, spot) && spot.mode == "SSB") {
      applyQrzCacheToSpot(spot, QRZ_CACHE_TTL_MS);
      addPotaSpot(spot);
      bool qrzConfigured = (qrzUsername.length() > 0 && qrzPassword.length() > 0);
      // Dodaj lookup QRZ tylko jeśli country jest puste (nie dubluj dla DX Cluster)
      if (qrzConfigured && spot.country.length() == 0 && spot.callsign.length() > 0) {
        String call = spot.callsign;
        call.toUpperCase();
        enqueueQrzLookup(call);
      }

    }
  }

  // Watchdog telnet: jeĹ›li brak danych z clustra przez dĹ‚uĹĽszy czas, zrĂłb reconnect
  if (telnetConnected && telnetClient.connected()) {
    unsigned long now = millis();
    unsigned long inactivityTime = now - lastTelnetRxMs;
    if (inactivityTime > TELNET_INACTIVITY_RECONNECT_MS) {
      LOGV_PRINT("[LOOP] WARNING: Brak danych z DX Cluster przez ");
      LOGV_PRINT(inactivityTime / 1000);
      LOGV_PRINTLN(" sekund -> reconnect");
      telnetClient.stop();
      telnetConnected = false;
      clusterLoginSent = false;
      clusterLoginScheduled = false;
      // connectToCluster() odpali siÄ™ w kolejnych iteracjach
    } else if (inactivityTime > 240000) { // OstrzeĹĽenie po 4 minutach
      LOGV_PRINT("[LOOP] WARNING: Brak danych z Cluster przez ");
      LOGV_PRINT(inactivityTime / 1000);
      LOGV_PRINTLN(" sekund (blisko timeout)");
    }
  }

  if (potaTelnetConnected && potaTelnetClient.connected()) {
    unsigned long now = millis();
    unsigned long inactivityTime = now - lastPotaRxMs;
    if (inactivityTime > POTA_TELNET_INACTIVITY_RECONNECT_MS) {
      LOGV_PRINT("[LOOP] WARNING: Brak danych z POTA Cluster przez ");
      LOGV_PRINT(inactivityTime / 1000);
      LOGV_PRINTLN(" sekund -> reconnect");
      potaTelnetClient.stop();
      potaTelnetConnected = false;
      potaLoginSent = false;
      potaLoginScheduled = false;
    }
  }

  // WyĹ›lij znak (login) jeĹ›li zaplanowany
  if (telnetConnected && telnetClient.connected() && clusterLoginScheduled) {
    if ((long)(millis() - clusterSendLoginAtMs) >= 0) {
      LOGV_PRINTLN("[LOOP] WysyĹ‚anie loginu do Cluster...");
      clusterLoginScheduled = false;
      if (!clusterLoginSent) {
        String login = userCallsign;
        login.trim();
        if (login.length() == 0) {
          login = DEFAULT_CALLSIGN;
        }
        
        // JeĹ›li mamy lokator, dodaj go do loginu w formacie: callsign/locator
        // Format zgodny z CC-Cluster (dxspots.com) i wiÄ™kszoĹ›ciÄ… DX ClusterĂłw
        if (userLocator.length() >= 4) {
          login += "/";
          login += userLocator;
          Serial.print("[CLUSTER] Login -> ");
          Serial.print(login);
          Serial.print(" (callsign/locator)");
          if (userCallsign.length() == 0) {
            Serial.print(" - domyĹ›lny znak, ustaw swĂłj w Config");
          }
          Serial.println();
        } else {
          Serial.print("[CLUSTER] Login -> ");
          Serial.print(login);
          if (userCallsign.length() == 0) {
            Serial.print(" (domyĹ›lny, ustaw swĂłj znak w Config)");
          } else {
            Serial.print(" (bez lokatora - ustaw w Config dla lepszej funkcjonalnoĹ›ci)");
          }
          Serial.println();
        }
        
        telnetClient.print(login);
        telnetClient.print("\r\n");
        clusterLoginSent = true;
        lastClusterKeepAliveMs = millis();
        Serial.println("[CLUSTER] Login wys\u0142any");
        
        // Po zalogowaniu wyĹ›lij komendy konfiguracyjne CC-Cluster (z opĂłĹşnieniem)
        // Daj czas clusterowi na przetworzenie loginu
        delay(500);
        sendClusterConfigCommands();
      }
    }
  }

  if (potaTelnetConnected && potaTelnetClient.connected() && potaLoginScheduled) {
    if ((long)(millis() - potaSendLoginAtMs) >= 0) {
      potaLoginScheduled = false;
      if (!potaLoginSent) {
        String login = userCallsign;
        login.trim();
        if (login.length() == 0) {
          login = DEFAULT_CALLSIGN;
        }
        if (userLocator.length() >= 4) {
          login += "/";
          login += userLocator;
        }
        potaTelnetClient.print(login);
        potaTelnetClient.print("\r\n");
        potaLoginSent = true;
        lastPotaKeepAliveMs = millis();
      }
    }
  }

  // Keepalive: niektĂłre klastry zrywajÄ… idle telnet, wiÄ™c co ~30s wysyĹ‚amy CRLF
  if (telnetConnected && telnetClient.connected()) {
    unsigned long now = millis();
    if (now - lastClusterKeepAliveMs > 30000) {
      LOGV_PRINTLN("[LOOP] WysyĹ‚anie keepalive do Cluster");
      telnetClient.print("\r\n");
      lastClusterKeepAliveMs = now;
    }
  }

  if (potaTelnetConnected && potaTelnetClient.connected()) {
    unsigned long now = millis();
    if (now - lastPotaKeepAliveMs > 30000) {
      potaTelnetClient.print("\r\n");
      lastPotaKeepAliveMs = now;
    }
  }
  
  // Feed watchdog przed delay
  yield();
  delay(10); // Małe opóźnienie dla stabilności
  
  // marker usuniÄ™ty - bez spamowania logu
}

